[{"From": "Nadine Tim <Nadine.Tim@aucampus.onmicrosoft.com>", "Subject": "Projector failure", "Message": "Hi,  please, we have a class in R218 and the projector is not working. We need assistance with resolving the issue. Kind Regards,Nadine Tim.", "Class": "0"}, {"From": "Efua Enyimayew <efua.enyimayew@ashesi.edu.gh>", "Subject": "Applied project not showing", "Message": "Good afternoon,   My name is Efua Enyimayew, class of 2018. I took my applied project during last semester and the slot was showing on courseware but not on focus. I reported it and was asked to email the Support Centre.   Thank you,  Efua Enyimayew.  ", "Class": "0"}, {"From": "Efua Bentil <Efua.Bentil@aucampus.onmicrosoft.com>", "Subject": "COURSES ON FOCUS", "Message": "Dear Sir/Madam, Good day and a happy new year to you. Please I have checked my focus and discovered that I am registered for pre-calculus 2 instead of pre-calculus 1 which is not supposed to be so because I did not meet the pass mark for pre-calculus 1 to move on to pre-calculus 2. Also, I do not have the various venues where my classes will be taking place attached to my courses on focus and so I have no idea where my classes will be held. I received an email yesterday concerning my math course and I was told to pass by the registry today to confirm my math course. I passed by the registry and filled a report but I have not received any feedback on the issue and so I thought an email would be helpful. I would be very glad and grateful if this problem is fixed for me before the close of day today so I may be able to go about my classes as I scheduled.Thank you.  Best Regards,Efua Bentil.", "Class": "0"}, {"From": "Ashesi Support Centre <supportcentre@ashesi.edu.gh>", "Subject": "Internet Outage", "Message": "Dear all, We wish to apologize for the current internet outage on campus.Our service provider reported a fiber disconnection between their NOC and MTN. Thechnicians are on the field to resolve the issue. In the meantime I.T is working with the ISP for an alternate solution. Sincere apologies for all inconveniences. Best regards.   Regards, Ashesi Support Centre  Ashesi University College  Berekuso, Ghana   Email         - supportcentre@ashesi.edu.gh Website     - www.ashesi.edu.gh Phone        - +233 302 610 330 OR +233 302 974 980 Extension   - 1111  Mobile        - +233 501 673 669 Office         - Engineering Room 105    How would you rate my reply? Great    Okay    Not Good {#HS:585628142-3803#}   ", "Class": "0"}, {"From": "Michael Lawson <Michael.Lawson@aucampus.onmicrosoft.com>", "Subject": "Inaccurate GPA", "Message": "Please I would like to report a missing course in my transcript. I took Leadership 2 last semester which has not been added to my CAMU. Waiting for feedback. Yours truly, Michael Lawson ", "Class": "0"}, {"From": "James Mugo <james.mugo@aucampus.onmicrosoft.com>", "Subject": "Wi-Fi doesn't support WhatsApp", "Message": "Greetings,   For the past 3 to 4 days, the Wi-Fi hasn't been supporting WhatsApp thereby making it so difficult for students to communicate especially with reference to academic groups.  This is very important to us. Kindly help.  Best, James  Get Outlook for Android ", "Class": "0"}, {"From": "Breanna Abbew <breanna.abbew@ashesi.edu.gh>", "Subject": "Unable to Sign In on CAMU", "Message": "Good Evening,  I am having trouble signing into my CAMU account. I have followed the instructions on signing in and I also changed my password once but I still cannot sign in.  Best Regards, Breanna Abbew ", "Class": "0"}, {"From": "Dinah Kotey Baidoo <dbaidoo@ashesi.edu.gh>", "Subject": "JSTOR access problem", "Message": "Dear David, May I know if there is any change in IP addresses. JSTOR has an access problem. Find a screenshot below of what showed up in JSTOR. The site is requesting for Account login details.    Thanks. Best regardsDinah Koteikor Baidoo Assistant LibrarianAshesi University College 1 University Avenue, Berekuso -E/RPMB CT3 CantonmentsAccra, Ghana.Tel: +233 302 610 330Cel: +233 208 197 049 / 246 808 671Email: dbaidoo@ashesi .edu.gh / kutbelle@gmail.comWebsite: www.ashesi.edu.gh   ", "Class": "0"}, {"From": "Lilian Annih <lilian.annih@ashesi.edu.gh>", "Subject": "Total Credits", "Message": "Good morning,Pls it seems the total credits for me has been changed to 2 so I  can only sign up for two courses. Pls can it be checked? Thanks Regards,Lilian Annih  Sent from Mail for Windows 10 ", "Class": "0"}, {"From": "Priscilla - Acheampong ", "Subject": "MCF Laptop Break Down", "Message": "Dear Miss Botchway,  I would like to humbly inform you that I have sent my laptop to IT office for repairs on Tuesday, 4th April.  I am a class of 2020 MCF Scholar. My laptop experienced an internal and external battery issue on Thursday, 29th March. I took it to the IT office for repairs.  However, I would like to enquire if it is possible for me to be given a spare laptop as I wait for my laptop to be fixed and returned to me.  Hope to hear from you soon. Thank you.   Sincerely, Priscilla Acheampong | c2020 Computer Science Major Ashesi University College 1 University Avenue, Berekuso  PMB CT 3, Cantonments, Accra, Ghana.  Email: priscilla.acheampong@ashesi.edu.gh pryllasammy@gmail.com  ", "Class": "0"}, {"From": "Allotei Pappoe <Allotei.Pappoe@aucampus.onmicrosoft.com>", "Subject": "No Internet Access", "Message": "Hello,  I am unable to use the ASHESI access point on my laptop. Whenever I connect it says there's no internet. Sometimes, on my phone, it works. Please help me resolve my issue. Thank you!   Regards,  Allotei Pappoe.   Get Outlook for Android ", "Class": "0"}, {"From": "Stephen Emmanuel Armah <searmah@ashesi.edu.gh>", "Subject": "Courseware is not working for me", "Message": "Dear Sir,I am Stephen Armah, Senior Lecturer and Head of BA department.I am teaching Africa and the Oil Industry and Leadership 3 this semester but I am not able to use Courseware. Is courseware dead?  I know CAMU is coming but I need the support for my classes. Stephen   Stephen E. Armah (Ph.D.)Senior Lecturer,Head of Business Administration Department,Director of the Ashesi Economics Lecture Series,Ashesi University College, Berekuso, E/R, Ghana.http://www.ashesi.edu.gh/academics/business-administration/faculty-pages-ba/659-armah-stephen.html   ", "Class": "0"}, {"From": "Ian Kluvitse <Ian.Kluvitse@aucampus.onmicrosoft.com>", "Subject": "Courseware Issue", "Message": "I am not registered for any Text and Meaning Class on courseware.", "Class": "0"}, {"From": "Hudson Taylor Lekunze <hudson.lekunze@ashesi.edu.gh>", "Subject": "Android Studio Installation", "Message": "Hello Support, This email is to request installation of Android Studio on at least 15 devices in the Labs for final year students taking Mobile Application Development. They need it to complete a project due on Friday. Regards,Hudson (Faculty Intern - Mobile Application Development)", "Class": "0"}, {"From": "Rebecca Awuah <rawuah@ashesi.edu.gh>", "Subject": "toner Faculty Down", "Message": "Hello, The Faculty Down printer is out of toner. Thanks,Rebecca Rebecca AwuahMathematics LecturerAshesi UniversityBerekuso, Ghana +233 30 261 0330www.ashesi.edu.gh ", "Class": "0"}, {"From": "Elorm Dela-Brown <elorm.dela-brown@aucampus.onmicrosoft.com>", "Subject": "Courseware login problems", "Message": "Good afternoon For some time I have been having issues logging into my courseware. I was given a password to use by the Support centre, that is, \"student\", however, it has not been working for some time now and I have been unable to access my courses through courseware. Due to the course evaluations that are ongoing, I saw it necessary to inform you of my issue. Kindly help me rectify the problem.  Thank you Elorm Dela-BrownOff-Campus Chairperson ", "Class": "0"}, {"From": "Edrine Ssemwanga <edrine.ssemwanga@aucampus.onmicrosoft.com>", "Subject": "Courseware Failure", "Message": "Hello ASC,please, I need access to my Courseware so that I can log in and reset my password. Best,Edrine", "Class": "0"}, {"From": "Jenipher Stoughtoni Quaye <jsquaye@ashesi.edu.gh>", "Subject": "ATM not dispensing money since Monday", "Message": "Hi Support,The subject above applies. Thanks,Jenipher", "Class": "0"}, {"From": "Raymond Munyaradzi Chivere RMC <raymond584chivere@gmail.com>", "Subject": "Add and Drop", "Message": "Hello,   The deadline for add and drop for continuing students is 2 February, but I have not been able to access the registration page,each time I try to login I get the following message: Registration is not yet open on this date (2018-2-1)   I would very much like to drop some courses. I've experienced this problem since Tuesday.   Looking forward to your speedy response.  RegardsRaymond Chivere  ", "Class": "0"}, {"From": "Patrick Awuah <pawuah@ashesi.edu.gh>", "Subject": "Wi-Fi not working near President's office", "Message": "We are unable to access the internet via Wi-Fi in the Exec conference room and president’s office. Ethernet works. Patrick", "Class": "0"}, {"From": "Jojo Mensah <jojo.mensah@aucampus.onmicrosoft.com>", "Subject": "My camu account", "Message": "My camu account isn’t working and my grammarly account isn’t sending the confirmation link  Get Outlook for iOS", "Class": "0"}, {"From": "Pearl Abbam <pinpearl@ymail.com>", "Subject": "Outlook sign in issues", "Message": "Hello,   I am unable to sign into my email account with my current password. Neither can I reset it, send or read emails.  Kindly help me.   Get Outlook for Android   Get Outlook for Android ", "Class": "0"}, {"From": "Sarah Parry <sarah.parry@aucampus.onmicrosoft.com>", "Subject": "Microsoft license", "Message": "Good afternoon,  I hope this email finds you well. I am writing this email to inform you that my Microsoft package has stopped working since I do not have a licence. Could you please help me out?.  With regards, Sarah Parry.    Get Outlook for Android ", "Class": "0"}, {"From": "Suzanne Buchele <sbuchele@ashesi.edu.gh>", "Subject": "Can't get into Records", "Message": "Hello, I haven’t been able to access Records in several weeks. I go to either of the following urls and it just times out. Every time. This is odd since I have sat with Eleanora and she can access the same urls and login. Help!https://sis.ashesi.edu.gh/courseware/cms2/records/https://sis.ashesi.edu.gh/records/ Thanks,Suzanne Suzanne F. Buchele, Ph.D.Provost and Associate ProfessorAshesi University College, GhanaTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Cell: +233-501-331-618Email: sbuchele@ashesi.edu.gh ", "Class": "0"}, {"From": "lbaer@ashesi.edu.gh", "Subject": "focus", "Message": "Hi – can you please help me access Focus? The username and password do not work. Thank you,Lenny", "Class": "0"}, {"From": "Afua Addo <Afua.Addo@aucampus.onmicrosoft.com>", "Subject": "MyCamu error", "Message": "Good morning,I am trying to register for my Applied Calculus course for the summer but on my MyCamu account it reads oops! Max. Number if credits per semester not defined. Could you please help me. Thank you. Afua.  Get Outlook for iOS", "Class": "0"}, {"From": "Ashesi Support Centre <supportcentre@ashesi.edu.gh>", "Subject": "Internet Issue at GCIC", "Message": "Hello Support,  The GCIC team is unable to access the internet and have reported this issue. Kindly assist them as this is urgent.  Regards, Ashesi Support Centre  Ashesi University College  Berekuso, Ghana   Email         - supportcentre@ashesi.edu.gh Website     - www.ashesi.edu.gh Phone        - +233 302 610 330 OR +233 302 974 980 Extension   - 1111  Mobile        - +233 501 673 669 Office         - Engineering Room 105    How would you rate my reply? Great    Okay    Not Good {#HS:535061797-3012#}   ", "Class": "0"}, {"From": "Zoe Zanu <zoe.afi.zanu@gmail.com>", "Subject": "Unable To Access Email Account", "Message": "Good morning, last Thursday I came to your office for my email but it had not been set up but you helped me get my username and told me my email will be ready on Friday morning.I've since been able to change my password and can log in to the school's machines and WiFi but I'm still not getting access to my email.I will really appreciate it very much if you could please help me.Yours sincerely,Zoe Zanu. ", "Class": "0"}, {"From": "Yaa Sarkodie <Yaa.Sarkodie@aucampus.onmicrosoft.com>", "Subject": "Wifi not Working in 2C Hostel", "Message": "Dear Support Centre,I hope this email finds you well? The Wi-Fi in 2c has been disconnected. This is really making it difficult in here since we have to move to the neighboring hostels or campus for connection. I will be glad if the problem can be checked for us today. Best Regards,Yaa Fremah Sarkodie.", "Class": "0"}, {"From": "Anna Okyere <Anna.Okyere@aucampus.onmicrosoft.com>", "Subject": "CONNECTION", "Message": "Hello please I can not to Ashesi air only staff and faculty and for staff and faculty it is not strong everywhere.   BestAnna. ", "Class": "0"}, {"From": "Gladys Arkorful <Gladys.Arkorful@aucampus.onmicrosoft.com>", "Subject": "Wifi", "Message": "Good morning  I cannot connect to ashesi air. My password has already been changed but i cannot connect to any wifi on campus  Get Outlook for Android ", "Class": "0"}, {"From": "Robert Boateng - Duah <robert.duah@ashesi.edu.gh>", "Subject": "Computers Not Working", "Message": "Hello Support,  Some computers in Lab 222 are not working. We hope they can be fixed as soon as possible to enable us run The Tech Era Tech Module Programme smoothly.   Sincerely,          Robert Boateng-DuahMechanical Engineering | Class of 2020 Chief Operating Officer - Tech EraVice President (Photography) - Ashesi Media Club Email: robert.duah@ashesi.edu.ghBlog: robertboateng.wordpress.com“You have to be odd to be number one” – Dr. Seuss", "Class": "0"}, {"From": "YINBIL FRANCIS <yinbilfrancis@gmail.com>", "Subject": "Reset Password", "Message": "Dear Support Centre, Trust this email finds you well. This is Francis Yinbil, class of 2017.I recently changed my password and I have forgotten it.  Could you kindly help reset it for me because I have an application to submit today. Alumni email address: francis.yinbil@alumni.ashesi.edu.gh  Thank you. Best regards,Francis Yinbil", "Class": "0"}, {"From": "Nana Yaa Pokuah-Debrah <nanayaa.debrah@ashesi.edu.gh>", "Subject": "Problem Transcipt on Camu", "Message": "Warm greetings,My cumulative gpa should be 2.99(check the records on sis) instead of 2.94 as shown on CAMU. I went through the transcipt and discovered wrong entry in the grades for the fall semester in my sophomore year. My gpa for that semester should be 2.44 and the cumulative gpa should be 2.78 instead of the displayed results. Please crosscheck, verify and make the necessary changes to my transcript. ThanksNana Yaa Pokuah-DebrahBsc Electrical/Electronic EngineeringC2020 ", "Class": "0"}, {"From": "Kofi Obeng <kobeng@ashesi.edu.gh>", "Subject": "Wifi Problems", "Message": "Dear Support centre, We currently have WiFi problems at GCIC. WiFi doesn’t recognize the username and passwords, created. Please URGENTLY look into this and assist. Thanks, Kofi   ", "Class": "0"}, {"From": "Sula Mabuza <Sula.Mabuza@aucampus.onmicrosoft.com>", "Subject": "Transcripts error", "Message": "Hello, I am having an issue with my transcripts on Camu, they are being repeated, like I have two calculus 1 and two written and oral, therefore it is affecting the GPA that I have currently on Camu. Can you please look at that. My full name is Sula Thembumenzi Mabuza, and my student id is 93002021.  SincerelySula Mabuza", "Class": "0"}, {"From": "Joshua Atsu Aherdemla <joshua.aherdemla@ashesi.edu.gh>", "Subject": "Print Credit", "Message": "Hello,   I hope this mail reaches you well. Please I would like to request for print credit in order to print documents for my classes. Also, because of the nature of my work (I print large quantities of worksheets daily), I would like to request for a large amount of credit.   Regards,  Joshua Atsu Aherdemla.   Sent from my iPhone  ", "Class": "0"}, {"From": "Brian Antonio <brianelormantonio@gmail.com>", "Subject": "Alumni Password Reset", "Message": "Hello Ashesi Support Team,   I have forgotten my alumni account password and when I tried to reset it I was informed my account is not configured to reset a password.   Can you please assist me with what to do next?   Best Regards,  Brian Elorm Antonio.  ", "Class": "0"}, {"From": "Suzanne Buchele <sbuchele@ashesi.edu.gh>", "Subject": "Wired connection not working", "Message": "Hello, The wired internet connection in my office is not working. I am in from 8:15am to 9:30am only today. Thank you,Suzanne Suzanne F. Buchele, Ph.D.Provost and Associate ProfessorAshesi University College, GhanaTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Cell: +233-501-331-618Email: sbuchele@ashesi.edu.gh ", "Class": "0"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "faculty down printer", "Message": "Hi – I have not been able to use the Faculty Down printer today. It does not appear to be working. Thanks,Lenny", "Class": "0"}, {"From": "Charity Ampomah <charity.ampomah@ashesi.edu.gh>", "Subject": "Inaccessible camu account", "Message": "Dear Support Centre,                                     Please I would require a little assistance setting up my account. Upon registering for camu for the first time, I mistakenly omitted my middle name from the username given to us for registeration . When I tried  registering again with the username and PIN number given  to us individually, it says account already exist. Also I cannot access that account which already is in existence. My guess is that the system does not recognise the username and the pin.Thank you Regards,Charity Ampomah   Get Outlook for iOS", "Class": "0"}, {"From": "Georgette Bosompemaa Bempong <georgette.bempong@ashesi.edu.gh>", "Subject": "Alumni Email Not Working", "Message": "Hello, how do you do? I have been unable to access my Ashesi Alumni email for a couple of months now. Whenever I try to sign in, the feedback I get is Unable to verify account name or password. Can you please help me out? Sincerely,Georgette(c2017).", "Class": "0"}, {"From": "Harriet Naa-dedo Mate-kole <naa.mate-kole@ashesi.edu.gh>", "Subject": "Webprint Printers Offline", "Message": "Hello,  Trust your week is going well.  I would like to kindly report that I am unable to print using webprint because I receive a pop-up saying that there are no printers online. I would appreciate your assistance to enable me to print directly from my laptop.  Thank you.  Kind regards, Harriet Faculty Intern: Marketing & Competitive strategy ", "Class": "0"}, {"From": "Edrine Ssemwanga <edrine.ssemwanga@aucampus.onmicrosoft.com>", "Subject": "Print Account", "Message": "Hello ASC,I trust this email finds you well.I am writing to you seeking to raise a complaint, today I went to the library to print, I used the Third printer, hardly did I know it wasn't working and my print account was deducted. I went on to use the Fourth printer and so I was wondering whether my print account of 6.50 cedis that was taken from my account will be refunded. Thank you. Best regards,Edrine", "Class": "0"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "WiFi in the Research Building", "Message": "Good morning   Please note that the WiFi & internet connection in RB is offline.   William   Sent from my iPhone. Please excuse brevity & errors.   ", "Class": "0"}, {"From": "Sandra Osei Mintah <sandra.mintah@aucampus.onmicrosoft.com>", "Subject": "Issues with my Meal Plan Card", "Message": "Good evening,I am Sandra Osei Mintah, a student of the Class of 2019 and a MasterCard Scholar. I kindly want to inform you that I have had a number of issues with my  Meal Plan Card of late, such that most times I have made no transactions with my card yet I am not able to buy food with my card when I go to the Cafeteria for the fact that it has exceeded.  Please, I kindly plead that something be done about this for me.  Thank you,Sandra Osei Mintah.", "Class": "0"}, {"From": "Kwabena Bamfo <kwabena.bamfo@ashesi.edu.gh>", "Subject": "Directory Access", "Message": "Hi Team, I'm currently unable to access this directory: C:/Users/kwabena.bamfo/AppData/Local/Programs/Python/Python36-32 on the school computers in the Engineering FI office. I however need to get in there to paste some third party module we are currently using in class. Could I get some help? Thanks!  Respectfully,Kwabena BamfoFaculty Intern, Computer Programming For CS ", "Class": "0"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "ACCESS TO WEB CASHIER (PAPERCUT) DENIED!!!!!", "Message": "", "Class": "0"}, {"From": "Amonebaafe zelia Abdul-mumin <zelia.abdul-", "Subject": "Problem setting grammarly", "Message": "Hi Support Centre,             Please I have not been able to set my grammarly. I did not get an email for it.   Zelia Abdul Mumin Amonebaafe   Get Outlook for Android ", "Class": "0"}, {"From": "Enoch Agonyo <eagonyo@ashesi.edu.gh>", "Subject": "Laptop Request", "Message": "Dear Support,   Kindly I would like to request l be given a laptop to use for my work. The desktop I was using has failed to power on since Thursday. I will need a replacement immediately.   Kind regards  Enoch     ", "Class": "0"}, {"From": "Wendy Amarteifio <wendy.amarteifio@ashesi.edu.gh>", "Subject": "Problem opening Courseware", "Message": "Hello,  I can't access courseware. I login with my outlook because the password never worked for me and at the moment none of them is working    Name: Wendy Amarteley Amarteifio  ID: 97582020  Thanks  Wendy            Get Outlook for Android ", "Class": "0"}, {"From": "Godwin Jnr Adordie <godwin.adordie@ashesi.edu.gh>", "Subject": "Meal Plan Topup", "Message": "Hello Sir/Madam, Please find attached the payment slip for the top up of my meal plan account.  Kind regards, Godwin Jr. Adordie  Get Outlook for Android ", "Class": "0"}, {"From": "Angella Nantambi <angella.nantambi@aucampus.onmicrosoft.com>", "Subject": "Courseware probelm", "Message": "Hello support centre, I hope this email finds you well. I have encountered a problem with logging into my course ware. Each time  i try, i get the message above in the attached image. I do not know what the problem is and I badly want to go to courseware. Thank you for your usual cooperation. Kind Regards, Angella NantambiMajor: Business AdministrationResident AssistantPublic Relations manager, International Students AssociationAshesi University College | PMB CT 3, Cantonments, Accra, Ghana | Office 204  | Phone: +233.302.610.330, ext. 1058  Fax: +233.302.610.340  | Mobile: +233.249.187.210 ", "Class": "0"}, {"From": "Nadine Tim <Nadine.Tim@aucampus.onmicrosoft.com>", "Subject": "Error with grade", "Message": "Hello,   please, I realized there was a problem with my grade for Introduction to Engineering. For Assignment one, instead of 18.5/28, my mark is 15/28 on CAMU and instead of 23/28 for Task  180703, my mark on CAMU is 16/28. This has greatly affected my overall grade. So I plead that you kindly check and verify this. Find attached proof of my results.Name: Nadine Afkwah Timclass: 2021major: Mechanical engineering Kind Regards,Nadine Tim. ", "Class": "0"}, {"From": "Michael Akpawu <michael.akpawu@aucampus.onmicrosoft.com>", "Subject": "Poor Internet Connectivity", "Message": "Dear IT Team, On behalf of Residents of Hall C. I trust this email finds you well.Internet connectivity is very bad in Hall C at the new hostel.We would be extremely grateful if this is rectified at your earliest convenience. Thank you very much for your time. Best regards,Michael Akpawu.Finance Chairperson-Ashesi Students Council Career Peer Advisor |Resident Assistant-Hall CAshesi University College 1 University Avenue, Berekuso E/R  .  PMB CT 3 Cantonments,  Accra, GhanaCell:+233572214306|+233205386369 Email: michael.akpawu@ashesi.edu.gh  www.ashesi.edu.gh  From: Ashesi Support Centre Sent: 25 September 2017 17:06 To: Michael Akpawu Cc: TK Mawuli Azaglo; Antoinette Doku; Anna Serwa Addei Subject: Re: Internet Connectivity Hello Michael,  Thank you for contacting the Support Centre. Kindly note that we have forwarded your report to the IT support team and we will have someone look at the situation soon.  Regards, ", "Class": "0"}, {"From": "Ashesi Support Centre <supportcentre@ashesi.edu.gh>", "Subject": "ATM Machine Is Working", "Message": "Dear All, Kindly note that the ATM machine issue has been resolved and is working now. We apologize for the inconveniences. Thank you. Regards,Ashesi Support CentreAshesi University CollegeBerekuso, Ghana Email           - supportcentre@ashesi.edu.ghWebsite     - www.ashesi.edu.ghPhone         - 0302610330Extension  - 1111Office         - Engineering Room 105 ", "Class": "0"}, {"From": "Hellen Kagunyi <hellen.kagunyi@ashesi.edu.gh>", "Subject": "Password CAMU", "Message": "Dear Sir/Madam,I trust that this finds you well. I write to seek help with resetting my camu password. After sign up, I clicked forgot password, but when I put in my email, I get the below feedback.  My username is : hellen.kagunyiThank you. With Regards,Kagunyi Hellen WairimuAshesi University ", "Class": "0"}, {"From": "Malihatu Abdulai <malihatu.abdulai@aucampus.onmicrosoft.com>", "Subject": "Issues with my transcript", "Message": "Hello,           I hope this finds you in good health. I noticed some issues with my transcript. The course 'Applied Calculus' and my grade appeared twice in the same period. 'Financial Accounting' and my grade also appeared twice in the period I took the course. My Leadership 4 grade is not on my transcript and my grade for the course 'Strategic Brand Management' is showing as C, whereas I had a B. Kindly look through. Thank you.Best Regards, Malihatu Abdulai,Class of 2019. ", "Class": "0"}, {"From": "Yasmin Bucknor <ybucknor@aucampus.onmicrosoft.com>", "Subject": "Internet access", "Message": "Hi Bryan, Unfortunately no luck with the ethernet cable either (says it doesn’t have a valid IP config). Please let me know whenever you’re free to take another look (I’m grabbing lunch but should be back by 1:30pm). Thanks so much,Yas Get Outlook for iOS", "Class": "0"}, {"From": "Kevin Blankson <kevin.blankson@aucampus.onmicrosoft.com>", "Subject": "Issue with transcripts", "Message": "Hello,Hope all is well. I recently checked my transcripts on camu and there seems to be an error on it.it shows that I spent the summer of 2016 doing pre-calculus 2(twice) and again in the spring of 2017.I however wasn't able to do the course during the 2016 summer and so it is wrongly affecting my overall GPA.I do hope that you would be able to have a look and resolve this issue.Regards,Kevin ", "Class": "0"}, {"From": "Help Scout <help@helpscout.com>", "Subject": "Unable to process your update", "Message": "Your email update couldn't be processed  Your email update couldn't be processedIf you are trying to update a conversation, remember you must respond from the same email address that's on your account. To send your update, please try again and send from your account email address (the email you login with).As always, don’t hesitate to reply to this email if you have any questions.Cheers, Made by Help Scout 131 Tremont Street, 3rd Floor • Boston, MA • 02111          ", "Class": "0"}, {"From": "Ashesi IRB <irb@ashesi.edu.gh>", "Subject": "Buss Plan Overcharge", "Message": "Hello Support Centre,Find below the discrepancies of my buss plan account. 15th August - picked once, charged 3 times13th August - picked twice, charged 6 times7th August - picked twice, charged 3 times RegardsDavid", "Class": "0"}, {"From": "Derrick Osae <derrick.osae@ashesi.edu.gh>", "Subject": "Wrong Major", "Message": "Hello,Please my major in Camu is MIS instead of CS, due to this I cannot register for COA. I hope this can be resolved.  Regards,Osae Derrick Get Outlook for iOS", "Class": "0"}, {"From": "Cecil Hudson <cecil.hudson@ashesi.edu.gh>", "Subject": "Courseware Inaccessible", "Message": "Cecil Kwadwo Bassaw Hudson46012020cecil.hudson@ashesi.edu.gh ", "Class": "0"}, {"From": "Francis Aweenagua <Francis.Aweenagua@aucampus.onmicrosoft.com>", "Subject": "Mealplan fund exceeded", "Message": "Hello ASC,I will like to kindly inform you that I do not have any funds available on my meal plan card. The allocated funds I was given has finished. I am an MCF scholar and  16502021 is my student ID. My full name is Francis Aweenagua. Thank You. Regards  Francis Aweenagua ", "Class": "0"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "grammarly", "Message": "Hi – I tried to sign up for Grammarly but it didn’t work. Can you please help me sign up for Grammarly when you have a chance? Thanks,Lenny", "Class": "0"}, {"From": "Mark Zoiku <mark.zoiku@aucampus.onmicrosoft.com>", "Subject": "Microsoft Office Activation", "Message": "Hello,I’m Mark Zoiku, a 2022 computer science student. My Microsoft Word stopped working recently because it was not activated. I reinstalled a new office product from my office 365 but the applications are still inactive. Kindly advise. Thank you.Regards. Sent from Mail for Windows 10 ", "Class": "0"}, {"From": "Dinah Kotey Baidoo <dbaidoo@ashesi.edu.gh>", "Subject": "Access to paper cut denied", "Message": "Dear Support service, I am denied access to paper cut.Could this be checked?  Best regardsDinah Koteikor Baidoo Assistant LibrarianAshesi University College 1 University Avenue, Berekuso -E/RPMB CT3 CantonmentsAccra, Ghana.Tel: +233 302 610 330Cel: +233 208 197 049 / 246 808 671Email: dbaidoo@ashesi .edu.gh / kutbelle@gmail.comWebsite: www.ashesi.edu.gh   ", "Class": "0"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "printing", "Message": "Hi – can you please help set up my connection to a computer for printing? I see that there is now a printer at Faculty Down but when I print, I don’t know where it goes. Thanks,Lenny", "Class": "0"}, {"From": "Kofi Adu-Labi <klabi@aucampus.onmicrosoft.com>", "Subject": "Unable to log in to Courseware", "Message": "Hello, I am unable to log in to Courseware. The Office 365 route is what works for me. Today I get an error.My username is klabi. Thanks,Kofi.", "Class": "0"}, {"From": "Betty Blankson <Betty.Blankson@aucampus.onmicrosoft.com>", "Subject": "My Courseware Issue", "Message": "Good morning,Please find an attachment of a screen shot of my courseware page. I have been trying to login since yesterday but am told my password or Username is wrong. However, that is the password I have been using from the beginning of the semester.", "Class": "0"}, {"From": "Florence Ofori <Florence.Ofori@aucampus.onmicrosoft.com>", "Subject": "Transcript problem", "Message": "Dear Support Center,   I would like to make a complaint concerning my transcript. It seems my Leadership Seminar One grade on Focus and my Transcript do not tally, meanwhile all the other grades do tally, apart from Ashesi Success which does not show( I would like for it to show too).  Thank you.   Get Outlook for Android ", "Class": "0"}, {"From": "Yaa Sarkodie <Yaa.Sarkodie@aucampus.onmicrosoft.com>", "Subject": "Site blocked", "Message": "Dear Support Center, Kindly unblock the following site for me to this enable me complete my applications. Thank you.  http://www.buimun.org.ng https://events.withgoogle.com/inside-look-2018/ Best Regards Yaa Fremah Sarkodie  Get Outlook for Android ", "Class": "0"}, {"From": "Dennis A. Owusu <dowusu@aucampus.onmicrosoft.com>", "Subject": "Website Blocked", "Message": "Hi Support, I am unable to open this website: https://aidennis.com/. I am told it is blocked; I am not sure why. Can it be unblocked? It is my blog. Regards, Dennis Asamoah OwusuFaculty, Computer ScienceAshesi Universitywww.ashesi.edu.gh ", "Class": "0"}, {"From": "Ewurakua Owusu Atakora <ewurakua.owusu@aucampus.onmicrosoft.com>", "Subject": "Problems with My Camu", "Message": "Hello ,                 I am unable to login after signing up for my camu account. It keeps saying invalid password. I  reset it and when I type the new one one I received it still says invalid password.  Due to this I have not been able to register for my summer course. Kindly help me with this issue. Thank you.  Best Regards,Ewurakua Owusu Atakora.", "Class": "0"}, {"From": "Angela Owusu Ansah <aansah@aucampus.onmicrosoft.com>", "Subject": "WiFi Power outage", "Message": "Thank you so much Theophilus for coming to correct the internal issue with the DSTV. Yesterday the power went out for about 5 seconds and the WiFi has been emitting a high pitched sustained sound ever since.So I kindly ask for:Resetting of the WiFi1. A cord I can use at home, for the times when the WiFi goes off2. Thank you.Kind regards,Angela Angela Owusu-Ansah, Ph.D.Provost and ProfessorAshesi University, GhanaTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Cell: +233-541-880-000Email: aansah@ashesi.edu.gh Ashesi: Website | Twitter | Facebook   ", "Class": "0"}, {"From": "Warihana Gumah <warihana.gumah@ashesi.edu.gh>", "Subject": "Courseware Login", "Message": "Dear Suport Centre,Good evening and I hope this e-mail find you well.I can not login to courseware. I have attached the error I get when I try to login.These are my credentials: Full name: Warihana Gumah Username: warihana.gumah Email: warihana.gumah@a shesi.edu.ghThank you.Regards Warihana GumahGet Outlook for Android .", "Class": "0"}, {"From": "Francis Aweenagua <Francis.Aweenagua@aucampus.onmicrosoft.com>", "Subject": "Wifi Issue new hostel B", "Message": "Hello Support Centre,We passed by your office earlier today to inform you about our Wifi and electricity issue in the new hostel(B). The power issue has been fixed but we do not still have our Wifi working. Also, the electric sockets in the rooms are not working. We hope you could kindly fix these for us before the weekend. Thank you. Regards,Francis Aweenagua ", "Class": "0"}, {"From": "Karen Nelson <Karen.Nelson@aucampus.onmicrosoft.com>", "Subject": "Login Failure", "Message": "Dear Sir,I have trouble logging into my Ashesi account on any of the school's computers. It does not register my password. Please help me reset my password and resolve this issue.Thank you.", "Class": "0"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Problem with Desk Phone", "Message": "Hello Ashesi Support Centre, I hope this email finds you well. My Desk phone has not been working properly. Whoever I call does not hear me when I speak. Can this be checked for me? Enjoy the rest of the day. Sincerely, Benardine Holdbrook GhansonDiversity and Inclusion OfficerOffice of Diversity and International ProgramsAshesi University College 1 University Avenue Berekuso E/R Tel: +233 (0)302610330  Ext: 1056Phone: +233 (0)262 782 680 /  +233 (0) 203884170Email:bghanson@ashesi.edu.gh  ", "Class": "0"}, {"From": "Kadmiel Martin-Odoom <Kadmiel.Martin-", "Subject": "Transcript Problems", "Message": "Good afternoon,My grades for calculus 1 for the first semester of my first year in  school has been repeated and factored into my GPA twice. Thank youYours sincerely,Kadmiel Martin-OdoomBusiness Administration ‘21", "Class": "0"}, {"From": "Kwabena Buamono Abogye-Otchere ", "Subject": "ATM issues", "Message": "I hope this email finds you well. Unfortunately, the ATM at the akonor eatery is unable to dispense cash.  Get Outlook for iOS", "Class": "0"}, {"From": "Ayebilla Avoka <ayebilla.avoka@ashesi.edu.gh>", "Subject": "Wi-Fi not working at Wangari Mathai hostel", "Message": "Dear Support Centre,The WIFI has been down in the Wangari Mathai hostel since yesterday and residents have complained.I hope this will be resolved as soon as possible to make residents happy.Regards,Ayebilla AvokaRA, Hall B  ", "Class": "0"}, {"From": "Akosua Kissiedu <akosua.kissiedu@ashesi.edu.gh>", "Subject": "Unable to upload assignments on camu", "Message": "Hello good afternoon,I have been trying to upload my assignment on camu but the upload button is unresponsive. Thank you Regards  Akosua Afaribea Kissiedu  ", "Class": "0"}, {"From": "Ashesi Support Centre <supportcentre@ashesi.edu.gh>", "Subject": "Ashesi WIFI Changes", "Message": "Dear All, Please note that the IT team will be changing the authentication methods for our WIFI set up. AshesiAir will be available for members of the community and this will require members to login with their Ashesi credentials. AshesiGuest will be available for guests only and the new guest password will be on a need to know bases. Please note that this change will take effect on Friday (February 2, 2018). We will be monitoring the situation and will communicate to you any developments. We apologies for any inconvenience and please let us know if you need any assistance. Thank you. Regards,Ashesi Support CentreAshesi University CollegeBerekuso, Ghana Email           - supportcentre@ashesi.edu.ghWebsite     - www.ashesi.edu.ghPhone         - +233 302 610 330 or +233 302 974 980Mobile        - +233 501 673 669Extension  - 1111Office         - Engineering Room 105 ", "Class": "0"}, {"From": "Petra Abosi <petra.abosi@aucampus.onmicrosoft.com>", "Subject": "Problem Booting", "Message": "Hello, Please I have a problem booting my laptop. Thank you. Get Outlook for iOS", "Class": "0"}, {"From": "Najahat Antiku <Najahat.Antiku@aucampus.onmicrosoft.com>", "Subject": "DIFFICULTY TO ENROLL FOR DISCRETE STRUCTURES AND THEORY", "Message": "Hello,Please, I enrolled in the Section B class for discrete structures and theory (which is the only class I can be in per my timetable). However, I checked on CAMU today and I have not been enrolled. I have tried to re-enrol but it is giving me problems. I hope to hear from you. Najahat AntikuSophomore", "Class": "0"}, {"From": "Eugenia Akpo <Eugenia.Akpo@aucampus.onmicrosoft.com>", "Subject": "MyCamu Problems", "Message": "Hello, I have tried registering for courses but there is no pop-up  for the selected course. I have opened the account but the enrolment section has failed to show. I kindly request for your help. Counting on your help. Best, Eugenia Mawuenya Akpo.  Get Outlook for Android ", "Class": "0"}, {"From": "Philip Boye-Doku <philip.boye-doku@aucampus.onmicrosoft.com>", "Subject": "Meal Plan", "Message": "Hello Naa, I have attached your expenses for the year.  From our system is shows you topped  up  GHS 1500 since January. Kindly pass by the IT office for any further enquiries. Thanks. Philip Boye-Doku Applications Developer/MIS Support Officer Ashesi University CollegeExt:1078PageMe:boyedokupwww.ashesi.edu.gh ", "Class": "0"}, {"From": "Jude Samuel Acquaah <jacquaah@ashesi.edu.gh>", "Subject": "Printers offline", "Message": "Dear Support Centre, Please the shared printers in Radichel Hall are offline. Kindly help us quickly. Jude  Samuel Jude AcquaahManager, Outreach and Experiential ProgrammesAshesi University College  Office: +233 (0) 302610330 Cell:      +233 (0) 24 4448607 Web:     http://ashesi.edu.gh/Email:  jacquaah@ashesi.edu.gh   ", "Class": "0"}, {"From": "Samuel Abbey <Samuel.Abbey@aucampus.onmicrosoft.com>", "Subject": "Blocked Website", "Message": "Hello, Please this link  https://www.globalyouthsummit.net sent together mail was blocked when I tried to access it. Would it possible to access the link.Here is a copy of the portion of the mail being discussed. 1.   Global Youth Summit – 12th – 18 August, SwitzerlandThe summit will be bringing 60 Change Makers together for a fully funded, life-changing youth opportunity – a week of training sessions, networking and workshops. Participants will learn skills such as campaigning, fundraising, project management, leadership, public relations, pitching and more! Participants should be between 18 and 23 years old at the time of the summit. Application deadline is Sunday 4th March 2018, 6pm CET.            https://www.globalyouthsummit.net Thanks in advance. ", "Class": "0"}, {"From": "Jones Dari <Jones.Dari@aucampus.onmicrosoft.com>", "Subject": "course enrollment issue", "Message": "I have been able to login to CAMU due to your help. However, I have a problem enrolling into the course that I have to take for this summer.After selecting semester 3 on CAMU, the enroll button does not response after clicking on it to get be registered for the course.Is there something I need to do before clicking the enroll button so that I can register before Friday. Thanks a lot and counting on your response.Jones Dari Sent from Mail for Windows 10 ", "Class": "0"}, {"From": "Priscilla Vera Okpoti-Paulo <priscillavera.paulo@ashesi.edu.gh>", "Subject": "Password issue", "Message": "Hello, Please i have a problem with my password. I cant remember the old one and cannot log into any of my accounts.  Thank you  Télécharger Outlook pour Android ", "Class": "0"}, {"From": "Sally Dibba <sally.dibba@aucampus.onmicrosoft.com>", "Subject": "Transcript issue", "Message": "Dear All,  I have noticed that on CAMU, on my transcript platform leadership 4 grade is not reflecting. Also,  about Strategic Brand Management my true grade that on records is not reflected; it been changed to C+ instead of B. I hope you can kindly help and look into the issue. thank you.Sally Dibba", "Class": "0"}, {"From": "Maureen Basemera <maureen.basemera@aucampus.onmicrosoft.com>", "Subject": "Wangari Mathai wifi", "Message": "Good day, Wangari Mathai hostel has not had wifi since 1pm. I have contacted some IT personnels to check in the problem but it is still not clear. Can we have something done about it.   Regards,Maureen Molly Get Outlook for iOS", "Class": "0"}, {"From": "Florence Ofori <Florence.Ofori@aucampus.onmicrosoft.com>", "Subject": "Transcript Problem", "Message": "Dear Support Center,  I would like to make a complaint about my leadership and Ashesi Success grades on my Transcript. They are the only courses that do not tally with my grades on Focus.  Thank you  Florence Mawusi Ofori  Get Outlook for Android ", "Class": "0"}, {"From": "Araba Botchway <abotchway@ashesi.edu.gh>", "Subject": "URGENT - TONER", "Message": "Dear Anna and Support Centre, I would be grateful if you could urgently replace the toners for my printer.  Joanna from the Ashesi Foundation will be here this morning for us to print documents towards the board meeting. Sincerely, Araba  Araba Botchway (Ms.) | Director, Admissions and Financial AidAshesi University1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Tel: +233-302-610-330 ext 1043| Cell: +233-501-299-988Email: abotchway@ashesi.edu.gh | www.ashesi.edu.gh  Visit us on Facebook – Twitter – You TubeEthical Leadership | Innovative Thinking |A New Africa ", "Class": "0"}, {"From": "David Opare <david.opare@aucampus.onmicrosoft.com>", "Subject": "Printing Credit", "Message": "Hello, Please my printing credit is in the negatives and initially it was zero. I would be grateful if it could be resolved. Thank you.  David Opare  Get Outlook for iOS", "Class": "0"}, {"From": "Antoinette Emefa Quintin - Cofie <aattah@aucampus.onmicrosoft.com>", "Subject": "Toner cartridge for the health centre", "Message": "Dear Support Centre,We would want to request for a toner cartridge for the health centre. Thank You,  Antoinette E. Attah Nursing Officer |Ashesi Health Services1 University AvenueBerekuso ,Eastern Region, Ghana.Mobile no. 0242738253/ 0571404215 Email: aattah@ashesi.edu.ghHealth line: 0501331668  ", "Class": "0"}, {"From": "Winston Chimbueze Best-Ezeani <winston.best-", "Subject": "WiFi Connection Issues", "Message": "Dear Support,  I was away from campus for a semester and I noticed the changes in how we access the WiFi networks.  I will be grateful if you helped me regain connectivity on my devices.  Regards, Winston  ", "Class": "0"}, {"From": "Felix Oyoo <felix.oyoo@aucampus.onmicrosoft.com>", "Subject": "Courseware Access Issues", "Message": "This is to inform you that I am unable to access course.Below are the my details;    Username: Felix.Oyoo   Email Address: felix.oyoo@ashesi.edu.gh   ID. : 40832019  Error message        Regards,Felix Oyoo  ", "Class": "0"}, {"From": "Enoch Agonyo <eagonyo@ashesi.edu.gh>", "Subject": "Ashesi Xerox Copier", "Message": "Hello Abigail, As I mentioned to you this morning; The Xerox printer in the library only picks paper from TRAY 2 and does not pick from the others, though they have all been filled with paper. 1. The Xerox printer at the engineering department only picks paper from TRAY 2 when Printing. 2.  Kindly send one of your technicians ASAP (First thing tomorrow morning) to come and fix this problem since we are in the examination week and we will be doing a lot of printing and photocopying during this period. I am counting on your usual cooperation and the swift pace with which you address customer complaints. Kind regardsEnoch Kofi AgonyoLibrary Assistant|Ashesi University CollegePMB CT 3, Cantonments, Accra-Ghanahttp://www.ashesi.edu.ghhttp://www.ashesi.edu.gh/academics/library.html Tel:+233(302) 610 330 Ext: 1085 Mob: 024 2516353  eagonyo@ashesi.edu.gh    ", "Class": "0"}, {"From": "Efua Bentil <Efua.Bentil@aucampus.onmicrosoft.com>", "Subject": "Difficulty In Registering", "Message": "Hello, Good morning. I hope you are well. I am a business Administration student of 2021. I am having a little trouble registering for Statistics because the CAMU system says that the maximum credit enrolment is 2 instead of 4/4.5. Also, African Studies Electives is not available for enrolment as well as all the courses for the second semester of second year. I am asking of the second semester courses because I took financial Accounting in summer so I would have loved to register an extra course from next semester to be done this semester. Please work on this for me so I can have a successful registration process. Thank you. Regards,Efua Bentil. ", "Class": "0"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Easter Holidays", "Message": "Dear All, Kindly note that the Easter Break begins on 30th March, 2018 to 2nd April, 2018. Do ensure all your clients and students have everything they need before close of day today. We will resume work at usual on 3rd April, 2018. Best regards, Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "0"}, {"From": "Jennifer Saarkwah <jennifer.saarkwah@ashesi.edu.gh>", "Subject": "Refund for Printing", "Message": "Hello Support center, Please, GHS180 was deducted from my print account yesternight without a refund even though the work never came out of the printer after refilling the tray with papers. I am urgently in need of this amount to print my final capstone so please help me refund for printing. Thank you. Jennifer Saarkwah Business Administration, C2018 Ashesi University College1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: jennifer.saarkwah@ashesi.edu.gh | Phone: +233 241274634 ", "Class": "0"}, {"From": "Tamisha Segbefia <Tamisha.Segbefia@aucampus.onmicrosoft.com>", "Subject": "Withdrawing and Enrolling in CAMU", "Message": "Dear Sir/Madam, I would like to make some changes to my schedule on CAMU. In order to do so, I’ve withdrawn from three of my courses in order to enroll again. However, the withdrawal does not seem to be working. All it says is ‘Pending’, even after several refreshes. I would like to know the way forward. Thank you. Best regards,Tamisha Dzifa SegbefiaComputer Engineering ’21 | Ashesi UniversityFinance Committee Member | Ashesi Student CouncilE: tdsegbefia@outlook.com", "Class": "0"}, {"From": "David Amatey Sampah <dsampah@aucampus.onmicrosoft.com>", "Subject": "Turnitin Issue", "Message": "Hello,I am the administrator of Turnitin, but I have noticed an addition of new accounts which I didn’t create. This email is to find out, if the system is linked to our Active Directory to automatically add new faculty. If this is not the case, then another Turnitin administrator is manipulating the system. Kindy investigate. RegardsDavid", "Class": "0"}, {"From": "Foster Akpakli <Foster.Akpakli@aucampus.onmicrosoft.com>", "Subject": "TRANSCRIPT", "Message": " Hello Support center, My transcript is showing two Calculus 1 and therefore has affected the CGPA Thanks,Foster.  Foster Akpakli Bsc. Business Administration, '21Ashesi University, Ghanafoster.akpakli@ashesi.edu.gh+233 273 317 205| +233 555 696 800  ", "Class": "0"}, {"From": "Eunice Adjei <egadjei@gmail.com>", "Subject": "PROBLEM LOGGING IN", "Message": "Dear all, please i have problems logging in to focus and course.kindly rectify for me in a jeffy. thank you. eunice", "Class": "0"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "unable to print", "Message": "Hi – when I try to print, I get a message that the laptop is offline. Thanks,Lenny", "Class": "0"}, {"From": "Sena Agbodjah Agyepong <sagyepong@ashesi.edu.gh>", "Subject": "Bad Wi-Fi at GCIC", "Message": "Good afternoon. We are having challenging internet connectivity at the GCIC building. Hope this can be resolved ASAP. Thanks Sena  Get Outlook for Android ", "Class": "0"}, {"From": "Michael Adu <michael.adu@aucampus.onmicrosoft.com>", "Subject": "Meal Plan Registration", "Message": "Good Evening,  I am writing to you to ask for help about registering for the meal plan.  Thank you  Get Outlook for Android ", "Class": "0"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "No Printers Installed", "Message": "Hello Ashesi Support Centre, I hope this email finds you well. I am having issues printing as when I try to print the message that comes up is “No Printers Installed”. Thank you and I hope to get assistance soon. Sincerely, Benardine Holdbrook GhansonDiversity and Inclusion OfficerOffice of Diversity and International ProgramsAshesi University College 1 University Avenue Berekuso E/R Tel: +233 (0)302610330  Ext: 1056Phone: +233 (0)262 782 680 /  +233 (0) 203884170Email:bghanson@ashesi.edu.gh  ", "Class": "0"}, {"From": "Mohamed Hijazi <mohamed.hijazi@aucampus.onmicrosoft.com>", "Subject": "Windows Updates Blocked?", "Message": "Dear Support, Hope all is well. I think I have noticed that either the firewall or the school's internet is not allowing us either install updates or allow us to download or update apps from the Windows Store. I have been able to do this on other networks which are even significantly slower than the school's internet but not on the school's network. Hoping this can be looked into. Regards,  Mohamed Hijazi  Computer Science 19' | I.T. Intern | Ashesi University 1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, Ghana mohamedhijazi.com | Phone: 026 833 0011  ", "Class": "0"}, {"From": "Patrick Awuah <pawuah@ashesi.edu.gh>", "Subject": "Unusual error messages in Chrome", "Message": "Chrome browser has been issuing unusual error messages over the past few days.  Here is the latest one:  ---Patrick G. Awuah, Jr.Founder and President, Ashesi University Tel: +233 302 610 330 OR +233 302 974 980Ashesi: Website | Twitter | Facebook  ", "Class": "0"}, {"From": "Mohamed Hijazi <mohamed.hijazi@aucampus.onmicrosoft.com>", "Subject": "Internet Issues", "Message": "", "Class": "0"}, {"From": "Libehela Kabi <Libehela.Kabi@aucampus.onmicrosoft.com>", "Subject": "Courseware issues", "Message": "Dear Sir/Madam, I am experiencing issues with my courseware and kindly request that it be fixed. Attached is the picture of what it shows when I try logging in. Name:Libehela Lydia Kabi Student ID:41032021 email: libehela.kabi@ashesi.edu.gh  Kind regards  Libehela Kabi", "Class": "0"}, {"From": "Opunabo Eli <opunabo.eli@aucampus.onmicrosoft.com>", "Subject": "Account WiFi Login Issues", "Message": " Hello,  Recently I've been unable to log-in to the Ashesi WiFi and the Ashesi Desktops. I replaced my password when it got expired but so far am unable to log-in to anything.   Here's a snapshot of the message received on attempt, attached to this email.    Thanks.        Get Outlook for Android From: Ashesi Support Centre Sent: Monday, January 15, 2018 11:30:15 AM To: Ashesi Community Cc: David Asumadu-Boateng; Casper Annie Subject: FW: Please Do Not Personalize HDMI, VGA and Projector Remotes #reminder Hello everyone,Please be reminded of the information below.We have noticed that the HDMI and VGA cables, as well as the projector remote controls, keep getting taken away from the lecture halls.Kindly note that the cables and controls are supposed to be kept in the lecture halls or labs that they are assigned to. These shared resources are not meant to be personalized as their unavailability directly disrupts teaching and learning.Please return any cable or control that might be in your possession to the Support Centre.Thank you and counting on your cooperation.Regards,", "Class": "0"}, {"From": "Michael Adu <michael.adu@aucampus.onmicrosoft.com>", "Subject": "Wrong Class Placement", "Message": "Good evening It seems that I was put in the wrong leadership class on CAMU, as I am rather supposed to be in the 1:15 pm class. Can you kindly resolve this for me?Thank you", "Class": "0"}, {"From": "Mercy Weguri Guriyire <mercy.guriyire@ashesi.edu.gh>", "Subject": "Administrator Privileges", "Message": "Dear Support Centre, The computer I use at the FI office does not allow me to have administrator privileges. This seriously inhibits my ability to use the computer as i cannot download useful software for academic purposes as well as retrieve certain documents on Microsoft office.I would be very glad if this is rectified as soon as possible before the semester runs in full. Regards,Mercy Guriyire ", "Class": "0"}, {"From": "Afua Addo <Afua.Addo@aucampus.onmicrosoft.com>", "Subject": "Microsoft Office Account", "Message": "Good day, Please I am struggling to work on any of my Microsoft Office accounts. When I open the software it says my subscription has expired. I would like some assistance with this because it has become very slow in loading a page and trying to type.Thank you, Afua Addo.", "Class": "0"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "A4 PAPER NEEDED DURING WEEK OF 2 JANUARY 2018", "Message": "Dear colleagues Please ask Logistics to buy A4 paper during the week of 2 January 2018. We will have less than 10 reams in stock thanks  Please note that Ashesi will be fully closed for the Christmas/New Year holidays from Monday 18 December 2017 to Monday 1 January 2018 inclusive.  We will reopen on Tuesday 2 January 2018.  Regards  Nina Nina ChachuHead Librarian, Ashesi University CollegeLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh ", "Class": "0"}, {"From": "Elvis Okoh-Asirifi <elvisokohasirifi@gmail.com>", "Subject": "Wrong Password", "Message": "Hello, When i tried to sign in with the password you gave me, it did not work out. Could you please show me the next steps? Regards,Elvis Okoh-Asirifi.", "Class": "0"}, {"From": "Angella Nantambi <angella.nantambi@aucampus.onmicrosoft.com>", "Subject": "Wifi issues hall A", "Message": "Hello Support Centre, I would like to report that we have an issue with the wifi in hostel A, Wangaari Maathai hostel. The wifi routers are on but there is no connectivity. The hostel front desk people switched on the servers as you had earlier suggested but the wifi is still not working. We kindly request for your support in improving the issue because it has been happening for the pat two weeks especially during the weekend and whenever there is a power shut down. Thank you very much. Angella NantambiMajor: Business AdministrationResident AssistantPublic Relations manager, International Students Association  ", "Class": "0"}, {"From": "Eunice Adjoa Yeboah Adu <eunice.adu@aucampus.onmicrosoft.com>", "Subject": "Toner", "Message": "Good afternoon, I trust your day has been great thus far. I would kindly like to request for a toner change for our printer. I believe the toner that urgently needs to be changed is the one indicated \"Y\". Thanks for your help Best RegardsEunice AduCareer Services Administrative AssistantBusiness Administration, '18", "Class": "0"}, {"From": "Lilian Annih <lilian.annih@ashesi.edu.gh>", "Subject": "WIFI Issues", "Message": " Good morning,Please we will like to report that the routers for the new hostel ( from D to F hostels) have been turned off and so connecting to the internet is not possible. They will be needed during AIX for communication and we will be grateful if they are worked on before the participants come tomorrow. Thank you Regards,Lilian Annih.Sent from Mail for Windows 10 ", "Class": "0"}, {"From": "Emma Forson <emma.forson@aucampus.onmicrosoft.com>", "Subject": "Courseware Log In", "Message": "Good afternoon,  I cannot access courseware and below is the screenshot of the response  I got from trying to log in. Please help me out. Thank you in advance,   Emma L.N.A.K ForsonPresident|Ashesi Crewdx Dance Club Mechanical Engineering Major  Ashesi University College '20  ", "Class": "0"}, {"From": "Caroline Bempong <Caroline.Bempong@aucampus.onmicrosoft.com>", "Subject": "Transcript report", "Message": "Hello,  In my freshman first semester, my accumulative GPA on records is 3.00 but on CAMU it has been decreased or made 2.84In my freshman second semester, my accumulative GPA on records is 2.94 but on CAMU it has been made 2.89Can you please make the required changes  Thank you,Caroline Bempong", "Class": "0"}, {"From": "Odette Ofosu - Siaw <odette.siaw@ashesi.edu.gh>", "Subject": "NO ACCESS TO WIFI", "Message": " Good Afternoon, Unfortunately, there has been no access to wifi in the A quadrant of the new hostel since 10 o'clock am. Counting on your usual swift response to fixing this problem. Best regards, Odette Ofosu-SiawAshesi University College '20Entertainment Committee Chairperson || Ashesi Student Council 17/18Business Administration", "Class": "0"}, {"From": "Clara Boateng <clara.boateng@aucampus.onmicrosoft.com>", "Subject": "RESET OF PASSWORD", "Message": "Dear Support Centre, Kindly assist by resetting my password for me. I forgot my password, and as such I cannot access any of the schools portal. Hence, preventing me from registering and using CAMU to register for my courses. Thank you. Yours sincerely,Clara Boateng.Class of 2019.Business Administration. Get Outlook for iOS", "Class": "0"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "Turnitin", "Message": "Hello, can you please help my FI (Caren Akoto-Adade) get set up on Turnitin for my Leadership 2 classes?  I have listed her as the FI on Turnitin but she says that she is unable to access the Turnitin page. Thanks,Lenny", "Class": "0"}, {"From": "Jenny Ocloo <jenny.ocloo@aucampus.onmicrosoft.com>", "Subject": "Cannot access courseware", "Message": "Dear Sir/Madam,  Please I am having issues connecting to my courseware page. There is an error which occurs that I have a screenshot of. It is attached in this mail.  Thank you.  Regards, Jenny Ocloo.", "Class": "0"}, {"From": "Rose Akudugu <rakudugu@ashesi.edu.gh>", "Subject": "Double Charges", "Message": "Hi Muriel, This is to let you know about double charges on my bus plan account, please check from page 5 to page 14. Also note that any 5pm charge on my account is an error.  ThanksRose", "Class": "0"}, {"From": "Mensima Ekua Appiah-Thompson ", "Subject": "MPR audio", "Message": "Dear support Centre,We are having issues playing audio documents during class in the MPR. We don't know whether its with the built in speakers or with the chords but so far we have had a hard time getting the speakers to function. We would be very grateful if you could kindly check it out for us, as we use a lot of video and audio documents in teaching French. Thank you. Regards, Mensimah Appiah - Thompson TUTOR  | French as a Foreign Language Ashesi University College1 University Avenue - Berekuso E/REmail: mensima.thompson@ashesi.edu.gh    ", "Class": "0"}, {"From": "Elom Acolatse <elom.acolatse@aucampus.onmicrosoft.com>", "Subject": "Wrong course placement", "Message": "Hello, My camu app is showing computer science as my major which is not what I chose. I chose Business administration.   Get Outlook for iOS", "Class": "0"}, {"From": "Naa Bessah Nunoo <naabessah.nunoo@ashesi.edu.gh>", "Subject": "CAMU Registration", "Message": "Hi,Please i have not been able to register because it says my password and username is wrong even after resetting it.", "Class": "0"}, {"From": "Michael Dzine <michael.dzine@ashesi.edu.gh>", "Subject": "Transcript Error", "Message": "Dear Support Centre, I hope this email finds you well. I have noticed on my transcript, in CAMU, that Multi-variable Calculus comes twice. I am sure it is supposed to appear just once. Could you please clarify why that is happening. Regards, Michael Tafadzwa Dzine | Bsc. EEEng '20AFA Operations Manager | Calculus Tutor | Computer Programming for Engineering Tutor | mdzine@usapglobal.org | michaeldzine@gmail.com |+233 55 364 0198 | +263 771 872 147 ", "Class": "0"}, {"From": "Victor Nartey <victor.nartey@aucampus.onmicrosoft.com>", "Subject": "I can't access my Premium Grammarly account", "Message": "Hello,  I have signed up for Grammarly with my Ashesi email for the free version. I was told to activate my premium account but I'm not able to do so. I would like to ask if you could help me out with this issue.  Thank you.   Get Outlook for Android ", "Class": "0"}, {"From": "Primerose Katena <primerose.katena@aucampus.onmicrosoft.com>", "Subject": "Courseware not accessible", "Message": " Name :Primerose KatenaID: 78982019 Regards, Primerose Katena. Sent from Mail for Windows 10 ", "Class": "0"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "Issues with laptop", "Message": "Hello Support Center,  Since last week I have been getting blue screens on my laptop as seen in the picture below. I have experienced this twice already since 7:30am today.  Please advice on necessary steps. Thank you.     Regards,  Anna Aggrey.   Get Outlook for Android ", "Class": "0"}, {"From": "Kwaku Osei-Tutu <Kwaku.Osei-Tutu@aucampus.onmicrosoft.com>", "Subject": "Problem with CAMU", "Message": "Good morning,Please i am able to login to my CAMU but i have  a problem enrolling for the courses. It shows that the enrolment request has been sent but i am unable to see any timetable and later on when i login again, i find that my request has been undone. Please can you check it for me because due to this i don't know if i am in the actual class i am supposed to be. Thank you. ", "Class": "0"}, {"From": "Kwabena Adu-Darkwa <kwabena.adu-darkwa@ashesi.edu.gh>", "Subject": "Projector for Enviromental Workshop", "Message": "Hello,On behalf of the Ahote Project, I would like to request for a projector for an environmental workshop on Friday, 26th October 2018. The Ahote Project is a student-led community engagement initiative that seeks to promote proper sanitation and environmental sustainability among young leaders.  We would be glad to get the projector to facilitate our work as we live by the ethos of Ashesi.  Kind regards, Kwabena Adu-Darkwa  Faculty Intern: Entrepreneurship, Ashesi University   ", "Class": "0"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "WARREN LIBRARY PRINTERS NOT WORKING!!!! help needed ", "Message": "URGENTLYDear colleagues (please pass to IT URGENTLY) The following printers in the Warren Library are NOT working/GIVING ERROR MESSAGES: Student_Library_PRN_SECOND:  not respondingStudent_Library_PRN_THIRD:  not respondingPrinter on the counter:  says offlineColour printer:  says supplies are low Can you help???? Only Student_Library_PRN_FOURTH is working   Regards  Nina Nina ChachuHead Librarian, Ashesi University CollegeLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh/   | Repository https://air.ashesi.edu.gh/", "Class": "0"}, {"From": "lbaer@ashesi.edu.gh", "Subject": "courseware", "Message": "Hi – I am unable to access Courseware. The password/username combination doesn’t work. Can somebody please help me in setting this up? Thanks,Lenny", "Class": "0"}, {"From": "Emmanuel Mwinbong ", "Subject": "Wifi not working in Hall C", "Message": "To whom it may concern,                I would like to report that the Wi-Fi in hall C stopped working after a black out on Saturday. Students in the hostel cannot get connections in their rooms.Thank you.                               ", "Class": "0"}, {"From": "Antoinette Emefa Quintin - Cofie <aattah@aucampus.onmicrosoft.com>", "Subject": "Request for new laptop", "Message": "Dear Support,I wish to request for a new laptop since my old laptop is not in a good condition. Thank You, Antoinette E. Quintin-- Cofie Nursing Officer |Ashesi Health Services1 University AvenueBerekuso ,Eastern Region, Ghana.Mobile no. 0242738253/ 0571404215 Email: aattah@ashesi.edu.ghHealth line: 0501331668  ", "Class": "0"}, {"From": "Joshua Zormelo <joshua.zormelo@ashesi.edu.gh>", "Subject": "Unable to register through Camu", "Message": "Dear support centre After several attempts and despite other people being able to register, I have not been able to register for my summer course. I keep getting a message of no subject found        Get Outlook for Android ", "Class": "0"}, {"From": "Stephen Torku <stephen.torku@aucampus.onmicrosoft.com>", "Subject": "Grammarly Activation", "Message": "Hello, This is in relation to my activation link. I still have not received the link. I hope this email finds you well. Kind regards, Stephen Torku. Get Outlook for iOS", "Class": "0"}, {"From": "Nana Abena Osei <nanaabena.osei@aucampus.onmicrosoft.com>", "Subject": "Unenrollment from classes", "Message": "Good day, Please I noticed I have been unenrolled from two of my classes: E – Commerce and Competitive Strategy. Hope to hear from you soon regarding this. Thank you. Best Regards,Nana Abena. ", "Class": "0"}, {"From": "Mathew Ndekudugu <Mathew.Ndekudugu@aucampus.onmicrosoft.com>", "Subject": "Transcript", "Message": "Good evening,  Please, I have noticed an addition Math class recorded in my transcript for semester 1 of my freshman year which I do not understand.  Kindly rectify,   Regards,  Mathew Ndekudugu  ", "Class": "0"}, {"From": "Emmanuela Fosua Mensah <efmensah233@gmail.com>", "Subject": "Login details", "Message": "Good day,   Please I am unable to login to my Ashesi mail. Kindly help out. Thank you.   Sent from my iPhone   ", "Class": "0"}, {"From": "Sebastian Dakey <sebastian.dakey@ashesi.edu.gh>", "Subject": "WiFi in Wangari Hostel Off", "Message": "Hello, Good afternoon. The Wifi in Wangari Hostel is currently off. There are some students from Wayne State University currently residing there and about ten Ashesi students have been paired with them for their entire stay (One Month) there. We will like the Wifi to be turned on for convenience purposes. Thank you. Warm Regards,Sebastian DakeyClass of 2020 | Ashesi UniversityChoir Director | Ashesi ChoraleOperations Intern | D:LabCell: (+233) 572849365 Email: sebastian.dakey@ashesi.edu.ghAshesi: Website | Twitter | Facebook ", "Class": "0"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "E-mail Privileges", "Message": "Good afternoon, I trust this finds you well. Jennifer Saarkwah (in copy) is the Business Administration Capstone Coordinator and will be tasked to send e-mails to all Business Administration juniors and seniors as well as BA faculty at various times during the semester. In light of this, kindly grant her e-mail privileges to enable her work efficiently. Many thanks and best wishes William Ohene AnnohProgramme Coordinator | Business AdministrationAshesi University1 University Avenue Berekuso E/RTel: +233 (0) 302 610 330 Ext: 1021Phone: +233 (0) 244 567 735Email: william.annoh@ashesi.edu.gh  ", "Class": "0"}, {"From": "Oswald Gyabaah <oswald.gyabaah@ashesi.edu.gh>", "Subject": "Transcript discrepancies", "Message": "Hello support center,   There is a little issue on my transcript in CAMU. In Semester 1  2017-2018, Multivariable calculus appears twice on my transcript and one needs to be removed. Thank you.Oswald Gyabaah", "Class": "0"}, {"From": "Ann - Marie Mensah <annmarie.mensah@ashesi.edu.gh>", "Subject": "Courseware Problem", "Message": "I’m Ann-Marie Mensah.Student ID is 13712020Courseware fails to open when I input my details.Attached to this mail is a picture of the message that appears when I try logging in.    Waiting on your reply, Ann-Marie. Get Outlook for iOS", "Class": "0"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "Set up for VPN", "Message": "Hello,I would like to kindly request to be set up to use the VPN. Thank you,Ayorkor  -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science Department Ashesi University1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: akorsah@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1029 ", "Class": "0"}, {"From": "Alhassan Sullaiman <asullaiman@ashesi.edu.gh>", "Subject": "Unable to update course content on CAMU", "Message": "Dear support centre,Please I am having difficulty updating my course content on CAMU. It gives me 'unknown error, contact your administrator' anytime I try uploading documents on the course content. Thanks", "Class": "0"}, {"From": "Postmark <support@postmarkapp.com>", "Subject": "Password request", "Message": "A password reset was requested on Postmark using your email address.   To reset the password for supportcentre@ashesi.edu.gh (Ashesi Support Center),  follow the link below.   https://account.postmarkapp.com/password_resets/lLtzJ4yY3YgHQr1K3GF/edit   P.S. The password reset links are only valid for next 30 minutes.   If you think you received this message by mistake, you can ignore  it or contact support at support@postmarkapp.com.    ", "Class": "0"}, {"From": "Kwami Justina Morris <kjmorris@aucampus.onmicrosoft.com>", "Subject": "Landline not working", "Message": "Dear Support center, I would like to kindly ask for someone to check my landline. I have gotten complains that it is not reachable. After checking this morning, it appears the phone is not connected. Please kindly look into this for me. Thank you. Dr. Kwami Justina MorrisLecturer | Foundations of Design Thinking & EntrepreneurshipFaculty Lead | Applied Capstone Projects (Business Administration)Ashesi University College1 University Avenue, Berekuso E/RPMB CT 3 CantonmentsAccra, GhanaTel: +233 30 261 0330 Ext 2104Fax: +233 30 261 0340 ", "Class": "0"}, {"From": "Boriche Kuipo <boriche.kuipo@aucampus.onmicrosoft.com>", "Subject": "Problem with Transcript", "Message": "Hope this mail finds you well. One of my courses (Leadership 4) was not transferred to my transcript on CAMU.I took it in the Fall 2017 semester.My name is Boriche Lydia Kuipo.My ID number is 49282019.I am a Business Administration major in the class of 2019.Thank you.", "Class": "0"}, {"From": "Martinson, Jonas, Vodafone Ghana <jonas.martinson@vodafone.com>", "Subject": "service number not working", "Message": "Hello Team, Service number with serial number is not working. Kindly assist in resolving this issue. Contact – David ( 0501331664) Best Regards,Jonas Martinson          Corporate Account Manager                  Headquarters, South Liberation Link,         Manet Tower A, Airport City, Accra-Ghana         +233202009853          jonas.martinson@vodafone.com          vodafone.com.gh  From: David Asumadu-Boateng [mailto:dboateng@ashesi.edu.gh]  Sent: 19 January 2018 11:29 To: Martinson, Jonas, Vodafone Ghana <jonas.martinson@vodafone.com> Cc: Ashesi Support Centre <supportcentre@ashesi.edu.gh>; Appiah, Maxwell, Vodafone Ghana <maxwell.appiah1@vodafone.com>; Danquah, Eugene, Vodafone Ghana (External) <eugene.danquah2@vodafone.com> Subject: Re: New SIM card Hi Jonas Sim seems not working. See serial below: serial 8923302050017410243.   Best regards,", "Class": "0"}, {"From": "Isatou Jallow <isatou.jallow@aucampus.onmicrosoft.com>", "Subject": "Meal plan issues", "Message": "Hello supportcentre , I realized that similar problem happened  again where Bigben had their dates ahead .  As such,  all transactions that took place  yesterday  from Bigben happened to be recorded for today. Since its weekend I was wondering as the student welfare Chairperson what can be done about this issue?    How can you help students to be able to eat whiles you people are away?   I hope to hear from you as soon as possible.   Regards Aisha jallow -Welfare Chairperson /Ashesi council   Get Outlook for Android ", "Class": "0"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Request for new internet cord", "Message": "Dear Support, I will like to request for a new internet cord as the one I am using is loose. Regards, Theresa Dei DzanieAssistant Manager- HR│Ashesi University1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "0"}, {"From": "Danyuo Yiporo <dyiporo@aucampus.onmicrosoft.com>", "Subject": "Over deduction on card", "Message": "Dear Madam,The attached files shows the transportation cost for a single route were deducted beyond the allowable times on certain days. Please go through and confirm the GHc 97.0 deduction and return the money to my card.# AUE00145.Cheers!!! -----------------------------------------Faculty: Dr. Danyuo YiporoDept. of Mechanical EngineeringAshesi University 1 University AvenueBerekuso, PMB CT 3Cantonments, Accra, Ghana+233262471378/+233550505434 ", "Class": "0"}, {"From": "Takudzwa Kampira <takudzwa.kampira@aucampus.onmicrosoft.com>", "Subject": "Grammarly Premium issue", "Message": "Good day, I hope this mail finds you well. I have been able to set up my free Grammarly account but having complications with the premium account as I am not receiving the mail. Can you kindly help me address this issue?  Thank you,Takudzwa.", "Class": "0"}, {"From": "Ambrose patrick Dery <ambrose.dery@aucampus.onmicrosoft.com>", "Subject": "My Printing account", "Message": "Good morning,My printing account has been suspended for sometime now, for reasons I do not know.I hope it would be rectified soon.Best regards.", "Class": "0"}, {"From": "Nii Akai Nettey <nanettey@ashesi.edu.gh>", "Subject": "Discrepancy on my busplan account", "Message": "Hello IT Team,I just noticed a few duplicated charges on my busplan account(AUE00061). Kindly review and correct.BR-Nii", "Class": "0"}, {"From": "Nana Aba Edzie <nanaaba.edzie@aucampus.onmicrosoft.com>", "Subject": "Inability to sign into courseware", "Message": "Greetings,I am unable to sign into my courseware using Ashesi's office 365. It returns the error shown in the screenshot attached. the folowing are my details: Name: Nana Aba Fukuah EdzieStudent ID: 99322019 Thank you.", "Class": "0"}, {"From": "Nana ekow Korsah <ekow.korsah@aucampus.onmicrosoft.com>", "Subject": "Unable to access Camu account", "Message": "I am unable to access my camu accout it keeps telling me that the pin has already been used while I haven’t yet used it so I was wondering if I could be sent another pin  Get Outlook for iOS", "Class": "0"}, {"From": "Victor Ibeto <vibeto@aucampus.onmicrosoft.com>", "Subject": "Xerox Copier Faulty.", "Message": "Hi support center, The Xerox copier at the library is malfunctioning. Kindly send someone to check it out. Regards, Victor Ibeto Library Assistant│Ashesi University  1 University Avenue Berekuso E/R Tel: +233 (0)302610330 Ext: 1085 Phone: +233 (0)241799472  ", "Class": "0"}, {"From": "Mercy Asante <mercy.asante@aucampus.onmicrosoft.com>", "Subject": "URL Address Blocked", "Message": "Dear Support Team, The URL address below has been blocked, although its a legitimate site. Is it possible to please unblock the website, to aid research.  https://icagh.com/newsite/  Thank you.Kind regards, Mercy Asante Business Administration | C2018Ashesi University College1 University Avenue, Berekuso - E/R PMB CT 3, Cantonments, Accra, Ghana  Mob: +233-546-852-885 Email: merasante@gmail.com | mercy.asante@ashesi.edu.gh ", "Class": "0"}, {"From": "Kissinger K. Dzanie <kdzanie@aucampus.onmicrosoft.com>", "Subject": "Toner Request", "Message": " Hello Support, I`m requesting for a ink toner(83A) replacement for Admissions Printer. I have some huge amount of documents to print out. I’m hoping that this request will be granted. Looking forward to your response.Kissinger DzanieSenior Admissions OfficerAshesi University College1 University Avenue Berekuso E/REmail:kdzanie@ashesi.edu.ghTel:+233(0)302610330 Ext: 1051Phone:+233(0)501319264 ", "Class": "0"}, {"From": "Maame Efua Boham <maameefua.boham@ashesi.edu.gh>", "Subject": "Mealplan Payment", "Message": "Hello,Please find attached payment towards my meal plan.Best,Maame Efua Boham.", "Class": "0"}, {"From": "David Amatey Sampah <dsampah@aucampus.onmicrosoft.com>", "Subject": "Buss Plan Top Up", "Message": "Hello Support Centre, I have made a bus plan top-up payment of 120GHC. Transaction id is 4115510999. Let me know if you need more details Regards David Sampah ", "Class": "0"}, {"From": "Akparibo Richard Awingot <aakpariborichard@yahoo.com>", "Subject": "I can't access my Ashesi mail", "Message": "I can't access my Ashesi mail. It tells me credentials unavailable when I try to login. My email is rakparibo@ashesi.edu.gh and user name is rakparibo ", "Class": "0"}, {"From": "Lesley Lartey <Lesley.Lartey@aucampus.onmicrosoft.com>", "Subject": "Problem with registration and wrong major given.", "Message": "Good Afternoon.    I would like to report various problems with my focus account. Before I gained admission onto this college ,my selected major was computer science but i later visited the administrations office to change my major to mechanical engineering .I was informed that my major was changed successfully but upon checking my focus today it still says my major is computer science. I would like to be able to resolve all issues before further complications arise in the near future.I also faced difficulty in registering for the 2018 spring season .The notice says my registration has been blocked due to accounting/fees issues even though my fees have been paid in full .Please find attached a proof of payment  Get Outlook for Android ", "Class": "0"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "Urgent - Faulty Printer", "Message": "Good Afternoon, Our printer is not issuing prints. The message that comes on it is that the depleted cartridges must be replaced for printing to resume. Kindly help us rectify this as soon as possible as we are in the heat of Career Fair preparations. Kind RegardsAbigail Welbeck Associate Director of Career ServicesAshesi University CollegeTel: (+233) 302 610 330 Ext: 1074Email: awelbeck@ashesi.edu.gh ", "Class": "0"}, {"From": "Augustus Poku Sarkodee ", "Subject": "WiFi down", "Message": "Please we are currently experiencing WiFi issues in the Wangari Maathai, hall B; the hall infront of the TV room entrance. We are unable to see the connections from our rooms.  Thank You", "Class": "0"}, {"From": "Eli Fiati <elifiati@gmail.com>", "Subject": "UPS NOT WORKING PROPERLY", "Message": "DEAR SIR / MADAM, AKORNO'S  UPS SYSTEM IS FAULTY. WHEN THE LIGHTS GO OFF, OUR COMPUTERS GOES OFF ABRUPTLY.  ALL THREE MACHINES ARE USING ONE UPS.  KINDLY ALLOW A TECHNICIAN TO HAVE IT CHECK PROMPTLY THANK YOU.", "Class": "0"}, {"From": "Khadija Bawah <Khadija.Bawah@microensure.com>", "Subject": "Ashesi Mail Access", "Message": "Good morning, Please I have this issue with logging into my Ashesi email.Could  you please assist to resolve?  Many ThanksRegards Khadija BawahThis email and its attachments are confidential or may be otherwise protected and intended solely for the use of the intended recipient. If you receive this email in error, please notify the sender immediately and then delete it from your system. You should not copy it or disclose its contents to anyone.", "Class": "0"}, {"From": "Oswald Gyabaah <oswald.gyabaah@ashesi.edu.gh>", "Subject": "Web Filter preventing my site", "Message": "Hello support center,I have a newly launched site that I am trying to configure but the web filter is preventing me from visiting. Cuold you please help me get access to it? url: Kostech.me  it hosted on GitHub with the oswaldGyabaah.github.iokindly see the screenshot below. Oswald Gyabaah. --- Student | Ashesi University College. c2020 | Computer Engineering major. M: +233554134307 E: oswald.gyabaah@ashesi.edu.gh ******************************* Ashesi University College, 1 University Avenue, Berekuso, PMB CT 3, Cantonments, Accra, Ghana. Tel: +233 (302) 610 330 www.ashesi.edu.gh ", "Class": "0"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "Access to Focus", "Message": "Dear Support Centre, I would kindly like to request access to Focus. Regards,---------------------------------- Anna A. Aggrey | CS PROGRAM COORDINATORAshesi University CollegeBerekuso, Eastern Region.Tel: 233(0) 249-675-016 // Ext 2024Email: aaggrey@ashesi.edu.gh www.ashesi.edu.gh ", "Class": "0"}, {"From": "Eunice Adjoa Yeboah Adu <eunice.adu@aucampus.onmicrosoft.com>", "Subject": "MealPlan Card Renew", "Message": "Good afternoon, I trust this mail finds you well. I would kindly like to request for my meal-plan card to be renewed as the balance is over. My card number is 10469999.  Thank you Best RegardsEunice AduCareer Services Administrative AssistantAshesi UniversityBusiness Administration, '18Phone: +233 266235309Email: eunice.adu@ashesi.edu.gh", "Class": "0"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "one drive", "Message": "Hello - I am not able to open One Drive while in MS-Word. Can somebody please help me with this problem? Thank you,Lenny", "Class": "0"}, {"From": "David Amatey Sampah <dsampah@aucampus.onmicrosoft.com>", "Subject": "Buss Plan Over Charge", "Message": "Hello Support Centre,Another instance of overcharge 27th August - picked twice, charged 4 times RegardsDavid ", "Class": "0"}, {"From": "David Kadeh <dkadeh@ashesi.edu.gh>", "Subject": "EMAIL & SMS COMMUNICATION TO STUDENTS", "Message": "Dear Students,Please see in the email below the link to AshesiPay portal for those who would wantto pay fees via MasterCard, VISA or mobile money etc. Thank you David Kadeh From: shelter siebu <shelter.siebu@gtbank.com>  Sent: Wednesday, August 22, 2018 1:00 PM To: David Kadeh <dkadeh@ashesi.edu.gh> Cc: 'gh epayments' <gh.epayments@gtbank.com>; 'Emmanuel Owusu Oduro' <emmanuel.oduro@gtbank.com>; leopold.armah@gtbank.com Subject: EMAIL & SMS COMMUNICATION TO STUDENTS Dear Sir, Reference our conversation earlier today, please find below the message to be sent to your student body: Pay your Ashesi Fees with Convenience. Visit https://ibs.gtbghana.com/AshesiPay/login.aspx, log in with your student ID, pin & proceed to pay with your Visa or MasterCard.   Thank you. Shelter SiebuDigital PaymentsGuaranty Trust Bank (Ghana) Limited25A Castle Road, Ambassadorial Area, Ridge, Accra GhanaPMB CT416, cantoments, Accra-GhanaTel: (+233 28) 967 7578, 680662 | Fax: (+233 302) 662727 I Mob: 0504 100282   ", "Class": "0"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "Setting up Grammarly", "Message": "Hello, I had a previous account with grammarly so followed the instructions to log out and create a new account. I have been waiting ofr the confirmation/activiation email since yesterday at 5pm. Please assist! BRKajsa Kajsa Hallberg Adu, PhD  Lecturer (Social Theory, Written and Oral Communication, Text and Meaning, Leadership 1, Giving Voice to Values, Teaching Writing Seminar)Team lead for the writing coursesGlobal Liberal Arts Alliance LiaisonChair of the Library CommitteeVice Chair of the Research Committee Ashesi University College | PMB CT 3, Cantonments, Accra, Ghana | Office 204  | Phone: +233.302.610.330, ext. 1058  Fax: +233.302.610.340 or +233.302.974.980 | Skype: kajsahallberg |  Mobile: +233.249.187.210", "Class": "0"}, {"From": "Otitodirichukwu Effiong-Akpan <tito.akpan@aucampus.onmicrosoft.com>", "Subject": "Ashesi Payment Portal", "Message": "Good afternoon,Compliments of the season! Please I am unable to access AshesiPay because I never received a PIN. I want to get information about school fees, please how do I go about it? Thank you. Best regards,Otitodirichukwu Effiong-AkpanC2021 | Computer Engineering +2330550991988| +2348188417833 Get Outlook for iOS", "Class": "0"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "WiFi Credentials", "Message": "A message from the IT Department: Hello all,I hope this email finds you well. Recently, there has been a series of flagged accounts of some Ashesi students due to unauthorized access of some sites. The IT Department is urging you all not to share your WiFi credentials (username and password) with any visitors, cleaners or security personnel for it has been found that there have been cases of attempted by-pass of the Fortinet Firewall which has led to blocking of some of the students’ internet access which results to inconvenience. If any of the aforementioned need WiFi credentials kindly refer them to the IT Office or Support Center to receive credentials for the Ashesi GUEST WiFi. If you have your credentials shared already, you are kindly advised to change your password as soon as possible. Have an awesome weekend and all the best as you prepare for your Mid-Semester Exams. Keep on Winning!!! Regards,Wayne  Wayne Jotham Gakuo | Bsc. Computer Science |Class of 2019 | Developer Student Club (DSC) Ashesi University- Lead |Public Relations Committee Chairperson- Ashesi Student Council | I.T. Intern |Ashesi D:Lab Photography & Videography Lead | Ashesi University, Ghana|wayne.gakuo@ashesi.edu.gh | +233 26927 9780| +254 7269 38259", "Class": "0"}, {"From": "Karen Ofori <karen.ofori@ashesi.edu.gh>", "Subject": "Error made in transcript", "Message": "Hello,I would like to draw your attention to an error made in my transcript. In the first semester of my freshman year, I took calculus 1, however it has been reflected in my transcript twice thus, affecting my total GPA as well as the CGPA. I would be most grateful if this mistake is corrected. Warmest regards,Karen OforiAshesi UniversityClass Representative | Judicial Electoral Council  Bsc. Business Administration | 2021Tel: +233 26 329 6225 | karenabenaofori@gmail.com Sent from Mail for Windows 10  Virus-free. www.avast.com", "Class": "0"}, {"From": "Emmanuel Akwasi Bediako <emmanuel.bediako@ashesi.edu.gh>", "Subject": "Forgotten Password", "Message": "Hello,Please I have forgotten my email  password and I would like for it to be reset for me . With regards,Emmanuel Bediako. Sent from Mail for Windows 10 ", "Class": "0"}, {"From": "Edwin Adatsi <edwin.adatsi@aucampus.onmicrosoft.com>", "Subject": "Courseware Log In Problem", "Message": "Hello,  I am unable to log into my courseware. Attached is a snip of the error I receive when I try logging in. Name: Edwin AdatsiID: 14602019Email: edwin.adatsi@ashesi.edu.gh ...  Edwin Adatsi ", "Class": "0"}, {"From": "Kwabena Bamfo <kwabena.bamfo@ashesi.edu.gh>", "Subject": "Blueetoth Connection", "Message": "Hi Ashesi Support Team, I'm currently unable to connect a Bluetooth device on the Lenovo ThinkCentre I often use in the office (Engineering FI Office). I'm guessing it has to do with permissions I may not have. Could I get assistance with this?  Looking forward to hearing from you soon on the way forward.  Respectfully, Kwabena BamfoFaculty Intern, Computer Programming For Engineering  ", "Class": "0"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "New Hires on Staff Mailing List", "Message": "Good Afternoon, Kindly confirm if Michael Atta- Mensah and Najeeb Mohammed Ibrahim have been included in the Staff mailing group as they have not been receiving emails sent to Staff members. Kind RegardsAbigail Welbeck Associate Director of Career ServicesAshesi UniversityTel: (+233) 302 610 330 Ext: 1074Email: awelbeck@ashesi.edu.gh ", "Class": "0"}, {"From": "Dennis Sifuna <dennis.sifuna@aucampus.onmicrosoft.com>", "Subject": "Courseware Log In failure", "Message": "Good evening, I hope this email finds you well. Please, I can’t log in to courseware and it is telling me that, ‘ no user information was returned. The oauth 2 service may be configured incorrectly’.Attached is a picture of the error message.Dennis Sifuna Wanyonyi 30492019  Kind Regards, Dennis Sifuna WanyonyiGet Outlook for iOS", "Class": "0"}, {"From": "Elona Boateng <elona.boateng@aucampus.onmicrosoft.com>", "Subject": "Issues with my courseware", "Message": "Hii,    Please I am currently having issues within my courseware. Anytime I try to log in, it returns the information in the attached screenshot. I hope you fix this soon. Thank you.  Regards,Elona ", "Class": "0"}, {"From": "Dinah Kotey Baidoo <dbaidoo@ashesi.edu.gh>", "Subject": "AshesiAir wifi not working in the library", "Message": "Dear Support Centre, Students have complained that the Ashesiair wifi is not working in the library.I personally have experienced this yesterday. Instead, the Ashesiair wifi works outside the library. Could you please attend to this issue?  Thanks for your quick response. Best regardsDinah Koteikor Baidoo Assistant LibrarianAshesi University College 1 University Avenue, Berekuso -E/RPMB CT3 CantonmentsAccra, Ghana.Tel: +233 302 610 330Cel: +233 208 197 049 / 246 808 671Email: dbaidoo@ashesi .edu.gh / kutbelle@gmail.comWebsite: www.ashesi.edu.gh   ", "Class": "0"}, {"From": "Lorenzo Torresani <LT@dartmouth.edu>", "Subject": "my Ashesi account", "Message": "Good morning,   I am writing to check if you have already created my Ashesi account. Once it's ready please share the login details with me. Thank you,   Lorenzo  ", "Class": "0"}, {"From": "Rose A. Dodd <rdodd@ashesi.edu.gh>", "Subject": "New Hire Email Needed", "Message": "Hello Support, We have a new hire for the Education Collaborative and are requesting an email address for her please.  Name: Chenelle Owusu She starts on Monday, 29th January, 2018 Thanks for your help.  Rose --Rose DoddLecturer, Foundations of Design and Entrepreneurship | Leadership as Service - for Engineers Department of Business Administration | Ashesi University College 1 University Road Berekuso Ghana. | PMB CT3, Cantonments | Accra Ghana | +233 (0)302.610330 | www.ashesi.edu.gh | info@ashesi.edu.ghCell phone: +230 583 409 01 | Blog: designthinkingghana.wordpress.com | Kaya ChildCare | Facebook | www.kayachildcare.org  THE EDUCATION COLLABORATIVE ", "Class": "0"}, {"From": "Alhassan Sullaiman <asullaiman@ashesi.edu.gh>", "Subject": "Difficulty with CAMU", "Message": "Dear Support centre,Please can you help me figure out the difference between using the homework icon on course content under academic plan and using the assignment tracker for uploading assignments to student. Also, can not download the attendance file of students in staff under attendance even though I can click on the message to give the prompt. Nothing is downloaded. Best regards!!! ", "Class": "0"}, {"From": "Elvis Okoh-Asirifi <elvisokohasirifi@gmail.com>", "Subject": "Password Expiry", "Message": "Hello, I trust this mail finds you well. I wish to inform you that my password issue has still not been resolved. I can no longer receive mails from Ashesi nor use any of the SIS platforms and i have learnt Dr Korsah has sent us a mail. Kindly help me resolve it as soon as possible. Thank you. My username is elvis.okoh-asirifi Regards,Elvis Okoh-Asirifi.", "Class": "0"}, {"From": "Temidire Bakre <temidire.bakre@ashesi.edu.gh>", "Subject": "Unable to access Wi-Fi", "Message": "Dear Ashesi Support,   I am currently unable to access the Ashesi Air Wi-Fi as each time I try to access it, it says I'm locked out. I also get the same response when I try to login to my account on the campus computers. Please help me resolve this issue.  Thank you.   Yours sincerely,  Temidire Bakre Management Informations Systems Major Class of 2020 Ashesi University. ", "Class": "0"}, {"From": "Patrick Awuah <pawuah@ashesi.edu.gh>", "Subject": "Error logging into Skype for Business", "Message": "I am unable to log into Skype for Business.  ", "Class": "0"}, {"From": "Akwasi Asante Otchere <aotchere@aucampus.onmicrosoft.com>", "Subject": "Request for new toner", "Message": "Dear Support,   This email is to request for a new toner for Araba’s office and admissions’s colored toner.  Kind regards.  On behalf of the Director, Admissions & Financial Aid. Akwasi Asante Otchere | Admissions Officer | Ashesi University College 1 University Avenue, Berekuso| Eastern Region | PMB CT 3 Cantonments | Accra, Ghana  ", "Class": "0"}, {"From": "Nana Yaa Pokuah-Debrah <nanayaa.debrah@ashesi.edu.gh>", "Subject": "Problem with CAMU setup", "Message": "Warm Greetings,I tried setting up my Camu account following the instructions but it didnt go throuh. Problem: I requested for a new password and  received an email with the password. The new password didnt work. I requested a reasonable number of times and decided to ask for help. Thanks", "Class": "0"}, {"From": "Ashesi Support Centre <supportcentre@ashesi.edu.gh>", "Subject": "Internet Serivce Diruption", "Message": "Dear all, Our Internet Service Provider will be replacing a faulty line card on their systems today. This is being done to prevent a long term internet outage and improve on the stabilization of our internet service.  We may experience internet outage during this process, between the hours of 6:00pm - 7:30pm. Kindly take note and cooperate with us.   Regards, Ashesi Support Centre  Ashesi University College  Berekuso, Ghana   Email         - supportcentre@ashesi.edu.gh Website     - www.ashesi.edu.gh Phone        - +233 302 610 330 OR +233 302 974 980 Extension   - 1111  Mobile        - +233 501 673 669 Office         - Engineering Room 105    How would you rate my reply? Great    Okay    Not Good {#HS:679269621-6857#}   ", "Class": "0"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "USB port not working", "Message": "Dear Support Center, Kindly note that the USB ports on the desktop computer in the room allocated for exams printing in room 205E does not work. Regards,---------------------------------- Anna A. Aggrey | CS PROGRAM COORDINATORAshesi University CollegeBerekuso, Eastern Region.Tel: 233(0) 249-675-016 // Ext 2024Email: aaggrey@ashesi.edu.gh www.ashesi.edu.gh ", "Class": "0"}, {"From": "Francesca Larnyoh <Francesca.Larnyoh@aucampus.onmicrosoft.com>", "Subject": "AshesiPay", "Message": "Dear Support centre, I'm having trouble logging in to pay my fees using the AshesiPay feature, each time I log in it says student ID does not match email. Please can you kindly rectify to problem. Thanks,  Larnyoh' 21  Get Outlook for Android ", "Class": "0"}, {"From": "Sally Dibba <sally.dibba@aucampus.onmicrosoft.com>", "Subject": "Difficulty on Grammarly logon", "Message": "Hello,Trust you fine. I still find it hard to log on to the Ashesi Grammarly premium. I follow the steps to sign up but unfortunately, I never receive the code to proceed on the login process.Please kindly help.  Thank you  Best regards,Sally.  ", "Class": "0"}, {"From": "Raymond M. Chivere <raymond584chivere@gmail.com>", "Subject": "Account Disabled", "Message": "Hello,I cannot login into the library computers or connect to the internet or login to Microsoft account. I'm receiving a message that say's my account has been disabled please see your system's administrator.   my username is: raymond.chivere@ashesi.edu.gh ", "Class": "0"}, {"From": "Danyuo Yiporo <dyiporo@aucampus.onmicrosoft.com>", "Subject": "Assistance with software installation on my labtop", "Message": "Dear Madam,I wish to get an assistance with the installations of software on my laptop.I do not have an administrative permission and this is causing me a lot stress.I am in office 205C, Engineering. Faculty: Dr. Danyuo YiporoDept. of Mechanical EngineeringAshesi University College1 University AvenueBerekuso, PMB CT 3Cantonments, Accra, Ghana+233262471378", "Class": "0"}, {"From": "Esi Ofori-Acquah <Esi.Ofori-Acquah@aucampus.onmicrosoft.com>", "Subject": "Meal plan card payment", "Message": "Dear Ashesi Support Centre, Hope this mail finds you well. Please my daddy forgot to write what the payment was for. It is for my meal plan card. Thank you. Regards,Esi Sagua.  ", "Class": "0"}, {"From": "Vanessa Nana Darkoa Amoako <vanessa.amoako@ashesi.edu.gh>", "Subject": "Assistance in setting up Radichel 209 Calling System", "Message": "Dear Support Centre,   I would be very glad if you can please assist me in setting up the calling system at the Conference room 209 for a faculty committee meeting at 3 pm tomorrow. Please let me know if this will be possible.   Thank you, and I hope to hear from you soon.  Best wishes, Vanessa   --  Vanessa Amoako  (Sent from a mobile device. Please excuse my brevity and any errors.) ", "Class": "0"}, {"From": "Fiona Muithi <fiona.muithi@ashesi.edu.gh>", "Subject": "Projector for GCIC", "Message": "Hello, I hope this finds you well.GCIC would like to request for a projector from Ashesi. We would need the projector for 2 days (10am-5pm)- Thursday 2nd August and Friday 3rd August 2018.Is there a projector available for the 2 days stated? Best, ", "Class": "0"}, {"From": "Queen Frimpong <frimpqueen@gmail.com>", "Subject": "Cannot access email", "Message": "This is in response to the request for my details to reset my password. Kindly find my details below:Name: Queen FrimpongYear: 2020Major: Computer ScienceID: 92102020old password: lifeinme15new password: Christinsideme20Thank you very much.  ", "Class": "0"}, {"From": "albert eyison <alberteyison@gmail.com>", "Subject": "UNABLE TO RECEIVE EMAILS", "Message": "Hello, Greetings to all. Please assist me with my inability to access emails via my alumni account -albert.eyison@alumni.ashesi.edu.gh.  Looking forward to your revert. Cheers, Albert EyisonC2016", "Class": "0"}, {"From": "Ashesi Support Centre <supportcentre@ashesi.edu.gh>", "Subject": "Microsoft Intune Rolled Out to Ashesi Office 365", "Message": "Hello everyone, Happy ASC week! Please note that Microsoft has rolled out it’s Intune application to Office 365 platforms including Ashesi’s Office 365 platform. Please see below more information about Microsoft Intune Microsoft Intune is a mobile management platform that helps users of Microsoft Enterprise product (i.e. Office 365 products in our case) to easily and securely access Ashesi’s information from their mobile devices•This new rollout will require some devices to install the Microsoft Intune app from the various application stores•This new app will allow Ashesi’s IT team easily manage updates, protect Ashesi devices and secure Ashesi data and documents, remotely assist users and track/disable/wipe out data from any stolen device when necessary.• Please contact the Support Centre if you need any assistance with this new Microsoft upgrade. Thank you. Regards,Ashesi Support CentreAshesi University CollegeBerekuso, Ghana Email           - supportcentre@ashesi.edu.ghWebsite     - www.ashesi.edu.ghPhone         - +233 302 610 330 OR +233 302 974 980Extension  - 1111Office         - Engineering Room 105  ", "Class": "0"}, {"From": "Edel Togobo <Edel.Togobo@aucampus.onmicrosoft.com>", "Subject": "WIFI NOT WORKING", "Message": "Dear sir/ Madam, I would like to bring to your notice that, the WIFI in The Wangari New Hostel is not working.This is very inconvenient for us and we hope this can be rectified soon.Thank you. Regards,Edel Togobo.", "Class": "0"}, {"From": "Michael Osei <michael.osei@aucampus.onmicrosoft.com>", "Subject": "MEAL PLAN SERVICES", "Message": "Hello,            I'm Michael Osei, an AFA scholar. Please I have ran out of money on my meal plan card. Kindly fix this issue for me. Thank you.", "Class": "0"}, {"From": "Elena Rosca <e.v.rosca@gmail.com>", "Subject": "MPR projector", "Message": " Dear all,   I am sorry to complain about this issue but ever since the semester started I have not been able to use my laptop in MPR room. I have a Mac, although now PC seems to work. I would greatly appreciate it if this issue can be fixed as it is quite inconvenient for lectures and for the students. Thank you very much,   Best wishes,  Elena  ", "Class": "0"}, {"From": "Maama Akos <akosmaama6@gmail.com>", "Subject": "MEAL PLAN REIMBURSEMENT", "Message": "Dear sir/madam,I, Ernestina Akosua Adobea Horthman, on this day, 13th December, 2017, would like to request the reimbursement of funds from my ward, Angela Obuobia Horthman's meal plan account. I hope my request is granted.The amount of money to be reimbursed to   my ward meal from the  plan is GH€ 1500. Please Pay the amount into  this account: Account Name: ADU EVANSAccount Name: ADB- Lapaz BranchAccount Number: 3011070067474301Counting on your usual cooperation.Thank you. Sincerely, Ernestina.", "Class": "0"}, {"From": "Joyce Akey <Joyce.Akey@aucampus.onmicrosoft.com>", "Subject": "Unable to sign in to CAMU", "Message": "Hello, Please, I can't log in to My CAMU due to an entry of either wrong password or username. When i go to the 'forgot password' directory, 'invalid mail' keeps popping up. The email address i enter is my Ashesi mail, free of errors. It started on Saturday ,October 6. I'm looking forward to getting a reply from you. Thank you Joyce AkeyBsc. Mechanical Engineering' 21Ashesi University", "Class": "0"}, {"From": "Queen Frimpong <queen.frimpong@ashesi.edu.gh>", "Subject": "Cannot access invence", "Message": "Hello good evening,Please for some time now, I have not been able to access invence on my computer. Kindly help me out. Also, my username and password are not able to give me access to Ashesi Air. ------------Queen FrimpongComputer Science Major|AU'2020Ashesi University1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Email: queen.frimpong@ashesi.edu.ghTel: +233-557-484-957 ", "Class": "0"}, {"From": "Gedeon Niyonkuru <gedeon.niyonkuru@aucampus.onmicrosoft.com>", "Subject": "Can't access courseware", "Message": "Dear all, I can’t access courseware and there are some submission that I need to make. My id is: 70362018Kindly help, Thanks, GedeonSent from Mail for Windows 10 ", "Class": "0"}, {"From": "Wilfred Amoo-Gottfried <wilfred.gottfried@aucampus.onmicrosoft.com>", "Subject": "Major on CAMU", "Message": "Hello, My major on CAMU says electrical engineering, however it was changed to Mechanical Engineering and those changes were confirmed on Records. I am pleading with you to change this back for me.  Best regards, Wilfred  Get Outlook for iOS", "Class": "0"}, {"From": "Juliet Abdul-Aziz <juliet.aziz@ashesi.edu.gh>", "Subject": "Problem With Email", "Message": "Hello  I have issues receiving an email from some people while I am able to receive from others. If you can be of any assistance in any way please notify me.  In case replying to me becomes a problem, email me through julietfatimat@gmail.com to  Thank you.  Best  Juliet Abdul-Aziz|AU ' 2020Computer Engineering Student,Ashesi University,Berekuso, Eastern Region.Tel: +233 2060003306Ashesi: Website | Twitter | Facebook |YouTube | Instagram", "Class": "0"}]