[{"From": "Mustapha Yussif <mustapha.yussif@ashesi.edu.gh>", "Subject": "AC in 216", "Message": "Dear sir/madam, I trust this email finds you well. I want to bring to your notice that the AC’s in the lecture hall 216 is not working. We will appreciate your assistance with regards to this issue. Thank You, Best regards,Yussif Mustapha Tidoo,  ", "Class": "1"}, {"From": "Mohamed Hijazi <mohamed.hijazi@aucampus.onmicrosoft.com>", "Subject": "Air-conditioning in No-Mo Hall", "Message": "Dear Support Centre, There is an A/C in the Motulsky Hall that is leaking. The specific A/C is located in Hall B (207-B), located at the back left of the hall when the hall has been divided. I have printed a \"Do not Touch\" sign and placed it on the remote control that controls that set of A/C's (Although 1 A/C is spoilt).  Regards,  Mohamed Hijazi  Computer Science 19' | I.T. Intern | Ashesi University College 1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, Ghana Email: mohamed.hijazi@ashesi.edu.gh | Phone: +233 26 833 0011 ", "Class": "1"}, {"From": "Teni Agana <teni.agana@ashesi.edu.gh>", "Subject": "Floor in the bathroom", "Message": "Dear Mr Casper Annie, Good morning and I hope this email finds you well. Please, room f11 and f12 have an issue with their bath room. The water does not move after bathing and this is a big problem for them. Thank you and I hope to hear from you soon.  Best Regards,Teni Agana  Get Outlook for iOS", "Class": "1"}, {"From": "Herman Duse <herman.duse@ashesi.edu.gh>", "Subject": "Lighting Problem", "Message": "I would like to bring to your notice, the malfunctioning of seven solid light-bulbs in Walter Sisulu (Hall 7). I would be glad if the issue is attended to as soon as possible to cater for any inconveniences this might cause when students report to school. Thanks in advance!!!   -----------------------------------------Herman Duse. (APSU).Business Administration Major (C.2020).MasterCard Foundation Scholar.International Students RepresentativeAshesi University Berekuso, Eastern Region. Tel: (+233) 540943850Email: herman.duse@ashesi.edu.ghEmail: hermannduse@gmail.comAshesi: Website | Twitter | Facebook\"Whatever you can do or dream you can do, begin it. Courage has genius, power and magic in it\"", "Class": "1"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Monthly Staff Meeting: 3rd April, 2018", "Message": "Monthly Staff Meeting: 3rd April, 2018", "Class": "1"}, {"From": "Warihana Gumah <warihana.gumah@ashesi.edu.gh>", "Subject": "Leaking AC at the engineering FIs' office", "Message": "Dear Support, This is to report a leaking AC at the engineering FIs' office. We are counting on your immediate response. Thank you. RegardsWarihana Gumah", "Class": "1"}, {"From": "Victor Ibeto <vibeto@aucampus.onmicrosoft.com>", "Subject": "Library Air Conditioners down.", "Message": "Hello Support Centre, I would like to bring to your notice that the library Air conditioners are not functioning properly. I would want to believe that they are out of gas. Kindly send someone to check it out. Thank You. Regards, Victor Ibeto Library Assistant│Ashesi University  1 University Avenue Berekuso E/R Tel: +233 (0)302610330 Ext: 1085 Phone: +233 (0)241799472 ", "Class": "1"}, {"From": "Bless Ayikpa <bless.ayikpa@ashesi.edu.gh>", "Subject": "Hostels", "Message": "Hi Support Centre,I hope this email finds you well.The rooms in Hall A A10 and A11 washroom do not have shower curtains.Also room A6 light bulbs are not working.Room A7 sink is clogged. We will be very grateful if these issues are done.Thank you very much.Best Regards,Bless Abena AyikpaGet Outlook for iOS", "Class": "1"}, {"From": "Emmanuel Nimo <emmanuel.nimo@aucampus.onmicrosoft.com>", "Subject": "Malfunctioning Microwave", "Message": "Dear Support Team,  I hope this email finds you well. I would like to inform you that the microwave at Walter Sisulu Hall 8 Top floor is not functioning. Please, I am humbly waiting for your response. Thank you.  Regards.", "Class": "1"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "a/c", "Message": "Hi – the air conditioning is not working in my office, Room 105. Thanks,Lenny", "Class": "1"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "Defective Office Door Knob", "Message": "Hello Support Center, The door knob to my office, shared with Najeeb (Radichel 204), has just come off and we will really appreciate it if someone can take a look at it for us now. Kind RegardsAbigail Welbeck Associate Director of Career ServicesAshesi UniversityTel: (+233) 302 610 330 Ext: 1074Email: awelbeck@ashesi.edu.gh ", "Class": "1"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Monthly Staff Meeting", "Message": "Monthly Staff Meeting", "Class": "1"}, {"From": "Dennis A. Owusu <dowusu@aucampus.onmicrosoft.com>", "Subject": "No soap in dispenser", "Message": "There's no soap in the dispenser at the men's washroom at engineering \"up\".  Dennis Asamoah Owusu Faculty, Computer Science Ashesi University www.ashesi.edu.gh ", "Class": "1"}, {"From": "Dinah Kotey Baidoo <dbaidoo@ashesi.edu.gh>", "Subject": "Leakage of an air-conditioners in the library first floor", "Message": "Dear Support Centre, For your information, one of the library air-conditioners at the first floor is leaking profusely.I would be very grateful for your immediate attention.  Thank you.  Best regardsDinah Koteikor Baidoo Assistant LibrarianAshesi University College 1 University Avenue, Berekuso -E/RPMB CT3 CantonmentsAccra, Ghana.Tel: +233 302 610 330Cel: +233 208 197 049 / 246 808 671Email: dbaidoo@ashesi .edu.gh / kutbelle@gmail.comWebsite: www.ashesi.edu.gh   ", "Class": "1"}, {"From": "Jennipher Panashe <jennipher.panashe@aucampus.onmicrosoft.com>", "Subject": "Water not flowing in one sink", "Message": "Dear Support Centre, May you kindly note that water is not flowing from the tap for rooms I11 and I 12 in Hostel 2C. Thank you. Kind Regards,  Jennipher Alista PanasheMechanical Engineering '19| Ashesi University CollegeResident Assistant| Curious Class Treasurer1 University Avenue, Berekuso E/R |PMB CT 3 Cantonments Accra, Ghanaemail - jennipher.panashe@ashesi.edu.gh |jpanashe@usapglobal.org|jennipher@agrichot.orgcell - +233 560 223 060|+263 776 696 888  “The trouble with having an open mind, of course, is that people will insist on coming along and trying to put things in it.” ", "Class": "1"}, {"From": "Leonard Baer <LBaer@aucampus.onmicrosoft.com>", "Subject": "Room 216 cable missing / Faculty Down printer again", "Message": "Dear Ashesi Support, Yesterday in Room 216, the cable to connect my laptop to the projector was missing. Is it possible to replace the cable in time for my class tomorrow in the same room? Also, the printer has been replaced at Faculty Down but every time I try to print, I get an error message. Please help me to be able to print. Thank you,Lenny", "Class": "1"}, {"From": "Maureen Basemera <maureen.basemera@aucampus.onmicrosoft.com>", "Subject": "Hall C maintaince issues", "Message": "Good day Dzifa,  These are the complaints or issues we have had since the beginning of this month. Regards,Maureen Molly", "Class": "1"}, {"From": "Kobina Graham <kgraham@ashesi.edu.gh>", "Subject": "Transport Transaction Code", "Message": "Hello there, I have loaded GHc20 to my Ashesi ID card and I believe I am supposed to send a transaction ID to Support to finalize the process. My number is as follows: 4332448635 Kindly let me know if there is anything else I need to do. Many thanks, Kobby  Kobina Ankomah-Graham Lecturer: Ashesi University College, BBC  Writer: The Guardian, DUST (editor)Creative: The DECAF Podcast, Beatphreaks, Litro MagazineDigital Media Strategist: Global Voices, Whatsapp in the Classroom Bio: LinkedIn, kobbygraham.com \"The true revolutionary is guided by a great feeling of love... We must strive every day so that this love of living humanity will be transformed into actual deeds, into acts that serve as examples, as a moving force.\" Ernesto 'Che' Guevara", "Class": "1"}, {"From": "Owuraku Forkuo-Kyei <Owuraku.Forkuo-", "Subject": "New student ID card", "Message": "  Get Outlook for iOS", "Class": "1"}, {"From": "Enoch Agonyo <eagonyo@ashesi.edu.gh>", "Subject": "Broken Sofa Leg in the Library", "Message": "Dear Support, Kindly, one of the sofa's in the library has its leg broken. Could you please forward this to the appropriate department to attend to it. RegardsEnoch Kofi AgonyoAshesi University CollegePMB CT 3, Cantonments, Accra-Ghanahttp://www.ashesi.edu.ghhttp://www.ashesi.edu.gh/academics/library.html Tel:+233(302) 610 330 Ext: 1085 Mob: 024 2516353  eagonyo@ashesi.edu.gh    ", "Class": "1"}, {"From": "Rose A. Dodd <rdodd@ashesi.edu.gh>", "Subject": "Staff ID Card", "Message": "Good morning, I’ll be coming by for the staff ID card and photo please.  I made the mobile money payment to the bus fare this morning from number: 0271217344I used Express Pay so there’s not MM transaction ID. But the Express Pay transaction ID is: 97301605xx6b53 Thank you. Rose  --Rose Dodd Assistant Lecturer, EntrepreneurshipDepartment of Business Administration | Ashesi University College |+233 (0) 302.610330 | www.ashesi.edu.gh Project Manager, The Education Collaborative Co-founder: Kaya ChildCare | www.kayachildcare.org | Facebook |”Ensuring a future of unlimited prospects for children with limited beginnings” designthinkingghana.wordpress.com    ", "Class": "1"}, {"From": "Suzanne Buchele <sbuchele@ashesi.edu.gh>", "Subject": "Water in Guesthouse", "Message": "When I came home from work today there was a lot of water in the guesthouse from the rain. As far as we can tell it came in under the front door. It went into the washroom to the back wall, into the living room toward our apartment and the standing shoe rack, and into our apartment. It may just be a design issue though, there may not be much that can be done about it.   It is unusual- we have had heavy rain before but never had water by the front door at all, so the quantity is surprising if it is a design issue. There is one other possibility, the ceiling in that front washroom looks a bit buckled, it may be worth a look to see if there is water up there. Since the walls of that room are tiled, we may not have seen if/where the water ran down. Thanks, Suzanne   Sent from my Windows Phone", "Class": "1"}, {"From": "Dennis A. Owusu <dowusu@aucampus.onmicrosoft.com>", "Subject": "Air conditioners on in the mornings", "Message": "Hi Support, David and I have observed that when we arrive in the morning, our air conditioner is on with the door opened. Is this by design? We thought someone should know about this. Regards, Dennis Asamoah OwusuFaculty, Computer ScienceAshesi Universitywww.ashesi.edu.gh ", "Class": "1"}, {"From": "Michael Agyeman-Prempeh Dankwah ", "Subject": "Water leakage beside Football pitch.", "Message": "As at 2:25 am, I saw some amount of water flowing and spreading throughout the whole place. It happened behind Walter Sisulu Hall (Hall 7 and 8)", "Class": "1"}, {"From": "Michael Adu <michael.adu@aucampus.onmicrosoft.com>", "Subject": "Leaking of Air Conditioner in Class 207-B", "Message": "Good afternoon.I am writing to inform you that the air conditioning unit in the class of 207-B is leaking at the moment. Please treat this issue as the floor is very wet and classes are ongoing.Thank You", "Class": "1"}, {"From": "Rebecca Awuah <rawuah@ashesi.edu.gh>", "Subject": "bathroom soap", "Message": "Hello, Hand soap is out in the bathroom 104-W. It has been out for 1 week and has not been refilled. Thanks,Rebecca Rebecca AwuahMathematics LecturerAshesi UniversityBerekuso, Ghana +233 30 261 0330www.ashesi.edu.gh ", "Class": "1"}, {"From": "Emmanuel Mwinbong ", "Subject": "Broken Sockets in 806", "Message": "To whom it may concern,                Two sockets in 806, thus one of the sockets at the bed side and the socket at the ironing board have broken down. I will like to draw your attention to the situation and plead with you to use your highly respectable office to help rectify the situation.                             Thank you.A concerned member of 806,Emmanuel Mwinbong,emmanuel.mwinbong@ashesi.edu.gh.", "Class": "1"}, {"From": "Sadat Issah <sadat.issah@ashesi.edu.gh>", "Subject": "Faulty Door Handle", "Message": "Hello Support Centre, I will like to bring to your notice a faulty main entrance door handle at the common veranda between room H11 and H12 at Block 2C. The door handle is loose and unable to lock the door. Thank you.   RegardsSadat Issah Sent from Mail for Windows 10 ", "Class": "1"}, {"From": "Ayebilla Avoka <ayebilla.avoka@ashesi.edu.gh>", "Subject": "Hall issuess", "Message": "Dear Support Center,The Wi-Fi has been bad this morning at the Wangari Mathai hostel. We will appreciate it if you could do something about it. Also, the mirror in the washroom shared by B2 and B3 is partially unscrewed. No one knows how it got unscrewed but I am guessing it might have happened when the cleaner was cleaning it. Some two louver blades are also missing from the downstairs quad. I have asked the hall members but no ones seems to know who broke them or removed them.I hope these issues will be attended to.Thank you.Ayebilla Avoka,RA, Hall B. ", "Class": "1"}, {"From": "Hostel Coordinators <hostels@ashesi.edu.gh>", "Subject": "Light problem at 2B hostel.", "Message": "Hello All, The light at 2b is off and students are complaining.Please this is urgent. Thank you RegardsSuala", "Class": "1"}, {"From": "Yvette Umutari <yvette.umutari@aucampus.onmicrosoft.com>", "Subject": "Bad bugs", "Message": "Dear Team, I hope this email finds you well. I would like to appreciate and thank you for all the immediate feedback and helping fix problems we had last semester as hall 2. So, as the semester started, we realized that there are some bed bugs in one of the rooms in my hall 2 (room 206). The bed bugs incident started last semester but the front desk managed to spray the beds. This semester, the bed bugs has increased and this would affect the entire hall since bed bugs spread easily. We are bringing this to your attention so that if there is a way we can change beds, we can do it as soon as possible. Thank you for your consideration.   Regards,Yvette RA ", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "LOW WATER PRESSURE IN WARREN LIBRARY WASHROOMS", "Message": "Dear Support people can you ask Operations to check the water pressure to the washrooms in the Warren Library?  It seems to be very low  Regards  Nina Nina ChachuHead Librarian, Ashesi University CollegeLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh ", "Class": "1"}, {"From": "Christopher Zanu <christopher.zanu@aucampus.onmicrosoft.com>", "Subject": "Washroom Handle at Motulsky", "Message": "Hi,  Find attached an image which shows the handle of the washroom door coming off. This is at the washroom at Motulsky Hall.  Kind regards,  Christopher Zanu.  Get Outlook for Android ", "Class": "1"}, {"From": "Genesis Nchopereu <genesis.nchopereu@aucampus.onmicrosoft.com>", "Subject": "Urgent Issues from Hall E", "Message": "Dear Dzifa, I trust that you are having a great week? I'm writing to draw your attention to two urgent things in my hallThe bathroom sink to rooms E2-3 is still leaking and it's getting worse by the days1. Bed bugs were discovered on a bed mattress in room E4 today and they are a lot in number- any intervention? 2.  Also, we still have all initial electrical work (spoiled light bulbs not replaced) pending. I look forward to your urgent response. Thank you Genesis Tangong NchopereuBsc. Computer Engineering | Ashesi University1 University Avenue, Berekuso | PMB, CT3 Cantonments, Accra GhanaT: +233 560 223 065genesis.nchopereu@ashesi.edu.ghwww.ashesi.edu.gh ", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "WARREN LIBRARY: light in ground/first floor women's washroom cubicle ", "Message": "not workingDear colleagues (please pass to Facilities) This is to let you know that the lights in one of the cubicles in the ladies washroom on the ground/first floor of the Warren Library are not working.   Could an electrician come to check? Thanks   Regards  Nina Nina ChachuHead Librarian, Ashesi University CollegeLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh/   | Repository https://air.ashesi.edu.gh/", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "FLICKERING LIGHT IN ROOM 215A WARREN LIBRARY", "Message": "Dear colleagues (please pass to Facilities) Can an electrician come and check a flickering light in my office - 215A in Warren Library? Also it seems the light switch in Room 301 in Warren Library doesn't seem to be working properly Thanks   Regards  Nina Nina ChachuHead Librarian, Ashesi University CollegeLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh/   | Repository https://air.ashesi.edu.gh/", "Class": "1"}, {"From": "Zeina Kowalski <zeina.kowalski@ashesi.edu.gh>", "Subject": "Projector Request", "Message": "Dear Patience, As per our phone conversation, the Admissions team will like to request for a projector to use off-campus from Wednesday 28th November to Monday 3rd December. Mercy will pass by your office shortly to pick it up. Thank you. Kind Regards, Zeina KowalskiSenior Admissions OfficerAshesi University1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Email: zeina.kowalski@ashesi.edu.ghTel: +233-302-610-330 ext 1027| Cell: +233- 50 131 8961Ashesi: Website | Twitter | Facebook |YouTube | Google+  ", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Missing Wallet", "Message": "Dear All, Anyone who has come across a brown wallet containing ID cards and money for William Annoh should kindly return it to him or the HR office. It will be deeply appreciated if everyone kept an eye out for it. Best regards,Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "1"}, {"From": "Hostel Coordinators <hostels@ashesi.edu.gh>", "Subject": "Hostel electrical issues", "Message": "Hello, I hope this mail finds you well.Please find attached some current problems in the hostel. Thank you RegardsSuala ", "Class": "1"}, {"From": "Christopher Zanu <christopher.zanu@aucampus.onmicrosoft.com>", "Subject": "Air Condition in the Cave", "Message": "The air condition to the far end of the cave leaks when it is on. I think it should be checked on.   Get Outlook for Android ", "Class": "1"}, {"From": "Benjamin Kusi <benjamin.kusi@aucampus.onmicrosoft.com>", "Subject": "Electrical faults in Lab 222", "Message": "Hello,        Hope this email finds you well.  The extension boards in lab 222 are faulty and bending please. Attached are two images of the extension board.  Thank you Benjamin.", "Class": "1"}, {"From": "Christiana Amehia <christiana.amehia@aucampus.onmicrosoft.com>", "Subject": "NO ELECTRICITY IN NEW HOSTEL(A - C)", "Message": "Hello,Please the lights are off and the generator is not working in the new hostel. This situation has also affected the WI-Fi. Can you please come to our aid so that this situation can be solved. Thank you ", "Class": "1"}, {"From": "Bridgette Abakah <babakah@ashesi.edu.gh>", "Subject": "Doctor on campus", "Message": "Dear All,Hope this finds you well,Kindly be informed that there will be a doctor on campus for consultation tomorrow (14/2/2014) from 11 am to 4pm.  All who need private sessions with him should send an email in reply to book a session.RegardsBridgette  Bridgette Abakah|Nurse Administrator- Ashesi Health Services  Ashesi University College 1 University Ave, Berekuso-E/R PMB CT 3, Cantonments, Accra GHANA Tel: 0501331668, 0248883211 babakah@ashesi.edu.gh  ", "Class": "1"}, {"From": "Hostel Coordinators <hostels@ashesi.edu.gh>", "Subject": "Door Handle", "Message": "Hello Door Handle spoilt at hall 6, Room 603. Thanks Regards", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "March Staff 2018", "Message": "Dear All, Kindly note that March 2018 Staff meeting will be held on Tuesday, 13th March, 2018. IT will be taking us important updates concerning ONE DRIVE. In relation to the updates, Jenipher will be sending an email to schedule every department for customized sessions. Regards,Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "1"}, {"From": "Teni Agana <teni.agana@ashesi.edu.gh>", "Subject": "Light bulbs dead", "Message": "Dear Support Center, Good evening and I hope this email finds you well. Some of the bulbs in hall F hostel are not dead.Room F10Room F4Room F5Room F2Thank you and I hope to hear from you soon.  Get Outlook for iOS", "Class": "1"}, {"From": "Sadat Issah <sadat.issah@ashesi.edu.gh>", "Subject": "Sink issues in washroom", "Message": "Hello support center team,  I found this sink in this state in Hall H at block C. The room numbers are H11 and H12. Thank you.  Regards  Sadat Issah        Get Outlook for Android ", "Class": "1"}, {"From": "Warren Library <warrenlibrary@ashesi.edu.gh>", "Subject": "Water issue", "Message": "Dear Support Centre, For your information, there is no water running through the taps of the library washrooms. ThanksThe library team.  ", "Class": "1"}, {"From": "Richard Ekumah <richard.ekumah@ashesi.edu.gh>", "Subject": "Drainage Issue in Hall 7", "Message": "Dear sir/madam, Good morning and I trust this mail finds you well. Kindly note that the bathrooms between rooms 705 and 706 have a problem with the drainage there. After bathing, the water is unable to drain well.  Thank you.  Best regards, Richard EkumahHall 7 RA", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "WATER PRESSURE IN WARREN LIBRARY IS LOW", "Message": "Can someone check the water pressure in the Warren Library washrooms? It seems to me that it is rather low, but maybe I am mistaken?   Regards  Nina Nina ChachuHead Librarian, Ashesi University CollegeLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh ", "Class": "1"}, {"From": "Immanuella Duke <immanuella.duke@aucampus.onmicrosoft.com>", "Subject": "No shower curtains in bathroom close to 207/208", "Message": "Good day, I hope this email finds you well. Please we need shower curtains in the bathroom close to rooms 207/208 (Efua Sutherland) Kindly assist.   Warm Regards, Immanuella Duke Computer Science Ashesi University College  Phone: +233555650357 ", "Class": "1"}, {"From": "Angela Owusu Ansah <aansah@aucampus.onmicrosoft.com>", "Subject": "Portable whiteboad", "Message": "Dear Ashesi Support Centre,I would like to request a portable whiteboard for my office RB 214.Kind regards,Angela Angela Owusu-Ansah, Ph.D.Provost and ProfessorAshesi University, 1 University AveTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Office Cell: +233-501-331-618Personal Cell: +233-541-880-000Email: aansah@ashesi.edu.gh Ashesi: Website | Twitter | Facebook  ", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Transportation to Gallery1957 (Kempinski Hotel)", "Message": " Dear All,Kindly note that the 5pm bus to CTK will continue to Gallery1957 at Kempinski Hotel tomorrow , 12th April, 2018 for Dr. Oduro-Frimpong's exhibition. The exhibition begins at 6pm to 10.30pm.  This is will only a drop-off and you would be required to find your way home after the exhibition. Here is a blurb below: \"Almost True\"The value of satire is often seen to only entertain. However, it is a route to highlight sensitive social, political, religious and economic concerns. Acting as an alternate narrative, satirical work broadcasts the otherwise unmentionable. Almost True highlights appreciation for satire on a deeper level, presenting it as an authentic genre within contemporary art, as well as a source of intellectual value which understands society. The title ironically implies the visual narratives presented in the exhibited works are non-truths, when in fact they are exaggerated recordings of the artists’ personal experiences.Regards, Aba K. Enyimayew| Director-Human ResourcesAshesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/  ", "Class": "1"}, {"From": "Munyaradzi Madzoma ", "Subject": "Broken Door Handle Of Motoulsky Hall Male Washroom.", "Message": "Dear Support Centre Upon visiting the male washroom in the Norton Motoulsky hall , I noticed that the inside Handle is broken. That is one of the attached part got detached from the main door. This has also loosened the other part of the handle that only remains attached to the door , to the extend that , in a short period of time the handle may completely come off.  Regards,Munyaradzi Madzoma Electrical and Electronic Engineering Ashesi University c20211 University Avenue, Berekuso Eastern Region |PMB CT 3 Cantonments Accra, Ghana Email:munyaradzi.madzoma@ashesi.edu.gh|munyadzomex@gmail.com| Cell: +233550991306|+263775730919 ", "Class": "1"}, {"From": "Emmanuel Ntow <emmanuel.ntow@ashesi.edu.gh>", "Subject": "Leakages in the Registry", "Message": "Dear Support, Our office has two leakage points and as we speak if have a rubber bowl containing the water. Please report this to Casper. BR,Emmanuel Obeng NtowRegistry Officer/ Ashesi University CollegePMB CT 3, Cantonments, Accra-Ghanahttp://www.ashesi.edu.ghTel:+233(302) 610 330 Ext: 1085Mob: +233(024) 2077289emmanuel.ntow@ashesi.edu.gh ", "Class": "1"}, {"From": "Rebecca Awuah <rawuah@ashesi.edu.gh>", "Subject": "student club email request", "Message": "Hello, I am the patron of the new Ashesi Facts club. The club would like to get an email address to facilitate its work. Harold Awuah-Darko and Eugen Parker are the founders of the club. Thank you,Rebecca Awuah Rebecca AwuahMathematics LecturerAshesi UniversityBerekuso, Ghana +233 30 261 0330www.ashesi.edu.gh ", "Class": "1"}, {"From": "Violet Naisubi <violet.naisubi@ashesi.edu.gh>", "Subject": "No hot water", "Message": "Greetings, Hope this email finds you well. Hall G has no hot water in the showers for two days now. Thank you.  Regards,Edith Violet NaisubiHall G RA", "Class": "1"}, {"From": "Benedict Quartey <benedict.quartey@aucampus.onmicrosoft.com>", "Subject": "Transportation Payment", "Message": "Dear Team,  Hope this finds you well. Please be informed that I payed Ghc 50 into the transportation mobile money account. Kindly find details below:  Payment Reference : 4182924564 Customer Id : AUNS0002  Kind regards Benedict Quartey  ", "Class": "1"}, {"From": "John Randy Nani <jnani@ashesi.edu.gh>", "Subject": "Poor lecture room experience", "Message": "Hello,Please there is a problem with the projector at lab 221.Some parts of projected material are not clearly visible Thank you.  John Randy Nani +233501384226 ", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "RSVP For Retreat", "Message": "Dear All, Kindly note that the Ashesi Employee retreat is organized once every two years and it is required  for all full-time employees to attend. The retreat is recognized as a campus-wide employee  professional development strategy. This year’s theme “ We Are Ashesi” is around the importance of how we can develop our work as a team and how we can achieve our best as a united community. Kindly fill the form below to help us make arrangements for the venue for our retreat and room bookings. The deadline for filling out the form is 12th March, 2018. https://forms.office.com/Pages/ResponsePage.aspx?id=9WHGbQzuDka9tANK6z82cKGAWeAEKclMlg6Oypy9mRhUQ0ZaQkVQU0FNMks4QVRaQVFTSUszVUtQVS4u  We will be able to confirm the venue after we note the number of employees we will need to cater for. Best regards,  Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/  ", "Class": "1"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "On going Tiling Works in Warren Library and Computer Lab 221", "Message": "Dear All,  This is to inform you of tiling works going on at the upper deck of Warren Library and at Computer Lab 221.  We crave your indulgence as these works are likely to create noise from the tools and  machines being used.  It is expected that the works will be completed by tomorrow and both areas will be ready for full use from Monday 18th June.  Thank you all for your kind cooperation.  Kind regards,  Dzifa Nuer   Get Outlook for Android ", "Class": "1"}, {"From": "Suzanne Buchele <sbuchele@ashesi.edu.gh>", "Subject": "DSTV in guest house not working", "Message": "I think the bill for the DSTV in the faculty guesthouse needs to be paid. If that’s not it, then there is something else wrong.Thanks, Suzanne Suzanne F. Buchele, Ph.D.Provost and Associate ProfessorAshesi University College, GhanaTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Cell: +233-501-331-618Email: sbuchele@ashesi.edu.gh ", "Class": "1"}, {"From": "Mathew Ndekudugu <Mathew.Ndekudugu@aucampus.onmicrosoft.com>", "Subject": "Student ID replacement", "Message": "Kindly find attached my receipt to replacement of my ID card. Thank you   Mathew Ndekudugu        Sent from my iPhone  Sent from my iPhone", "Class": "1"}, {"From": "Kezia Acquah <kezia.acquah@ashesi.edu.gh>", "Subject": "Request for Id Card", "Message": "Dear Sir/Madam,  I humbly wish to request for an id card replacement. Attached is the receipt of my payment.  Name: Kezia Kyiraah Acquah Id Number:72242020  Thank  Keziah Kyiraah Acquah Business Administration 2020 | Ashesi University Yaa W. Fellow | Unilever Campus Brand Ambassador Career Peer Advisor '20 kezia.acquah@ashesi.edu.gh |+233540744172", "Class": "1"}, {"From": "Miriam Abade-Abugre <mabugre@aucampus.onmicrosoft.com>", "Subject": "water coming in to science lab", "Message": "Hello,          Please we have water coming in through the windows into the science lab (101). Kindly help us out now.  Regards, Miriam.", "Class": "1"}, {"From": "Job Mwesigwa <job.mwesigwa@ashesi.edu.gh>", "Subject": "Dirty water flowing in shower rooms", "Message": "Hello team,  The new hostel block B boys side bathrooms showers have dirty water flowing in the showers. Job. Get Outlook for iOS", "Class": "1"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "No soap in 206-W3 washroom", "Message": "  -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science Department Ashesi University College1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: akorsah@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1029 ", "Class": "1"}, {"From": "Heather Beem <hbeem@ashesi.edu.gh>", "Subject": "projector quality", "Message": "Hello,   The projectors in the Science Lab and classroom 115 are very dim. Can  some maintenance/repair please be done on them? It's very difficult to  present any content on the screen for the students to see.   Thank you,   Heather    ", "Class": "1"}, {"From": "Amiineh Tabbicca <amiineh.tabbicca@aucampus.onmicrosoft.com>", "Subject": "Water not flowing in Ladies Washroom", "Message": "Dear Support Centre, Kindly note that water is not flowing in one of the ladies washrooms at the library. The water closet does not fill up with water when attempting to flush.  Thank you. Regards, Amiineh Kizita TabbiccaNational Service Library Faculty InternC2018 II Business AdministrationAshesi University   ", "Class": "1"}, {"From": "Nana-Kwabena Parker <Nana-", "Subject": "Summer Housing Fees", "Message": "Good day, Please how much would on-campus housing cost for the 6 week summer school period? Thank you   Best regards, Nana Kwabena Ofori Parker  Bsc. Computer Engineering | 2021 ", "Class": "1"}, {"From": "Desmond Mensa <Desmond.Mensa@aucampus.onmicrosoft.com>", "Subject": "New ID", "Message": "Hello,  Please attached to this email is my receipt for a new student ID.    Kind Regards,  Mensa Desmond -Jesse. Ashesi University College | Electrical and Electronic Engineering. Research and Development | Future of Africa. Director | iCare Foundation. Academic Representative | Ashesi University College. Ambassador | Future Africa. Ambassador. | Students for A Healthy Africa (SAHA). Fellow | Under The Baobab Tree Fellowship. Scholar | Will Mountain Initiative.  E: desmond.mensa@ashesi.edu.gh T: +233(0)203233085 | +233(0)576763103   \"Whatever You Are, Be A Good One. \"  ", "Class": "1"}, {"From": "Rejoice Hormeku <rejoice.hormeku@ashesi.edu.gh>", "Subject": "Tap in Library not Flowing", "Message": "Dear Support Centre,                 I would like to inform you that the taps in the library restrooms are not flowing. Could you please let someone attend to it .  Thank You.Rejoice Hormeku.", "Class": "1"}, {"From": "Ayebilla Avoka <ayebilla.avoka@ashesi.edu.gh>", "Subject": "Wangari Mathai hall issues", "Message": "Dear Support Centre,Wi-Fi in the above mentioned hall has been down over the weekend. We will appreciate it if you could do something about it. The following issues are specific to Hall B.The curtain in the washroom for room B7 is short and water splash out to flood their room anytime they use it.•Hall members want to have shared cleaning materials(mob bucket, mob, broom, detergent) in their quads. These materials will be used for cleaning the common areas.•It will be good to have door mats for each room to help members keep their rooms clean.•we need to have access to the trash bags(lining for trash cans) in the halls so that we can empty the trash cans over the weekend.•I hope these issues will be given the needed attention?Kind regardS,Ayebilla AvokaRA, Hall B  ", "Class": "1"}, {"From": "Christopher Zanu <christopher.zanu@aucampus.onmicrosoft.com>", "Subject": "Light at student hangout area", "Message": "This is to report that one of the fluorescent light tubes together with its frame has come off . This is at the student hangout opposite the library.       Get Outlook for Android ", "Class": "1"}, {"From": "Patrick Awuah <pawuah@ashesi.edu.gh>", "Subject": "leaking water pump", "Message": "The water pump behind Apt Hall (facing the mechanical engineering lab) is leaking. ---Patrick G. Awuah, Jr.Founder and President, Ashesi University Tel: +233 302 610 330 OR +233 302 974 980Ashesi: Website | Twitter | Facebook  ", "Class": "1"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "ID Card Request", "Message": "Dear Anna, I will like to make ID card requests. Kindly find details below: Name: Patience Adu-Kyerewah1. Job Title: Support Center and Data Entry OfficerDepartment: IT Name: Muriel Mercy Nartey2. Job Title: MIS Support OfficerDepartment: IT Please find their pictures attached. Regards, Theresa Dei DzanieHR Coordinator│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "1"}, {"From": "Charles Dzokoto <charles.dzokoto@aucampus.onmicrosoft.com>", "Subject": "Drainage Problem-- Washroom of Room 601 and 602", "Message": "The Support Centre,  Kindly accept this message as a complaint on the drainage system of the washrooms of room 601 and 602. The shower has been flooded since Friday.   Sorry for the delay in reporting, I was just informed.  Regards, Charles   Get Outlook for Android ", "Class": "1"}, {"From": "David Sasu <david.sasu@aucampus.onmicrosoft.com>", "Subject": "BROKEN CHESS PIECE AT THE ENGINEERING BUILDING", "Message": "Hello, Please one of the black chess pieces on the chess board at the engineering building is broken.    Sincerely,David Sasu. ", "Class": "1"}, {"From": "Enoch Agonyo <eagonyo@ashesi.edu.gh>", "Subject": "Roof Leakage", "Message": "Hello support, There is leakage in the roof of Romm 205-C engineering.  RegardsEnoch Kofi AgonyoPrograms Coordinator | Engineering Department Ashesi University CollegePMB CT 3, Cantonments, Accra-Ghanahttp://www.ashesi.edu.ghTel:+233(302) 610 330 / 0302974980 Ext: 1091 Mob: 024 2516353  eagonyo@ashesi.edu.gh    ", "Class": "1"}, {"From": "Emmanuel Nimo <emmanuel.nimo@aucampus.onmicrosoft.com>", "Subject": "Strong Pungent Smell", "Message": "Dear Support Team,  I would like to report that there’s a strong scent coming out of a pipe or gutter found between the basket ball court and Walter Sisulu Hall 8. Please, kindly respond to this mail as the members of the hall are not finding it easy sleeping in their rooms. Thank you.", "Class": "1"}, {"From": "BusPlan <noreply@ashesi.edu.gh>", "Subject": "Refund Receipt", "Message": "Ashesi BusPlanHi Casper Annie,Your BusPlan account has been debited for GHC 3.00  Your current balance is GHC 0.00Check BalanceRegards, Ashesi BusPlan supportcentre@ashesi.edu.gh ", "Class": "1"}, {"From": "Sampson Nani <Sampson.Nani@aucampus.onmicrosoft.com>", "Subject": "Defaced new boards.", "Message": "Please the new board in room 116 is heavily defaced with markers making it impossible for writings on them to be seen. It’s the same story for the one in lab 222 as well. Sent from Mail for Windows 10 ", "Class": "1"}, {"From": "Isaac Coffie <isaac.coffie@aucampus.onmicrosoft.com>", "Subject": "Room bulb not working", "Message": "Dear Support Centre Team, I trust this email finds you well. This is to bring to your notice that our room bulb has since the past week stopped working. We have reported this issue to the hostel lobby and nothing has been done to remedy the situation. I would appreciate if you could help us get our room bright. Thank you. Sincerely,Isaac Coffie Ashesi University College Management Information System | C'2018 Unilever Brand Ambassador Phone: +233 (0) 548 771 108 Email: isaac.p.coffie@gmail.com ", "Class": "1"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "206-W3", "Message": "Hello,Just reporting that there’s no toilet paper in the right cubicle of 206-W3.  It’s been like that since yesterday. Thanks,Ayorkor  -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science Department Ashesi University College1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: akorsah@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1029 ", "Class": "1"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "transport registration", "Message": "Hi I need to register my transport idMy card is: 13169999Name Billie (Florence) RichardsonTransaction id: 4198909188Amount paid 120 Ghc Thank you ", "Class": "1"}, {"From": "Muhammad Khan <Muhammad.Khan@aucampus.onmicrosoft.com>", "Subject": "Washroom lights and drainage issue (E11/12)", "Message": "Good morning,  I hope you are well. I wanted to inform you that the lights and drainage system in our washroom is not working. The sink is not draining and it's quite difficult for us right now. I have lodged a complaint twice at the reception but the issue is still not resolved.Please Kindly help us in this matter.    Thank you,", "Class": "1"}, {"From": "Anita Boakye-Yiadom <anita.yiadom@ashesi.edu.gh>", "Subject": "Clock in Norton Motulsky B not working", "Message": "Good afternoon, Please, I would like to inform you that the battery in the clock in 207Motulsky B is no longer functioning. We would very much appreciate it if the battery was changed so that the clock functions well. Thank you very much. On behalf of the Welfare committee. Regards, Anita.  ", "Class": "1"}, {"From": "Cara <clam@ashesi.edu.gh>", "Subject": "Replacement Card", "Message": "Attached is my receipt for the replacement card. Thanks,Cara Lam", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "New Coffee Machine", "Message": "Dear All, Kindly note that there is a coffee machine in the Engineering kitchenette for all of us. There is some coffee to brew and a variety of tea flavours to choose from. This is a one-time supply which will require we all help restock as it runs out. Enjoy! Aba K. Enyimayew| Associate Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/  ", "Class": "1"}, {"From": "Immanuella Duke <immanuella.duke@aucampus.onmicrosoft.com>", "Subject": "Broken shower near rooms 205/206", "Message": "Good day, I hope this email finds you well. There's a broken shower in the bathroom close to rooms 205/206 (Efua Sutherland). Kindly assist us in fixing this.  Thank you.   Warm Regards, Immanuella Duke Computer Science Ashesi University College  Phone: +233555650357 ", "Class": "1"}, {"From": "Victor Ibeto <vibeto@aucampus.onmicrosoft.com>", "Subject": "Electrical Fault at the Library", "Message": "", "Class": "1"}, {"From": "Suzanne Buchele <sbuchele@ashesi.edu.gh>", "Subject": "Plumbing leak in guest house", "Message": "Hello, In our middle guest room in the faculty guest house there is a major leak in the sink. When you turn on the sink water, about ½ of it pours down the wall and onto the floor. Thanks,Suzanne Suzanne F. Buchele, Ph.D.Provost and Associate ProfessorAshesi University College, GhanaTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Cell: +233-501-331-618Email: sbuchele@ashesi.edu.gh ", "Class": "1"}, {"From": "Nana Ama Entsie <nentsie@aucampus.onmicrosoft.com>", "Subject": "Tap Not Running", "Message": "Dear Support, I would like to report that the tap in the kitchen upstairs is not running, hasn’t been flowing for the past 10 minutes. Thank you, Nana Ama EntsieExecutive Assistant to Academic AffairsAshesi University College1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: nentsie@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1030 | Mobile: +233 24 666 9416    ", "Class": "1"}, {"From": "Ayebilla Avoka <ayebilla.avoka@ashesi.edu.gh>", "Subject": "Lights out in Hall B", "Message": "Dear support Center, Hall B lights is been out for about 20minutes now.  Thank you. Ayebilla Avoka.", "Class": "1"}, {"From": "Patrick Awuah <pawuah@ashesi.edu.gh>", "Subject": "Leak in Radichel Hall Kiitchen", "Message": "There is a leak somewhere in the kitchen in Radichel Hall. The cleaners mopped up a lot of standing water from the floor this morning, but the water is back. Patrick ", "Class": "1"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "New Facilities Open for Use!", "Message": "Welcome back Everyone! We are excited to announce that two of our new facilities are open for use from today 27th August, 2018 to kick start the semester! There are however a few ongoing touch ups here and there, and ask that you kindly bear with us. To help you find your way around more easily, kindly take note of the following: The Research Building is the newly constructed building located just behind the King Engineering Building. Currently, it can be accessed through three (3) points, that is, from the staircase in front of the Bookshop, through the pathway leading up in front of the Mechanical Lab and through the exit door on the side of the Norton Motulsky Hall. The following lecture halls can be found within this building:1.  RB 100 which is the biggest of two (2) halls located on the first floor. When using the Bookshop entry point, this hall is on the left hand side. From the Norton Motulsky entry point, it will be the first lecture hall on your right.a.  RB 115 is also located on the ground floor and is the smaller of the two (2) halls. If you are coming through from the Bookshop, you will find this hall on your right whereas from the Norton Motulsky entry point, the hall will be the second one on the right.b.  RB 216 can be found on the second floor, just above RB 115. It is the only lecture hall on that floor.c.  The Wet & Dry Labs can also be found on the second floor.d.   The Fab Lab is located just before the Natembea Health Centre and has the following halls located within it:2.  Fab Lab 103 is located on the first floor on the left hand side through the main front entrance of the buildinga.  Fab Lab 203 is located on the second floor and can be found on the right hand side after ascending the stairs or exiting the lift.b. ", "Class": "1"}, {"From": "William Kojo Ocran <william.ocran@ashesi.edu.gh>", "Subject": "air-conditioner dripping water", "Message": "Hello, An air-conditioner in the library drips water any time it is turned on. It is located upstairs, to the left, as soon as you finish climbing up the staircase. The AC just above the light switches. Regards, William  Sent from Mail for Windows 10 ", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "WARREN LIBRARY: Large crack in window at back of first/ground floor of ", "Message": "Warren LibraryDear colleagues (please pass for Facilities) I believe that Facilities should be aware that one of the windows on the ground/first floor of the Warren Library has a big crack in it.  This was pointed out to me by one of the Security guys this morning.  I gather he did inform David Hiametu.   Regards  Nina Nina ChachuHead Librarian, Ashesi University CollegeLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh/   | Repository https://air.ashesi.edu.gh/", "Class": "1"}, {"From": "Amiineh Tabbicca <amiineh.tabbicca@aucampus.onmicrosoft.com>", "Subject": "LEAKING AIR-CONDITION AT THE LIBRARY", "Message": " Dear Sir / Madam, Trust you are well. Kindly be informed that one of the air conditions at the library is leaking.  Thank you.  Regards,  Amiineh Kizita TabbiccaNational Service Library Faculty InternC2018 II Business AdministrationAshesi University   ", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "AIR CONDITIONING EXTERNAL UNITS MAKING RATTLING NOISES ", "Message": "OUTSIDE WARREN LIBRARYDear all - please pass to Facilities One of the air-conditioning external units is making loud \"rattling\" noises outside the Warren Library. Can someone investigate whenever convenient? thanks  Regards  Nina Nina ChachuHead Librarian, Ashesi UniversityLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh/   | Repository https://air.ashesi.edu.gh/", "Class": "1"}, {"From": "Angella Nantambi <angella.nantambi@aucampus.onmicrosoft.com>", "Subject": "Leaking sink", "Message": "Hello Support centre, I hope this email finds you well. I am reporting on behalf of hall A that the washroom sink for room A9 and A8 is leaking. It was fixed yesterday but it has gotten worse now. The water is flooding up to the toilet area.  Also, the ceiling in the same washroom where the heater is, is wide open.  Thank you very much.  Best,Angella Nantambi. ", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "WARREN LIBRARY: Outside air-conditioning motors making weird noises", "Message": "", "Class": "1"}, {"From": "Emmanuel Yaw Manu Annor <yaw.annor@aucampus.onmicrosoft.com>", "Subject": "Bulb not working", "Message": " Hello,Please our bulb has not been working since the beginning of the semester although we have reported to the front desk several times.We would be grateful if it was fixedRoom:E8Hostel: Newest hostel(B2).Kind regards,Emmanuel.   Sent from my Samsung Galaxy smartphone.", "Class": "1"}, {"From": "Angela Owusu Ansah <aansah@aucampus.onmicrosoft.com>", "Subject": "AC not working", "Message": "Kindly assist me in repairing my AC in Research Building 214.Thank you. Angela Owusu-Ansah, Ph.D.Provost and ProfessorAshesi University, 1 University AveTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Office Cell: +233-501-331-618Personal Cell: +233-541-880-000Email: aansah@ashesi.edu.gh Ashesi: Website | Twitter | Facebook  ", "Class": "1"}, {"From": "Bryan Armah <barmah@aucampus.onmicrosoft.com>", "Subject": "Wet walls", "Message": "Dear support,   Please help resolve this at the support center.          Get Outlook for Android ", "Class": "1"}, {"From": "Caleb Fianu <Caleb.Fianu@aucampus.onmicrosoft.com>", "Subject": "Water Heater Complaint", "Message": "Good Day, Once again the water heater in Hall 5 has failed me. Please check on it.  Get Outlook for Android ", "Class": "1"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Update on Bus Schedules", "Message": "Dear all, It has come to our attention that, we mistakenly under-estimated the traffic to campus over this week. In light of this, we wish to inform you that, we will be reverting to our regular bus shuttle effective tomorrow, Tuesday, May 15th until further notice: 6.15am CTK-37-Shiashi-Atomic-Madina-Kitase route by Mr. Eric Tetteh McCarthy.1. 7:00am CTK-37-Shiashi-Atomic-Madina-Kitase route by Kenneth Amofah.2. 6:40am from KFC-Haatso-Aboum-Ashesi by Samuel Bansah.3. 7:10am from Haatso-Aboum-Atomic Roundabout routes, by Peter Akumasi.4. 5:10pm through Aboum through Atomic Junction, by Kenneth Amofah.5. 5:10pm from Ashesi through Kitase to Christ the King premise – Eric Tetteh McCarthy.6. 6:15pm from Ashesi to Atomic Junction to be driven by Samuel Bansah.7. 1:15pm – Regular schedule.8.  Kindly note the following:For, tomorrow, May 15th both the 7:00am and 5:10pm CTK-37-Shiashi-Atomic-Madina-Kitase will be driven by Mr. Acheampong (024 293 2241) using a white/green Coaster bus with registration No. GT 6762-14.•Besides, as a result of our bi-annual retreat, Ashesi will be opened for business on only Monday and Tuesday, May 21-22nd.  Work officially resumes the week of May 28th.• May I take the opportunity to apologized to all those who missed the bus this morning. Best regards,Anna.    ", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Faulty light bulb", "Message": "Dear Support, I have a faulty light bulb in my office which is flickering badly. Because I tend to receive confidential visits from employees, my windows and blinds are closed most of the time. This makes putting on the light important in my office but the flickering light is not very welcoming to visitors.  Thank you for your support as always. Regards,Aba", "Class": "1"}, {"From": "Edinam Akpokavie <edinam.akpokavie@ashesi.edu.gh>", "Subject": "Flickering fluorescent lights", "Message": "Hello, I am writing this email to report a problem in Room 111 which is a shared office by Kajsa and Kobby. The fluorescent lights in the room have a fault which is causing them to flicker. They would be very grateful if this problem could be attended to soon.  Thank you  Get Outlook for iOS", "Class": "1"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Shuttle Arrangements from Thursday, October 18 and 19th.", "Message": "Dear all, Kindly be informed that, the all-white bus with registration No. GT 1078-16, usually driven by Samuel Bansah has undergone its major maintenance servicing this afternoon and will be back next week. In line with this, the department has rented a white-purple Toyota coaster bus with registration No: GN 3738-18 to run the schedule indicated below both on Thursday and Friday, October 18-19 respectively: CTK-37-Shiashie-Okponglo-Atomic-Madina-Kitase routes at 7:05am and 5:10pm.•Name of Driver:  Victor Ntri•Phone No.: 024 502 0782• Please take note of the following changes in the bus schedule:Mr. Eric Tetteh McCarthy (024 278 0788) driving the white/purple coaster with registration No. GX 1834-17; will ply CTK-37-Shiashie-Okponglo-Atomic-Madina-Kitase route both at 6:15am and 5:45pm;1. Mr. Kenneth Amofah (054 418 1817), with car No. GT 6764-14 will drive the white and green coaster bus. He will be running the 6:40am and 6:00pm, KFC-Haatso-Atomic Roundabout-Aboum route.2. Mr. Peter Okwei (024 612 7843), using white-brown Coaster No: GX 1835-17, will ply his regular routes from KFC-Haatso-Atomic Roundabout-Aboum-Ashesi; both at 7:05am, 5:10pm and 8:00pm respectively.3. The afternoon schedule (1:15pm) remains unchanged.Thank you,Anna. ", "Class": "1"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "Blind missing in Room 204 and shortage of chairs", "Message": "Hello,I wanted to bring to your attention that one blind is missing in room 204 (in the back left corner). Also, the room seems to consistently have too few chairs in it, based on the class sizes of the classes scheduled here.  Could more chairs be added (perhaps add a row of chairs at the back, so that there are always enough chairs even when the room overflows).  I’m guessing that the number of chairs reduces because students move chairs to other classrooms in the engineering building which don’t have enough chairs.  Perhaps we can solve this problem by ensuring that all classrooms in the engineering building have more chairs than the size of the maximum class that is scheduled for those rooms.  The registry can probably provide information about the sizes of the classes that have been scheduled in those rooms. Thanks,Ayorkor   -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science DepartmentAshesi University College1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: akorsah@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1029 ", "Class": "1"}, {"From": "Hostel Coordinators <hostels@ashesi.edu.gh>", "Subject": "Broken sheds.", "Message": "Hello, Hope you are doing well, the shed inside the wadrope in room D11 is brokenAnd need to be fixed please, also the genset at the new hostel 2A , the keyIs broken and we don’t have a spar key to it , we need a new lock for thatParticular generator before someone takes the battery away. Best regard,Catherine.", "Class": "1"}, {"From": "Dinah Kotey Baidoo <dbaidoo@ashesi.edu.gh>", "Subject": "Lights out in the library", "Message": "Dear Support Centre,  For your information, the lights are out in the library.   Best regards  Dinah Koteikor Baidoo  Assistant Librarian  Ashesi University College  1 University Avenue, Berekuso -E/R  PMB CT3 Cantonments  Accra, Ghana.  Tel: +233 302 610 330  Cel: +233 208 197 049 / 246 808 671  Email: dbaidoo@ashesi .edu.gh / kutbelle@gmail.com  Website: www.ashesi.edu.gh      ", "Class": "1"}, {"From": "Sylvia Kunkyebe <skunkyebe@aucampus.onmicrosoft.com>", "Subject": "Staff Discount issues", "Message": "Hello, I just tried using my staff discount at essentials and I was told I have negative credit. I have not used the card prior to that. Please help me resolve it. My card number is AUE 00131 Regards,Sylvia Sylvia KunkyebeAssistant Director of Career ServicesAshesi UniversityBerekuso, Eastern Region. Tel: (+233) 302 610 330 Ext: 1066/ +233 302 974 980Cell: (+233) 50 155 0132Email: skunkyebe@ashesi.edu.ghAshesi: Website | Twitter | Facebook ", "Class": "1"}, {"From": "Selase Aku Tsiagbe <stsiagbe@aucampus.onmicrosoft.com>", "Subject": "broken door", "Message": "Dear support centre,This is to inform you about a broken door to the male ward. kindly help.Thank you.Selase Aku TsiagbeNursing Officer  |Ashesi Health Services 1 University Avenue, Berekuso , Eastern Region, Ghana.mobile no.0206373405:  0232470373. Email: stsiagbe@ashesi.edu.gh Health line: 0501331668", "Class": "1"}, {"From": "Kwame Osei <kwame.osei@ashesi.edu.gh>", "Subject": "Receipt for ID card", "Message": "  Get Outlook for iOS", "Class": "1"}, {"From": "Nana Ama Entsie <nentsie@aucampus.onmicrosoft.com>", "Subject": "Taps Not Flowing", "Message": "Dear Support, Kindly note that the taps in the main administration are not flowing currently. It would be appreciated if someone checked on this. Thanks, Nana Ama EntsieExecutive Assistant to Academic AffairsAshesi University College1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: nentsie@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1030 | Mobile: +233 24 666 9416    ", "Class": "1"}, {"From": "Victor Ibeto <vibeto@aucampus.onmicrosoft.com>", "Subject": "Missing Car Keys.", "Message": "Good morning everyone, I hope this email finds you well. There is a missing car key (Toyota car key with inscription “EH3LB” on it) found and brought to the library. Kindly come and identify it, should yours be missing. Regards, Victor Ibeto Library Assistant│Ashesi University College 1 University Avenue Berekuso E/R Tel: +233 (0)302610330 Ext: 1085 Phone: +233 (0)241799472 ", "Class": "1"}, {"From": "Eugene Jamu <eugene.jamu@aucampus.onmicrosoft.com>", "Subject": "Open Man Hole", "Message": "Good morning,   I am communicating to kindly ask if open man holes around the pavement from Big Ben to the new hostels can be covered immediately.   I'm afraid someone will fall into these especially at night since the holes are not covered. It's been open for a while now.   I almost fell into the pit a few minutes ago.   I hope this matter with be considered with urgency.   Regards,   Eugene Kudzai   Get Outlook for Android ", "Class": "1"}, {"From": "Chenelle Owusu <cowusu@aucampus.onmicrosoft.com>", "Subject": "Air-condition Not Working", "Message": "Dear Support, I wish to report that our AC in the adjunct office is not working again. It was fixed the last time but it’s not working again. Kindly let who is in charge come check for us.  Thank you Chenelle OwusuProject Assistant THE EDUCATION COLLABORATIVE Ashesi University | 1 University Road Berekuso Ghana. | PMB CT3, Cantonments | Accra Ghana | +233 (0)302.610330 | www.ashesi.edu.gh | info@ashesi.edu.ghCell phone: 0507247937 WhatsApp: +233265543235   ", "Class": "1"}, {"From": "Martey Laari <martey.laari@ashesi.edu.gh>", "Subject": "clogged sinks at Hall E", "Message": "Dear Support Centre Team, The sinks in the bathrooms shared by rooms E8 & E9 and E11 &E12 are currently clogged.  Please, the following issues are still not resolved (they were reported since last semester). E8 & E9; The washroom outer door is not locking. E11& E12; The washroom still gets flooded (we cannot find the source of the leak but it is suspected to leak from either the wall or the floor tiles).E11 & E12; The showerhead is spoilt. We are counting on your usual support and would be glad to see these issues fixed as soon as possible.  Thank you. Sincerely,Martey Laari. ", "Class": "1"}, {"From": "Nicholas Korblah Tali <ntali@ashesi.edu.gh>", "Subject": "Ceiling coming down", "Message": "Dear Support,   I wish to bring to your attention the following ussues: 1. Part of the ceiling in the mech lab is coming down and one power outlet has come off.  2. One power port has come off in the science lab too.  3. Only one air-condition is working in both the science lab and electronics lab.   Regards,   Nicholas   Get Outlook for Android ", "Class": "1"}, {"From": "Nina Chachu <nchachu@ashesi.edu.gh>", "Subject": "WARREN LIBRARY WASHROOMS: paper towel dispensers needed", "Message": "Dear colleagues - please pass to Facilities for consideration As you are aware the washrooms in the Warren Library all have hand dryers only, but no paper towel dispensers. We have noticed that quite a few students actually use the toilet rolls to dry their hands... which uses up a lot of these Can you consider installing paper towel dispensers in the future? Thanks  Regards  Nina Nina ChachuHead Librarian, Ashesi UniversityLocation:  1 University Avenue, Berekuso, E/RPostal:  PMB CT3, Cantonments, Accra, GhanaTel:  +233 (0)30 261 0330 OR  +233 (0)30 297 4980   | Fax:  +233 (0)30 261 0340Mob:  +233 (0)20 794 1869 or +233 (0)24 477 8229Email:  nchachu@ashesi.edu.gh     | Web  http://www.ashesi.edu.gh/   | Repository https://air.ashesi.edu.gh/", "Class": "1"}, {"From": "Teni Agana <teni.agana@ashesi.edu.gh>", "Subject": "Hot Water Issue", "Message": "Dear Support Center, Good evening and  I hope this email finds you well. Please, hall F downstairs has an issue with their hot water. It has not been working for some time now.  Thank you and I hope to hear from you soon.   Best Regards,Teni Agana.  ", "Class": "1"}, {"From": "Michael Quansah <mquansah@aucampus.onmicrosoft.com>", "Subject": "Money Found in the Bus", "Message": "Dear all,  A sum of money was returned from the bus, from this morning. Kindly come over to my desk for it, if it's yours.  Regards,  ------------Michael Fiifi QuansahAlumni and Public Relations OfficerAshesi University College1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Email: mquansah@ashesi.edu.ghTel: +233-302-610-330 ext 1038| Cell: +233- 50 150 9155Ashesi: Website | Twitter | Facebook |YouTube | Google+", "Class": "1"}, {"From": "Ayebilla Avoka <ayebilla.avoka@ashesi.edu.gh>", "Subject": "Maintenance Log for Hall B", "Message": " Dear Support Centre,Find attached, the maintenance report for Hall B.Thank you.Ayebilla Avoka", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "New Members of the Ashesi Community", "Message": "Dear All, Kindly find the details of new team members. Do warmly welcome them and support them in their duties where you can to help them settle in well.  Name: Dzifa NuerPosition: Facilities ManagerDepartment: Logistics and Facilities ManagementName: Akua NyarkoPosition: Communications OfficerDepartment: External RelationsName: Josephine ForsonPosition: Locum NurseDepartment: Health                         Best regards, Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/  ", "Class": "1"}, {"From": "Yesmin Alhassan <yesmin.alhassan@aucampus.onmicrosoft.com>", "Subject": "Hall F - issues", "Message": "Hello Team, Thank you very much. Our heaters are working now so we have hot water flowing now. Other issues The bulb in the bathroom of F9 and F7 is not functioning.•The shower head of F2 is off.•The wifi in F9 is not working.• Thank you Kind Regards, Yesmin Kofigah AlhassanResident Assistant Business Administration | C2019Ashesi University College1 University Avenue, Berekuso - E/R PMB CT 3, Cantonments, Accra, Ghana  Mob: +233-542-912-743Email: yesminkalhassan@gmail.com | yesmin.alhassan@ashesi.edu.gh ", "Class": "1"}, {"From": "Job Mwesigwa <job.mwesigwa@ashesi.edu.gh>", "Subject": "No Power at the New Hostel", "Message": "Hello Team, There is no power in the new hostel Regards,Job Mwesigwa ", "Class": "1"}, {"From": "Teni Agana <teni.agana@ashesi.edu.gh>", "Subject": "Light bulbs in rooms", "Message": "Dear Support Centre, Good afternoon and I hope this email finds you well. Please most of the light bulbs in Hall F are not working. Below are the list of roomsFlF7F9F10F11 Thank you and I hope to hear from you soon. Get Outlook for iOS", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "", "Message": "", "Class": "1"}, {"From": "Steven W. Buchele <swbuchele@ashesi.edu.gh>", "Subject": "The pipe is not flowing", "Message": "There is no water.   Get Outlook for Android ", "Class": "1"}, {"From": "Maureen Basemera <maureen.basemera@aucampus.onmicrosoft.com>", "Subject": "Water crisis", "Message": "Good day, Currently there is a water crisis in the hostels. Can they help us out .  Regards,Maureen Molly Get Outlook for iOS", "Class": "1"}, {"From": "Esther Afoley Laryea <ealaryea@ashesi.edu.gh>", "Subject": "Multiple charges bus plan", "Message": "Dear support centre,  I would be grateful if the multiple charges on my busplan will be rectified. Please find the dates of the multiple payments below to facilitate reversal.  27/09/18 11/10/18 18/09/18- 7 times instead of 2 14/09/18  Regards,  Esther.   Get Outlook for Android ", "Class": "1"}, {"From": "Yesmin Alhassan <yesmin.alhassan@aucampus.onmicrosoft.com>", "Subject": "Maintenance Report", "Message": "Hello Team, Please find an attached copy of Hall F maintenance log sheet. Thank you.   Kind Regards, Yesmin Kofigah AlhassanResident Assistant Business Administration | C2019Ashesi University College1 University Avenue, Berekuso - E/R PMB CT 3, Cantonments, Accra, Ghana  Mob: +233-542-912-743Email: yesminkalhassan@gmail.com | yesmin.alhassan@ashesi.edu.gh ", "Class": "1"}, {"From": "Emmanuel Nimo <emmanuel.nimo@aucampus.onmicrosoft.com>", "Subject": "Kitchen socket not working", "Message": "Dear Support Team,  I hope this mail finds you well. I would like to report that the sockets in the kitchen at Hall 8 top floor are all not working. Please, kindly respond to this issue because students want to keep their foods in the fridge. Thank you.", "Class": "1"}, {"From": "Suzanne Buchele <sbuchele@ashesi.edu.gh>", "Subject": "Water running", "Message": "There is a lot of water running down from the main gate area diwn the university main road. -Suzanne   Sent from my Windows Phone", "Class": "1"}, {"From": "Nicholas Korblah Tali <ntali@ashesi.edu.gh>", "Subject": "Damaged chairs", "Message": "I'm writing this email to report on damage to some of the chairs in the Engineering Mechanical Lab. Currently, six of the newer chairs in the Engineering mechanical lab have their seats detached from the frame.   Regards  Nicholas   ", "Class": "1"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "Blocked toilet (206-W3)", "Message": "Hello Support Centre,I would like to report that the WC in the cubicle on the right in 206-W3 appears to be blocked and not flushing properly. Best regards,Ayorkor  -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science Department Ashesi University College1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: akorsah@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1029 ", "Class": "1"}, {"From": "Gabriel Odu Jnr <godu@ashesi.edu.gh>", "Subject": "Light Bulb in the IT office", "Message": "Hello Support Centre,I will like to report a faulty light bulb in the IT office. Kindly assist please. Best regards. -----------------------------------------------Gabriel O. Jnr.  | Network Security OfficerAshesi University1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAE:  1065godu@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "1"}, {"From": "Suzanne Buchele <sbuchele@ashesi.edu.gh>", "Subject": "Animal in our ceiling", "Message": "Hello, it seems some animal has made its home in our ceiling, we can hear it moving around all over the house.Also, please note the sink in the middle bedroom still leaks badly (you have to let the water run for a minute or so for it to happen).Thanks, Suzanne Suzanne F. Buchele, Ph.D.Provost and Associate ProfessorAshesi University College, GhanaTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Cell: +233-501-331-618Email: sbuchele@ashesi.edu.gh ", "Class": "1"}, {"From": "Yesmin Alhassan <yesmin.alhassan@aucampus.onmicrosoft.com>", "Subject": "Leaking toilet", "Message": "Hello Team, Please the toilet of F6 and F7 is leaking. Please, this needs urgent attention. Thank you.   Kind Regards, Yesmin Kofigah AlhassanResident Assistant Business Administration | C2019Ashesi University College1 University Avenue, Berekuso - E/R PMB CT 3, Cantonments, Accra, Ghana  Mob: +233-542-912-743Email: yesminkalhassan@gmail.com | yesmin.alhassan@ashesi.edu.gh ", "Class": "1"}, {"From": "Rebecca Awuah <rawuah@ashesi.edu.gh>", "Subject": "AC leaking", "Message": "Hello Ashesi Support, An AC at the front of the MPR is leaking. Regards,Rebecca", "Class": "1"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Update On Immigration Processes", "Message": "Hello Everyone, I hope you are all having a good day. Kindly be informed that new dates for the immigration processes will be communicated to you all soon. Do exercise patience and we do apologize for any inconveniences caused. If you have any questions or concerns, do not hesitate to pass by ODIP-Radichel 207 to ask or you can send an email as well. Sincerely, Benardine Holdbrook GhansonDiversity and Inclusion OfficerOffice of Diversity and International ProgramsAshesi University 1 University Avenue Berekuso E/R Tel: +233 (0)302610330  Ext: 1056Email:bghanson@ashesi.edu.gh  From: Benardine Holdbrook Ghanson  Sent: Tuesday, September 18, 2018 2:50 PM To: Ashesi Community <AshesiCommunity@ashesi.edu.gh> Cc: Office of Diversity and International Programs <odip@ashesi.edu.gh> Subject: Postponed: Immigration Regularization-Ghana Card (Non-Citizen ID) and Residence Permit Importance: High Hello Everyone, I hope this email finds you all well. Kindly note that the date for immigration regularization process has been changed till further notice. New dates will be communicated with you in due time.", "Class": "1"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "Ongoing Carpentry Works", "Message": "Good morning All, There is ongoing carpentry work in  Room 103 (Radichel Building) for which the drill is being used. This should take about 30 minutes. Apologies for the inconvenience and late notice. Kind regards, Dzifa Nuer", "Class": "1"}, {"From": "Isaac Coffie <isaac.coffie@aucampus.onmicrosoft.com>", "Subject": "Air Conditioner Not Working", "Message": "Hello All, I write to inform you that two (2) ACs in the Norton Motulsky lecture room (207B) are no longer functioning.  Regards, Isaac Coffie Faculty Intern: CS DepartmentAshesi UniversityCell: +233 (0) 548 771 1108 email: isaac.coffie@ashesi.edu.gh  \"Learning never exhausts the mind\" -- Leonardo Da Vinci ", "Class": "1"}, {"From": "Angela Owusu Ansah <aansah@aucampus.onmicrosoft.com>", "Subject": "Lights Leonard House", "Message": "Please assist with the following at Leonard House. The main street light in the driveway of Leonard House is out, and has been for some time.  Without that light, outside of Leonard House is pitch dark. Kindly replace the driveway streetlight bulb or repair. In the meantime, I will have to keep the outside lights of Leonard House on because I work till after 6pm most days.1.  Please replace the front door corridor light in Leonard House which is also out. That is, the one you can immediately turn on when you open the door. 2. Thank youAngela Angela Owusu-Ansah, Ph.D.Provost and ProfessorAshesi University, 1 University AveTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Office Cell: +233-501-331-618Personal Cell: +233-541-880-000Email: aansah@ashesi.edu.gh Ashesi: Website | Twitter | Facebook  ", "Class": "1"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "No soap in washroom 206-W2", "Message": "I would like to bring the issue indicated in the subject line to the attention of the operations team, please. Thanks,Ayorkor  -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science Department Ashesi University1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: akorsah@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1029 ", "Class": "1"}, {"From": "Steven W. Buchele <swbuchele@ashesi.edu.gh>", "Subject": "AC in Adjunct Faculty Office in Engineering not working", "Message": "Just last night the AC stopped working.  For the past week when I have come in, the AC has been set at 16.  I was often the last to leave and left it at 25 before I left the office, so I know it wasn't left that way.  Also the windows we usually found open too.   I don't know what happens in that office after hours, but it should be locked at 5pm.    Rev. Steve Buchele | Ashesi University College1 University Ave, Berekuso E/R PMB CT 3, Cantonments, AccraGHANAM:+233 54 828-3465 ", "Class": "1"}, {"From": "Yesmin Alhassan <yesmin.alhassan@aucampus.onmicrosoft.com>", "Subject": "RA report", "Message": "Hello Team,  Please there is a problem with the shower in F1. The shower head is off. Thank you.   Kind Regards, Yesmin Kofigah AlhassanResident Assistant Business Administration | C2019Ashesi University College1 University Avenue, Berekuso - E/R PMB CT 3, Cantonments, Accra, Ghana  Mob: +233-542-912-743Email: yesminkalhassan@gmail.com | yesmin.alhassan@ashesi.edu.gh ", "Class": "1"}, {"From": "Owusu-Banahene Osei <Owusu-", "Subject": "Financial Aid", "Message": "Hello Ashesi Support Center,   A year ago, when I applied to Ashesi, I didn't apply for scholarship probably because I was ill informed about it. A year on and the financial strain on my family is becoming more and more visible. It's become hard for me to watch it all pan out and three more years could have crippling effect.  I have already paid next semester's tuition in full but would like to know if continuing students are eligible to receive any degree of financial aid.   Regards,  Owusu-Banahene.     Get Outlook for Android   ", "Class": "1"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "Leaking Roof in Career Center", "Message": "Good Morning, I will like to formally lodge a complaint about a leak in the roof in the Career Center. Due to this, water splashes from the roof onto a working desk in the office when it rains (as is the case this morning) which is impeding our work. I will appreciate it if this can be sorted out as soon as possible. Kind RegardsAbigail Welbeck Associate Director of Career ServicesAshesi UniversityTel: (+233) 302 610 330 Ext: 1074Email: awelbeck@ashesi.edu.gh ", "Class": "1"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Ashesi Transport Arrangements", "Message": "Dear All, Kindly note that  all concerns about  bus schedules, arrangements and queries are to be directed to the office of Logistics and Facilities Management effective today, 15th February, 2018. Do contact Anna Reimmer for all information regarding Ashesi buses and vehicles. HR will no longer be handling Ashesi vehicle-related issues. Please adhere to this directive to ensure processes are seamless. Best regards, Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "1"}]