[{"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Feedback: Meet the Execs Panel Discussion", "Message": "Dear All, Following our panel discussion on Wednesday, 12th September, 2018, we discussed the following (Thank you Kaneisha) : Ashesi’s Vision: began in 2012 with a projected end in 2022.The campus master plan includes 100 acres with a North and South campus. We currently occupy South campus. Changes in plans and infrastructure were discussed. Ashesi’s Programs: Determined needs based on high school students, needs in corporate Ghana, and the interests of the donor-base for particular programs. Needs and interest determined how Ashesi would move forward. Potential graduate programs in law/public policy, engineering, and liberal studies but interests shifted from the latter. Future plans were outlined. Ashesi’s People: Ashesi desired to be more pan-African. First years, the institution focused on gender balance. Additionally, Ashesi wants to lift the non-Ghanaian number of students to 30%, increase student scholarships, deepen the financial aid program, continue to preserve gender balance in the engineering program, and the establish a “brain-gain” fund or Ghanaians in the diaspora to help them pay off student loans in order to come home and live on the local salary scale. Ashesi’s Spaces: Ashesi recognized the need for an endowment. At present, Ashesi is campus rich and cash poor (i.e., infrastructure and scholarships are present but need an endowment or cash reserve). Plans for fundraising were outlined in detail.  We are happy with the questions that have come through after the panel discussion and looking forward to more. Kindly email your concerns and questions to execforum@ashesi.edu.gh. These will be answered and reviewed towards moving Ashesi forward. Regards,Aba K. Enyimayew| Director-Human Resources  Ashesi University1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, Accra", "Class": "2"}, {"From": "Jane Thomas <oluchithomas@gmail.com>", "Subject": "Job opening: Deadline Expired, Can I still apply?", "Message": "Hello Sir/Madam,  I write in response to the job opening for a wellness coach and cousellor at Ashesi University as forwarded to me by an Ashesi alumnus a few minutes ago.  Upon checking your website I realised the deadline for submission was the 4th of December 2017. Can I still send in my cover letter and accompanying resume for your perusal? I look forward to hearing from you.   Best regards,Jane Thomas ", "Class": "2"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Temporary Bus Arrangement for CTK-Legon-Madina-Kitase route for ", "Message": "Tomorrow, May 30thHello all, Please be informed that, Mr. Eric Tetteh McCarthy will be off duty for tomorrow, Wednesday, May 30th. The following arrangements will be in place to ensure smooth shuttle operations in his absence: A Toyota Coaster with registration No: GT 6762-14 will ply the CTK-37-Airport-Legon-Madian-Kitase-Ashesi routes for both morning and evening trips. It will be driven by Kwaku Acheampong on 0242-932-241.• We should revert to our regular schedule from Thursday, May 31st. Thank you,Anna.  ", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "Reminder: 2 Events You Don't Want to Miss this Weekend!", "Message": "Greetings,The following are two interesting (concurrent) events co-organized by the Ashesi D:Lab that you don’t want to miss this weekend. Accra UNICEF Hackathon: Friday 19th to Saturday 20th October 2018 – See details below•2-Day Maker Workshop: Design Innovation for Coastal Resilience: Friday 19th to Saturday 20th October 2018 – See details below• Be sure to sign up and participate! Good luck in your exams. Best regards, The Ashesi D:Lab Team  Accra UNICEF Hackathon APPLY HERE: http://bit.ly/accraunicefhackathon As part of the theme \"Partnership with Youth to Achieve the Sustainable Development Goals\" for the summit that aims at showcasing how young people are using technology to tackle social issues to help achieve the Sustainable Development Goals. This hackathon aims to develop solutions that employ child centered approach towards finding solutions to problems around SDGs 3 (Good Health & Well Being), 4 (Quality Education), 5 (Gender Equality), 6 (Clean Water & Sanitation), 8 (Decent Work & Economic Growth), 10 (Reduced Inequalities), and 13 (Climate Action). Seeking youth under 24 years old with any technical skills like website creation, graphic design, engineering, etc. Date: Friday 19th to Saturday 20th October 2018Venue: Workshed (Nungua Link Road Baatsona, 47 Spintex Rd, Accra)Time : 9:00am - 4:00pm Deadline: Wednesday, October 17th There will be concurrent hackathons in Kumasi and Tamale. UNICEF Ghana will join Youth Advocates Ghana in the 2nd edition of the African Youth SDG summit. The four (4) best ", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "#AshesiFavSpot: Ends at 5pm today!", "Message": "   **In T’Challa’s voice**:  “This ends today!” Hello all,This is a final call to all those who are participating in the #AshesiFavSpot Challenge. The competition ends at 5pm today! This is your final chance to show us where that favorite spot is. The surprises that we have in store for you…mmmmh!Remember to include the hash tag #AshesiFavSpot in your posts. PS: For those who have private accounts on Instagram kindly make them public or ‘Reply’ to this email with your submission. All the best. Regards,PR Committee   Wayne Jotham Gakuo | Bsc. Computer Science |Class of 2019 | Public Relations Committee Chairperson- Ashesi Student Council |I.T. Intern | Ashesi D:Lab Management Intern for Media |Ashesi University College, Ghana|wayne.gakuo@ashesi.edu.gh | +233 26927 9780| +254 7269 38259 ", "Class": "2"}, {"From": "Abdul Mahdi <amahdi@aucampus.onmicrosoft.com>", "Subject": "Honor Code Voting Results", "Message": "On behalf of JEC: \"Hello all, At the end of the day, 91% of voters - student, faculty, staff, caterers, janitors, security personnel, gardeners- from the Ashesi Community voted YES that the Social Honor Code should be adopted! Congratulations Ashesi for taking this bold step to agree to act with honesty, integrity and respect for others and hold others accountable to these principles and the university's code of conduct! The following are other relevant statistics from the vote: Number of VotesYES56891%NO498%Rejected41%TOTAL621100.00%DemographicsStudents34756%Faculty/Staff/Support27444%TOTAL621100% Congratulations everyone!\"  This is an exciting chapter in Ashesi's history and each member of this community should be very proud of this feat! Special thanks go to JEC for having this in their manifesto last year and working very hard on it; and the entire ASC leadership for working diligently on this social honor code. The Office of Students and Community Affairs will communicate further details on the celebration/ceremony to officially adopt the Social Honor Code.  Very proud member of this community! Abdul MahdiDean of Students and Community Affairs", "Class": "2"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "An Exciting Talk by Dr. Olaf: “Building Educational Web Apps for Children”", "Message": "Dear all, Please save the date next week Wednesday, 31st January 2018, for a talk on “Building Educational Web Apps for Children” by Dr. Olaf Hall-Holt. Dr. Olaf Hall-Holt earned his Ph. D. in Computer Science at Stanford University in 2002, then served as a Postdoctoral Research Associate at SUNY Stony Brook before arriving at St. Olaf College.  His research interests include computational geometry, graphics, computer vision, and mathematics education.  He grew up in Nigeria, studied mathematics in Budapest, and has worked in Silicon Valley. He enjoys playing soccer and ultimate frisbee, learning about first century history, camping in the snowy winter, and spending time with his wife Christy and their daughters Viveka and Annelise. Here is an abstract of the topic: AbstractThe use of mobile devices in education is growing.   How can mobile devices be helpful in learning mathematics?  In particular, can appropriately designed apps enable deeper conceptual understanding of basic mathematics for children in primary school?  We describe some virtual manipulables that enable primary students to understand multi-digit decimal multiplication in a new interactive context. We then share some preliminary results of using these virtual manipulables in a primary school classroom. Venue: LH 216Date & Time: Wednesday, 31st January 2018, 2:40pm This talk will be of interest to all. Looking forward to seeing you there!  Best regards,---------------------------------- Anna A. Aggrey | CS PROGRAM COORDINATORAshesi University CollegeBerekuso, Eastern Region.", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "Happening Tonite! African Satire Exhibition Nite & Party", "Message": "Dear All: This is a gentle reminder about the opening nite of my exhibition at Gallery1957 at Kempinski Hotel, Accra titled \"Almost True\". We begin at 6pm and will wrap up by 10.30. Of course there will be music, 'chop-chop', water, and other liquids. Please note that Kempinski has two gallery spaces: Gallery 1 which is located within the main hotel; and Gallery 2 which is located right opposite the main hotel and it's called the Kempinski Mall. The hotel and the mall are all within the same space. Our exhibition is taking place at Gallery 2.Hope to see all of you tonite! Cheers, Frimpong. Joseph Oduro-Frimpong, Ph.D. Department of Arts and Sciences Ashesi University 1 University Avenue, Berekuso, E/R PMB CT3 Cantonments Accra, Ghana joduro-frimpong@ashesi.edu.gh", "Class": "2"}, {"From": "Millicent Adjei <madjei@ashesi.edu.gh>", "Subject": "", "Message": "", "Class": "2"}, {"From": "Bridgette Abakah <babakah@ashesi.edu.gh>", "Subject": "PINKTOBER day", "Message": "Dear All,Thank you for the very exciting entries that have come in for the PINKTOBER photo challenge.As we gear up to bring the Month of October to an end the Health team will be hosting the Korle Bu Teaching Hospital Breast cancer unit this Wednesday, 31st October. As part of  our Pinktober day there will be a full day breast cancer screening and a breast cancer education session at the health center. What questions do you have about breast cancer is it the treatments, causes or how to prevent it? What are the myths or facts you want cleared up.Join us this Wednesday 31st October as we crown the Breast cancer month. In celebration of Breast Cancer month the  PINKTOBER photo challenge is still ongoing. The challenge is to celebrate all survivors of breast cancer. Take a picture of yourself in a PINK ATTIRE1. Write a post explaining what celebrating breast cancer month means to you2. Tell us who you celebrate in the Month of October3. Send all picture to babakah@ashesi.edu.gh or post with the hashtag #AshesiPinktober#All entries get a breast cancer souvenirThe best three picture will win a cash prize and breast cancer souvenirsLet's get creative and celebrate the Heros who have fought breast cancer.RegardsBridgette   Bridgette Abakah|Nurse Administrator- Ashesi Health Services  Ashesi University 1 University Ave, Berekuso-E/R PMB CT 3, Cantonments, Accra ", "Class": "2"}, {"From": "Hudson Taylor Lekunze <hudson.lekunze@ashesi.edu.gh>", "Subject": "Android Studio Installation", "Message": "Hello Support, This email is to request installation of Android Studio on at least 15 devices in the Labs for final year students taking Mobile Application Development. They need it to complete a project due on Friday. Regards,Hudson (Faculty Intern - Mobile Application Development)", "Class": "2"}, {"From": "Asana <no-reply@welcome.asana.com>", "Subject": "Welcome to Asana", "Message": "Start the day more focused and finish it feeling accomplished by tracking your work in Asana.Welcome to AsanaHere's the best way to start tracking tasks in Asana:Create a task for something you need to finish today.•Add a few tasks for tomorrow, so you know what to focus on next.•Add a task for later that you don't want to forget. Assign it to yourself and set a due date; we'll remind you when it's coming up.•Go to Asana Download the Asana AppAsana works wherever you do, too. Stay updated on the go with Asana for iOS and Android.You've received this email as confirmation of your Asana account. ", "Class": "2"}, {"From": "Ashesi Student Council <studentcouncil@aucampus.onmicrosoft.com>", "Subject": "ASC 2017/18 Spring Semester Report", "Message": " Greetings Beautiful People,The Student Council would like to present a report on its activities for the just ended Spring Semester of 2018 (attached). The report consists of a summary of activities and the corresponding financials.  With respect to funding and financing school activities, the following new initiatives have been implemented: Introduction of an expense record document: Beginning next semester the expense record document will be distributed to respective clubs and committees to aid them in providing detailed records of every expenditure they incur. Additionally, all committees and clubs are to provide the appropriate source documents (receipts, etc.) to validate the expenses identified. This move is to ensure accountability and accuracy in identifying and recording the expenses. •Creation of a standardized expenditure reporting template: This template was instituted to guide the current and future finance committees regarding how to report particular line items under the appropriate sections. This is in line with the accounting principle of Consistency, where same principles are used in preparing financial statements over a number of periods. This would also facilitate the comparison of statements, thus resolving the issue where items were charged to different accounts in different administrations.•ASC Funding Policy: Following the creation of a standardized budget template, the committee is creating an ASC Funding Policy document. This document would provides a list of items that won't be funded using ASC funds, and also contains guidelines for clubs and committees in preparing budgets. It also gives an overview of low priority items the Committee considers when allocating funds. • If you have any further questions, please do not hesitate to contact us on this email. We would like to thank you for a fantastic semester and looking forward to the next. Regards, ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Back at it Again With D:Lab This Week", "Message": "Welcome back all after a fully charged ASC Week. Here’s what we have in store for you this week: Ashesi D:Lab Content SeriesWhat? – The Design Thinking Content Series powered by the Ashesi D:LabWho?- Libehela KabiWhen? – Wednesday, 28th March 2018Time? - 2:40 pm - 4:00pmWhere? - McNulty Foundation Building Design LabThe topic for this week? -   Framing + Research Tools - Observations and Depth Interview Ashesi D:Lab Maker Skills SessionThis week, we will be building a sound producing circuit which will form the basis of our alarm project. This will take place in the onWhere? Mechanical LabWhen? Wednesday, 28th March 2018Time: 2:40pm and 4pm Health Kiosk1. We will be embarking on building the Health Kiosk structure which is going to house all components.", "Class": "2"}, {"From": "Sylvia Kunkyebe <skunkyebe@aucampus.onmicrosoft.com>", "Subject": "Lost Phone", "Message": "Dear All, I lost my phone (Hwuawei Mate 8 with a blue phone cover) yesterday. Please let me know it if you have seen it. Regards,Sylvia Sylvia KunkyebeAssistant Director of Career Services -MCFAshesi University CollegeBerekuso, Eastern Region. Tel: (+233) 302 610 330 Ext: 1066/ +233 302 974 980Cell: (+233) 50 155 0132Email: skunkyebe@ashesi.edu.ghAshesi: Website | Twitter | Facebook ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Invitation to Class Simulation - CS Faculty", "Message": "Dear All, You are kindly invited to the class simulation of Mensah Sitti (Candidate for CS Adjunct Faculty). This will be held  today at 1:00pm in the Engineering Conference Room He will be teaching on any one of the topics below: “Introduction to multi-tasking and multi-threading”•“Overview of the TCP/IP model”•“Introduction to principles of encryption and authentication”• Kindly make it a point to be present as your feedback is relevant to our recruitment process. Best regards, Theresa Dei DzanieHR Coordinator│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "Request to use Television screen", "Message": "Dear Support Centre, I would kindly like to request to use the television screen for an exhibition during the Career Fair on the 14th of March, 2018. The television would be used by the AIX team to play videos of past AIX experiences. Regards, p.s. I am on standby for confirmation. Thank you.---------------------------------- Anna A. Aggrey | CS PROGRAM COORDINATORAshesi University CollegeBerekuso, Eastern Region.Tel: 233(0) 249-675-016 // Ext 2024Email: aaggrey@ashesi.edu.gh www.ashesi.edu.gh ", "Class": "2"}, {"From": "Michael Asiedu <masiedu@ashesi.edu.gh>", "Subject": "Ashesi Design Lab - Blockchain Hackathon Updates", "Message": "Greetings, Ashesi blockchain Hackathon team in partnership with our partners; Ministry of Trade Ghana, Kumasi Hive, Devless and the Blockchain Society of Ghana had a successful info session a few days ago and we want to thank the community for the support given to the team and project.   The Blockchain Hackathon event, which is scheduled to take place on the 12th to 13th of May, seeks to bring together the most creative and innovative individuals to apply blockchain technology to innovate a supply chain platform the Ministry of Trade and Industry is building. Our hope is that Blockchain will form the backbone of systems and processes in Ghana, and will help revolutionize our complex supply chain processes. In addition to the info session, the team together with the founding Lead, Dr Adomdza, was hosted twice on Citi-Fm, one of which was themed “Blockchain Applications Beyond Bitcoin & Cryptocurrency”. In efforts to keep the conversation going and as a primer for the main event in May, the team plans to hold three more info sessions and extra engagement with the media after the mid semester break. Please look out for notices in this respect. Feel free to contact us or visit our website at https://www.dlabhacks.com to read about the challenge and register! Find pictures of the event here: https://flic.kr/s/aHsktjEiitAshesi D:Lab Blockchain Hackathon Info Sessionflic.kr17th February 2018 ", "Class": "2"}, {"From": "Antoinette Emefa Quintin - Cofie <aattah@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday", "Message": "Wellness Wednesday", "Class": "2"}, {"From": "Samuel Mawuli Anagbo <sanagbo@aucampus.onmicrosoft.com>", "Subject": "Out of Office", "Message": " Dear All, Kindly note that @Aba Kaadze Enyimayew  is working off campus today. You can send her an email if you need her assistance. I am also available to help. Best Regards, ----------Samuel Mawuli Anagbo  |Customer Service/HRAshesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330     ", "Class": "2"}, {"From": "Ebenezer Gwumah Buckman <egbuckman@ashesi.edu.gh>", "Subject": "Apply: WISE@Accra", "Message": "Hello everyone, Following Ashesi’s receipt of the Qatar Foundation’s World Innovation Summit for Education (WISE) Prize in 2017, WISE is hosting a 2018 forum in Accra, on 9 May 2018, under the patronage of H.E Nana Addo Dankwa Akufo-Addo, President of Ghana. The forum will be held at the Marriott Hotel.WISE@Accra will explore the theme \"Unlocking the World’s Potential: Leading and Innovating for Quality Education in Africa\". It will bring together more than 300 local and international thought leaders, decision makers and practitioners from a variety of sectors to celebrate innovations in Africa, and address the role of leadership in achieving quality education. Should this be of interest, you can apply for an invitation to the event at:http://wise-qatar.org/wiseaccra-apply For further information about this gathering, please visit the Forum webpage:https://www.wise-qatar.org/africa-accra-leadership-education  ---Ebenezer G. Buckman '11 Director of External Relations & Special Assistant to the President,Ashesi University College,Berekuso, Eastern Region.Tel: +233 302 610 330 OR +233 302 974 980Ashesi: Website | Twitter | Facebook |YouTube | Instagram  ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "You're Invited to the D:Lab Info Session!", "Message": "Welcome back to the new school year! The D:Lab is hosting an info session today, September 6th at 4:30pm in the Design Lab to share with you the new restructure and answer any questions you may have. Don't forget the lead application deadline closes on Saturday, September 8th which you can access here. Anyone and everyone are welcomed! Come have your questions answered and meet new people. We hope to see you there!  Ashesi D:Lab", "Class": "2"}, {"From": "Yasmin Bucknor <ybucknor@aucampus.onmicrosoft.com>", "Subject": "THE HIVE", "Message": "Dear all, We’re excited to share that the new student center is almost complete. As we prepare for full use, we would also like to share that the center has been named The Hive. Although the upper level kitchen at The Hive is ready for Akornor to move into, wiring the area for Akornor’s payment system has required much more time than we originally anticipated. As we continue to work on completing this process, we will have to maintain the current system of paying for food until we re-open next semester. We apologize for the inconvenience caused by this transition, but do look forward to having The Hive fully online when campus re-opens in 2019. Kind regards, ---Yasmin (Bucknor) Keteku Chief Operating OfficerAshesi UniversityCell: +233 558 274 233 Office: +233 302 610 330 Ext: 2107Ashesi: Website | Twitter | Facebook    From: Yasmin Bucknor  Sent: Friday, November 2, 2018 10:12 AM To: Yasmin Bucknor <ybucknor@aucampus.onmicrosoft.com> Subject: AKORNOR MOVE TO STUDENT CENTER Dear members of the Ashesi Community, As you may have seen, there has been a great deal of construction progress at the new student center adjacent to the Research Building, and we are close to a full launch of the building soon. As part of this, we will be clearing up the lot in-front of the center and moving all current structures from that area, including the temporary kitchen in which Akornor’s team has been cooking. In anticipation of this, we are excited to report that construction on the kitchen and some eating areas in the student center were sped up and these spaces are ready for use. Akornor will therefore be mostly operating out of the student center from Monday, November 5th, and we will all be eating there as well. We have also made the following temporary arrangements to accommodate Akornor’s operations during this transition period:", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "Talk on Legendary Koo Nimo", "Message": "Dear All: How many of you have heard about Koo Nimo, the legendary Ghanaian musician who plays Palmwine Highlife Music? Well, whether you know him or not, the Ghanaian Popular Class will host Mr. Edmonds Obeng-Amoako, Koo Nimo's biographer to talk about the musician's life and works.  Join us this Thursday, March 22nd, 2018 @ 4.20 -5.50 (Engineering Room 202).  In preparation for this meeting, kindly read 2 short articles included below as well as watch the 2 short videos of Koo Nimo in performance.A Very Short Biography: https://www.allmusic.com/artist/koo-nimo-mn0000110808/biography1. A Succinct Overview: http://www.eastafricanmusic.com/koonimo.htm2. Two Music Clips of Koo Nimo3.  a. \"Owuo te se Nnoboa\" (Death is like Colloborative Farming) https://www.youtube.com/watch?v=xXhmiQt4oy4 b.  Industry of the Ant -- https://www.youtube.com/watch?v=DYJYFM2mAck  See you on Thurday at 4.20pm sharp!!!!     ", "Class": "2"}, {"From": "David Amatey Sampah <dsampah@aucampus.onmicrosoft.com>", "Subject": "", "Message": "", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "Ashesi D:Lab Meets MIT D-Lab - first event Jan 17", "Message": " Greetings!You are welcome to the first Ashesi D:Lab event of the year! We are excited to announce that this event is a workshop with the Massachusetts Institute of Technology (MIT)’s D-Lab. So it’s a D:Lab and D-Lab meet! A few Ashesi D:Lab Fellows are working with students from the MIT D:Lab on financial inclusion tools for waste pickers at the Kpone Landfill site. The purpose of the workshop is to analyze research conducted over the weekend and strategize on developing insights into potential solutions for prototyping by the D:Lab team after the D-Lab team leaves. The workshop will be led by:Libby McDonald, an Inclusive Economies Specialist and faculty at the D-Lab focused on Gender and New Economies.•David Hutchful, former Director of Technology Innovation at the Grameen Foundation, Co-Founder and CTO of Bloom Impact and adjunct faculty at Ashesi Univ. teaching in the FDE and HCI programs. • Below is the Project BriefGraduate and undergraduate students currently enrolled in MIT D-Lab’s fall class Gender and Development: Accelerating Women’s Economic Prosperity will partner with students from the Ashesi D:Lab Fellows Program at Ashesi University in Accra, to research mechanisms used to support financial inclusion in low-income countries.  Although many of these models have emerged out of remote, low-income regions, students will consider whether or not it is possible to adapt these tools and strategies for use in low-income, urban settings.  During this component of the program we will interview waste pickers engaged in the overall waste and recycling program currently being implemented in Accra and Tema called PickIt!.  These efforts will allow the team to gain a firm understanding of the informal recycler's current earnings, as well as methods they have employed to manage their money. Students from both universities will then create a graphic presentation designed for a low-literacy population that puts forward financial inclusion mechanisms now being used to provide banking products to people living in extreme poverty all over the world.  This presentation, which will pictorially outline examples of financial products, will be presented to the Accra waste pickers at the Waste Picker Financial Inclusion Workshop in January 2018 and at an MIT D-Lab Financial Inclusion Innovations for the Informal Sector Conference in Boston in April, 2018.  Regards,Ashesi D:Lab Team", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Tips", "Message": "Wellness Tips", "Class": "2"}, {"From": "Bridgette Abakah <babakah@ashesi.edu.gh>", "Subject": "HEALTH FAIR IS TOMORROW", "Message": "DearDear All,TOMORROW is HEALTH FairWhy should be part of this health fair?A wide range of medical services are available for you.    Full Blood CountCheck Hemoglobin level (Anaemic or not)Check presence of infectionsProstate Specific AntigenA blood test to check for the presence of the prostate cancer causing antigen for 35 years and aboveFitness examinationA series of test to test for fitness and obesityVisceral fat1. Basal metabolic rate2. Body mass index3. Consultation with a weight loss expert4. Eye examinationRefraction1. Eye test2. Consultation with optometrist3. Physical examinationBlood pressure1. Fasting blood pressure (Diabetes test)2. Weight3. Height4. ", "Class": "2"}, {"From": "Abdul Mahdi <amahdi@aucampus.onmicrosoft.com>", "Subject": "AJC appeal ruling on a case of alleged sexual assault", "Message": "  AJC appeal ruling on a case of alleged sexual assault   On January 19, 2018 the Ashesi Judicial Committee (AJC) ruled on an appeal for a case of sexual assault that was granted to allow the accused to cross-examine references from the accuser and witnesses. The appeal sought to either confirm the initial verdict and sanctions, confirm the initial verdict but reduce the sanctions or dismiss the initial verdict and sanctions. The AJC established that the male student repeatedly groped and touched a female student without her consent. The male student ignored verbal and physical communications to indicate that his advances were inappropriate and unacceptable.  The AJC upheld the initial verdict and found the male student, a member of the Class of 2017, guilty of sexual assault. As stated in Ashesi’s student handbook: Students are prohibited from engaging in sexual assault or abuse of any kind. Those who do will be subject to serious sanctions, which may include adjudication by the AJC or suspension by the Executive Committee, as described under the Campus Safety decision (Section 10.2). Definition: Sexual assault is defined as any sexual contact that occurs without the consent of the other person. Specifically, it is intentional physical contact with an intimate part of the body or with clothes covering intimate body parts without the consent of the person touched. When sexual assault occurs repeatedly between individuals, it is referred to as sexual abuse. - Section 10.14. After deliberating, the AJC decided to revise the sanctions of the April 18th 2017 ruling to suspension for the September 2017 - May 2018 academic year.Advice to the Ashesi Community:", "Class": "2"}, {"From": "Nathalie N'Guessan <nnguessan@ashesi.edu.gh>", "Subject": "French Embassy Master’s Degree & PhD Scholarship Programmes 2018-", "Message": "2019 For Ghanaian studentsDear colleagues and students, Please find bellow informations regarding scholaship opportunities to study in France.RegardsNathalie Master’s Degree & PhD Scholarship Programmes 2018-2019 For Ghanaian studentsWithin the framework of academic cooperation and student mobility between France and Ghana for the 2018-2019 academic year, the French Embassy in Ghana is offering co-shared scholarships to bright Ghanaian students at Master’s and PhD levels for the 2018-2019 academic year.DESCRIPTION AND BENEFITS OF THE SCHOLARSHIP PROGRAMMESThe eligibility criteria for 2018 are as follows Applicants must have Ghanaian nationality. Age limit: 35 years for applicants of a Master’s degree and 40 years for those of PhD. Academic level:  Bachelor’s Degree for a Master’s Mphil Degree for a PhD Fields of study:·       Agriculture & food industry·       Biology·       Chemistry·       Environment·       Languages and literature·       Mathematics·       Physics·       Health sciences·       Engineering", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "Design Thinking Ghana Conference 2018", "Message": "Dear Ashesi Community, The Ashesi D:Lab will like to share recent collaborations to expand on its Design Thinking outreach. The D:Lab is collaborating with Design Thinkers Group, Netherlands, and HPI d-school at the University of Cape Town (UCT), South Africa to present the second Design Thinking Ghana Conference (DTGC 2018), starting on June 20th. The other organizers include the Ghana Design Network and the Design Thinking Ghana Hub.   This year, the DTGC will focus its case studies, workshops and panels on using design thinking to gain competitive advantage and to realize social impact. The organizers believe that when a company has deep customer or user insights, it can understand customers’ needs better than its competitors and subsequently provide the best solution. If customers enjoy the best solution, their level of satisfaction will sustain the company’s business and also ensure the greatest impact. The presentations therefore show how companies have used design thinking to create new offerings for products, services and programs in healthcare, telecoms, financial services, customer service, education, energy, informal sector concepts, community development among others. The program activities will be led by keynote speakers Arne Van Oosterom from the Netherlands and Dr Rael Futerman of the d-school at UCT, South Africa. They are supported by speakers from all over the country and Nigeria with representation from Ashesi’s current and former faculty and faculty interns, Dr. Gordon Adomdza, David Hutchful, Dela Kumahor (Program Chair), Carl Agbenyega and Philip Asare. Dr Rael Futerman, will take participants through an action-based Design Thinking workshop on June 20 & 21. Register www.bit.ly/DTGC2018dschWorkshop. This workshop will introduce participants to Design Thinking tools, methods and mindsets. The UCT chapter of the d-school is the newest and third Hasso Plattner Institute of Design Thinking in the world, joining the well-established d-schools at Stanford and Potsdam Universities. The D:Lab is therefore excited about opportunities to develop programs together.The D:Lab is offering 10 promo codes for 25% off the conference registration fee for the various categories listed. The code is AshesiD:Lab@25%  Register at www.bit.ly/DTGC2018Register   Don’t miss out on the June 22 sessions (and perhaps the June 23 sessions after the historic Ashesi graduation ceremony) . Want to reserve a ticket for pick up at the gate?  www.bit.ly/DTGC2018Reserve   Email on designthinkingghana@gmail.com or call +233 502621925 ", "Class": "2"}, {"From": "David Ebo. Adjepon-Yamoah <dadjepon@aucampus.onmicrosoft.com>", "Subject": "CS 341 Web Technologies: Entrepreneurship Project", "Message": "Hello All, In the \"CS 341: Web Technologies\" course, students have formed 10 'companies' to compete in building quality professional (CV-based) websites for students, staff and faculty of Ashesi University. This project aims to highlight the significance of also focusing on entrepreneurship as an IT professional. In this project, students will identify and use marketing strategies to gain competitive advantage, use basic accounting for their budgets, interact with clients in order to obtain project requirements, provide good customer service, show professionalism, etc. Collaborators of this project are: - Dr. Ayorkor Korsah (Head of Department, CSIS)- Mr. Abdul Mahdi (Dean of Students)- Dr. Sena Agbodja Agyepong (Senior Lecturer, BA)- Ashesi Career Service/Team- Ashesi Writing Centre- Developers Student Club (Ashesi University) This entrepreneurship project starts from 8th November 2018 to 29th November 2018. We really hope that you will be our client for a small fee.    Kind regards,Ebo 8<----------------------------------------------------------------------------------------------------------------------------------------David Ebo Adjepon-YamoahLecturer (Ashesi University: Computer Science & Information Systems)1 University Avenue, Berekuso E/RPMB CT3, Cantonments , Accra, Ghana(Ashesi Front Desk: +233 302 610 330 | +233 302 974 980) E: dadjepon@ashesi.edu.gh  | T: (Ext) 1002 | W: http://homepages.cs.ncl.ac.uk/d.e.adjepon-yamoah/ResearchGate: https://www.researchgate.net/profile/David_Adjepon-YamoahGoogle Scholar: https://scholar.google.com/citations?user=D38IIN8AAAAJ&hl=en&oi=sra", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday Tips", "Message": "Wellness Wednesday Tips", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "Talk on Koo Nimo Today @4.30", "Message": "Dear All: This is to remind you beginning at 4.20pm today, the Ghanaian Popular Culture class will host our guest speaker will interact with on the life and works of Koo Nimo, the legendary palmwine highlife musician. See you there! Cheers. Joseph Oduro-Frimpong, Ph.D. Assistant Professor Department of Arts and Sciences Ashesi University 1 University Avenue, Berekuso, E/R PMB CT3 Cantonments Accra, Ghana joduro-frimpong@ashesi.edu.gh", "Class": "2"}, {"From": "Antoinette Okyere <aokyere@ashesi.edu.gh>", "Subject": "Reminder: Townhall and Charter celebration - Tomorrow @3:30pm", "Message": "   Thank you             From: Abdul Mahdi Sent: Friday, November 9, 2018 9:28 AM To: Ashesi Community Subject: Save the date: Townhall and Charter celebration - Nov 21st  Abdul MahdiDean of Students and Community AffairsAshesi University, GhanaTel: +233-302-610-330 | Ext 1001 or +233 302 974 980Cell: +233-50-126-0164Email: amahdi@ashesi.edu.gh  ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "wellness bonus tip", "Message": "wellness bonus tip", "Class": "2"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "LOST AND FOUND", "Message": "Hello, Kindly come by my office – Radichel Hall 102A; if this ‘lost and found’ brown bag belongs to you. Thank you. Kind regards, Dzifa From: Dzifa Nuer  Sent: Wednesday, October 10, 2018 12:35 PM To: Dzifa Nuer <dnuer@aucampus.onmicrosoft.com> Subject: Lost      Get Outlook for Android ", "Class": "2"}, {"From": "", "Subject": "", "Message": "", "Class": "2"}, {"From": "Yasmin Bucknor <ybucknor@aucampus.onmicrosoft.com>", "Subject": "AKORNOR'S MOVE TO STUDENT CENTER", "Message": "Dear members of the Ashesi Community, As you may have seen, there has been a great deal of construction progress at the new student center adjacent to the Research Building, and we are close to a full launch of the building soon. As part of the project, we will be clearing the lot in-front of the center and moving all current structures from that area, including the temporary kitchen in which Akornor’s team has been cooking. In anticipation of this, we are excited to report that construction on the kitchen and some eating areas in the student center were sped up and these spaces are now ready for use. Akornor will therefore be mostly operating out of the student center from Monday, November 5th, and we will all be eating there as well. We have made the following temporary arrangements to accommodate Akornor’s operations during this transition period: 1. As we have not yet connected the student center to our internet systems, Akornor’s payment point will remain where it currently is at the Databank Hall (by Databank Lecture Hall 218). 2. Once payment is made, we will have to take our coupon to the student center to be served.  This will last only for a short period, while the student center is being completed and brought online. We apologize for any inconvenience this may cause and ask for your support to make this transition successful. If you have any questions, do reach out to Casper, Dzifa or myself. Kind regards, ---Yasmin (Bucknor) Keteku Chief Operating OfficerAshesi UniversityCell: +233 558 274 233 Office: +233 302 610 330 Ext: 2107Ashesi: Website | Twitter | Facebook ", "Class": "2"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Temporary Shuttle Arrangements for Tomorrow, Thursday, May 3rd.", "Message": "Dear all, Please be informed that, the car with registration No. GX 1835-17 driven by Peter Akumasi will undergo its regular maintenance service on Thursday, May 3rd.  The department has rented an all-white 30-seater Toyota coaster bus with registration No: GR 9038-16 to run both the morning and evening shuttles at 7:00am and 5:10pm respectively from CTK-37-Shiashie-Okplonglo-Atomic-Madina-Kitase routes. Name of Driver:  Mr. Edward Asante.•Phone No.: 024 350 8488.• Arrangements for the remaining buses are indicated below:Mr. Eric Tetteh McCarthy (024 278 0788) will drive the white/purple coaster with registration No. GX 1834-17. He will ply same routes respectively at 6:15am and 6:15pm - CTK-37-Shiashie-Okplonglo-Atomic-Madina-Kitase routes;1. Mr. Kenneth Amofah (054 418 1817), with car No. GT 6764-14 driving the white and green coaster; he will be running the 7:10am and 6:15pm, Haatso-Aboum-Atomic Roundabout routes.2. Mr. Samuel Bansah (024 048 7127) will drive the all-white coaster bus with registration number GT 1078-16. He will ply the early morning 6:40am from KFC-Haatso-Aboum-Ashesi. Again, he will run both the 5:10pm and 8:00pm Aboum-Atomic Roundabout-KFC-Atomic-Madina routes.   3. The afternoon schedule remains unchanged.4. We will revert to our regular shuttle services on Friday, May 4th.Thanks for your co-operation. Best regards, ", "Class": "2"}, {"From": "Kwame Atta Gyamfi <kgyamfi@ashesi.edu.gh>", "Subject": "Uber is on campus now. 0244890655", "Message": "Dear all, There's an uber car on campus. Please call Aaron on 0244890655.   Kwame  Get Outlook for Android ", "Class": "2"}, {"From": "Michael Asiedu <masiedu@ashesi.edu.gh>", "Subject": "Ashesi D:Lab Hydroponics Farming: Where we are and Expected Outcomes", "Message": "Dear Ashesi Community,   Ever wondered why the Netherland, though bereft of almost every resource long thought to be necessary for large-scale agriculture, still stands as the globe’s number two exporter of food as measured by value? Hydroponics may not account for all of it, but certainly one of them!   What is Hydroponics and Why does it deserve any attention?In case you are not acquainted with the technology, Hydroponics is simply a method of growing crops using nutrient solutions instead of growing the crops in soil. This technique makes it possible to provide crops with the best amount of nutrients to optimize crop growth and yield.   The Hydroponic Farming Technique boasts of faster crop growth and is environmentally friendly because it uses less water than conventional agriculture. The technique, if adopted in Ghana, will be crucial to sustaining the vegetation as hydroponic farming eliminates the need to cut down trees and destruction natural habitats. This semester the Ashesi D:Lab Hydroponics team, under the Farm Modeling Project, is working to bring this wonder to Ashesi. The team is currently working to employ and test the hydroponic technology under our harsh weather conditions. The project will capture learnings and experiences that will start and contribute to the conversations on sustainable farming method and hydroponic farming in Ghana and beyond.   Work has already started on the structure, IoT, and will continue after the mid semester break. We welcome interest, suggestions and support in any form from the community! Contact Stephan Ofosuhene atstephan.ofosuhene@ashesi.edu.gh Ashesi D:Lab Hydroponic Team", "Class": "2"}, {"From": "Michael Quansah <mquansah@aucampus.onmicrosoft.com>", "Subject": "Special Invitation | Ashesi Staff - Faculty BasketBall Team", "Message": "Dear all, Here’s a quick note to introduce the Ashesi Staff and Faculty Basketball team to you! This is an exciting opportunity open to both men and women, at any skill-level,  to stay fit, hangout with other staff and faculty and also improve your basketball skills, or for some us, completely learn a new sport!  Twice a week, on Wednesdays and Fridays at 5.10pm, and sometimes in between, we train on the basketball court in the student's hostel , opposite the Bliss Student Lounge. Additionally, we are coached by the no-nonsense Nana Ama Bortsie-Ansah.  While this is primarily to stay fit, learn something new and have fun, the students have recently thrown a bold challenge at us: suffice to say; losing is not an option! If any of this sounds like fun to you, or you’re remotely interested in seeing or learning some legendary basketball skills or just cheering us on, kindly follow this link to join the team's low data-usage WhatsApp Group: https://chat.whatsapp.com/2hasdRtv1Ab3EqfwjzsHab. In the spirit of channelling our inner Michael Jordan,  ------------Michael Fiifi QuansahAlumni and Public Relations OfficerAshesi University 1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Email: mquansah@ashesi.edu.ghTel: +233-302-610-330 ext 1038 | Cell: +233- 50 150 9155Ashesi: Website | Twitter | Facebook |YouTube | Google+ ", "Class": "2"}, {"From": "Selase Aku Tsiagbe <stsiagbe@aucampus.onmicrosoft.com>", "Subject": "CARING FOR YOUR LENSES", "Message": "Dear all,Care for your lenses using  these simple tips below.    Dry your lenses with high quality washable and reusable Micro-Fiber cloths like the ones given when you pick up your glasses or the ones in your spectacle cases.1. Please do not use facial tissue or paper towel as they will scratch your lens.2. Avoid all chemicals, even hairspray and cologne as  they are potentially harmful to lenses.3. Never leave your eyeglasses in the sun or in a hot car. The heat can damage your lenses and frames.4. Never lay your eyeglasses face down and always keep them in a case when not in use.5.  For this and many other tips on caring for your lenses, follow ROBERT ANS SONS on Instagram, Facebook and twitter at the handle @robertnsonsltd.  RegardsSelaseSelase Aku TsiagbeNursing Officer  |Ashesi Health Services 1 University Avenue, Berekuso , Eastern Region, Ghana.mobile no.0206373405:  0232470373. Email: stsiagbe@ashesi.edu.gh Health line: 0501331668", "Class": "2"}, {"From": "David Kadeh <dkadeh@ashesi.edu.gh>", "Subject": "Annual Leave - August 7th to August 28, 2018", "Message": "Dear All,Please be informed that I will be out of office from tomorrow, Tuesday, 7th August until Tuesday 28th August 2018. In my absence Rose Akudugu and Nii Nettey will oversee the finance office. see details below:Rose Akudugu1. All scholarships, research and program grant related issues,a. Fees, Accounts Receivables, and student complaints etc.,b. Banking, bank reconciliation, online collections related businesses,c. Payment authorization and approval up to 10,000 currency unit (over 10000), please see Yasmin Bucknor, the COO or the President.d. Grant reports and daily cashflow updates.e. Nii Nettey2. Payroll, pensions, tax and other statutory issues,a. Capital grant accounting and reporting issues,b. Budgets and variance analysis reporting issues,c. Sinking fund and short-term Investments issues,d. University financial reports and updates etc.e. All other matters, please see Rose Akudugu for assistance. Thank you DK David Kadeh | Director of FinanceAshesi University, 1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Tel: +233-302-610-330 ext 1015| Cell: +233-501-260 294Email: dkadeh@ashesi.edu.gh | www.ashesi.edu.gh  Visit us on Facebook – Twitter – You TubeEthical Leadership | Innovative Thinking | A New Africa ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "FW: Wellness Wednesday Tips", "Message": "FW: Wellness Wednesday Tips", "Class": "2"}, {"From": "Sena Agbodjah Agyepong <sagyepong@ashesi.edu.gh>", "Subject": "Invitation to Ignite '19", "Message": "Dear Community,In our bid to prepare juniors for their capstones next year, the Business Administration and Computer Science Departments, and the Engineering Faculty will like to invite you to an Opportunity Hackathon this weekend at the Norton-Motulsky Hall dubbed Ignite ‘19. Participating students will learn about and research on opportunity spaces by defining various value chains of interest (please check the poster for details) and arrive at problem spaces and evaluation criteria for arriving at a good solution. Participants can use Ignite ’19 as an opportunity to explore problem areas to inform their thesis, applied projects or entrepreneurship projects across majors: BA, CS. MIS and Eng. You, the community, are invited to join us at various points based on the schedule below and invite others even outside of this community to join us. We also need more faculty/staff members to join us to serve as resource persons, to evaluate or to observe the process and give us feedback for improvement. Please reach out by return mail to William and I, and we will get in touch to collaborate or to answer any questions you might have. Many thanks for your attention and look forward to hosting you!Sena  The Schedule to help you decide at which point to join us. Faculty/staff are invited to join as resource persons during the Clinics and Mini-workshops. Dr Sena Agbodjah Agyepong (MGhIS PMP)Senior Lecturer, Entrepreneurship, Real Estate Development and Business Negotiations.Project Lead, Business Academy of the Next Generation Cocoa Youth Program, MASO (http://www.masogh.org/maso-business-academy/)Admissions & Entrepreneurship Lead, Ashesi Innovation Experience (https://www.youtube.com/channel/UC0lK_GedB0czNFgQwVFn7KA)Coordinator, Capstone Entrepreneurship Session Department of Business Administration  I  Ashesi University College  I  1 Berekuso Road  I  Berekuso  I  Ghana.PMB CT3, Cantonments  I  Accra  I  Ghana+233 (0) 302.610330 Ex. 1058www.ashesi.edu.gh  I info@ashesi.edu.gh ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Starting 2018/2019 Academic Year!", "Message": "Dear All, We have begun our 2018/2019 Academic year and this is an opportunity to warmly welcome all our new administrative staff and faculty members. As Ashesi grows, it has become more important for all of us to pitch in to keep our surroundings clean and healthy every day. We do this not only for our health but to be examples to our ethical leaders-in-training! These are key areas that will need our careful attention: Staff Buses:Do keep buses clean.Do deposit all tickets and rubbish into the bins provided by the doors of the buses.Do keep curtains and windows clean.Do be mindful of people around you and do not leave food in the buses.Do report any damages to Logistics and Facilities department. Staff Kitchenettes: Do keep the counter tops clean and dry.Do wash and put away your take-out bowls. There are drawers in the kitchens for this.Do wipe your bowls clean of oil and debris before washing them. This will prevent clogging of the drains.Do keep your personal mugs in the kitchen drawers or in your office lockers. Empty mugs in the fridge will be taken out.Do empty your coffee granules into the bin and try to wipe most of the granules into the bin before washing your mugs and filters. This will prevent clogging of the drains.Do peek into the fridges once a week to dispose of  anything you are not using. HR will dispose of anything we notice going bad or been in the fridge for more than 3 weeks; apart from dairy which will be taken out within a shorter time.Do keep the microwave door closed and microwave clean after use.Do keep spaces around the bins clean. Use tissue to pick up food particles and wipe drops of liquid.Do carefully scrub/wipe the top of the dining tables and chairs after eating.Do call out your colleagues who default to remind them to clean up. Bathrooms:", "Class": "2"}, {"From": "Derick Omari <derick.omari@ashesi.edu.gh>", "Subject": "Tech Era RoboTech Module Workshop 2018", "Message": "Hello All,   I hope this mail finds you well.   Tech Era would like to invite you to it's first 3 - day robotics and electronics workshop for Senior Secondary Technical students taking place at Ashesi University College, from the Today 11th to Saturday 13th of January, 2018 from 10:00 am to 4:00 pm.   The workshop will take place in lab 221.   This year, with the aim of expanding our robotics and electronics module to the senior high technical schools (Aburi Sec Tech and Accra Technical Training College), we are organizing the 3 day workshop to expose selected students from these schools where we have established the robotics clubs who will transfer the knowledge they have acquired to their colleagues in the schools during club meetings.   Our tutors will visit these schools twice every month to facilitate the subsequent training sessions.  Feel free to join us if you have time today to encourage the students and show them some love.  You can learn more about our work on our website: techera-gh.org  and on facebook: Tech Era Gh  Have a blessed day.  Best,  Derick Omari  Business Administration ‘ 18 |Ashesi University College ", "Class": "2"}, {"From": "Mohammed Zemmane Osumanu <mosumanu@ashesi.edu.gh>", "Subject": "LOST AND FOUND ATM CARD", "Message": "Hello,I hope this message finds you well,a lost ATM card has been brought to the main hostel lobby,please come and identify it and pick it at the hostel front desk.Regards,Mohammed.", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "2:40pm -3pm Community wide Wellness dance", "Message": "2:40pm -3:00pm is a Community Wide Wellness Dance. As part of the launch for Wellness Wednesday, we are initiating a Community Wellness dance. Please, Please stop and come join in this community wide dance. Exercise is important for good health and today we  are celebrating Valentine’s Day by  loving ourselves and improving our health.   Also, at 5pm-6pm there will be aerobics with the Azonto twins at the basketball court. Best regards", "Class": "2"}, {"From": "Isatou Jallow <isatou.jallow@aucampus.onmicrosoft.com>", "Subject": "FITNESS CHALLENGE UPDATE-WELLNESS WEDNESDAY'S", "Message": "FITNESS CHALLENGE UPDATE-WELLNESS WEDNESDAY'S", "Class": "2"}, {"From": "Sebastian Dakey <sebastian.dakey@ashesi.edu.gh>", "Subject": "Appreciation - Grazie '18", "Message": "Dear All, Grazie’18 was a success! Ashesi chorale is very grateful to the entire community for making this happen and for your support.  Your presence brought all the hard work to life and helped us appreciate amazing talents that lie right here in our community. Thanks to all who came to listen to us perform and to those who were not able to, don’t worry, you can watch out for next year. Enjoy the rest of the activities for the ASC week.  Best,Ashesi Chorale  ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "2018 Retreat-Moving Ahead", "Message": "Dear All, Your rooms are booked, Senchi is ready for us and our facilitators are excited! We will be participating in multiple competitions in our assigned groups before and during our  “ We Are Ashesi”  retreat. Do note that this year’s retreat will focus on helping us work on moving forward together as a team. Each team will be sent a task to complete by 4pm on  4th May, 2018. Note that meeting the deadline and completing  in this task will go towards the overall competition.   N.B. We have sent a calendar invitation for the retreat. Do accept the invitation if you have registered to attend the retreat to lock the days on your schedule. All the best to each one of you and let the games begin! Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/  ", "Class": "2"}, {"From": "Pudaruth Sameerchand <sameer.pudaruth@gmail.com>", "Subject": "Call for Papers for Mauricon 2018 on 6-7 December 2018, Mauritius - ", "Message": "Proceedings to be submitted to IEEE XPloreDear Colleague, The MAURICON 2018 International Conference on Intelligent and Innovative Computing Applications (ICONIC) will be organised in Mauritius from 6-7 December 2018 at the Holiday Inn, Mon Tresor, Plaine Magnien (only 5 minutes drive from the airport). This conference is being organised by the Society of Information Technologists and Entrepreneurs with technical support from the IEEE Mauritius Subsection in order to provide an opportunity to academic researchers, industry professionals, government delegates and students to interact and share their experiences and knowledge on cutting-edge developments in the fields of Cloud Computing, Internet-of-Things, Networked Systems, Data Communications, Sensor Networks, Computer Security, Multimedia, Computer Vision, Intelligent Computing, Data Mining, Machine Learning, Artificial Intelligence, Robotics, Machine Vision, Signal Processing, Software Engineering, ICT4D and ICT in Education. Our main objective is to promote scientific and educational activities towards the advancement of knowledge by improving the theory and practice of various disciplines and areas of ICT Engineering. Papers are invited for the MAURICON ICONIC 2018 on any topics lying within the scope of the conference. All contributions must be of high quality, original, and must not have been previously published elsewhere or intended for publication elsewhere. All papers will be reviewed by the members of the International Programme Committee and depending on their degree of innovativeness and quality of presentation, may be selected for oral or poster presentation and publication in the conference proceedings. All accepted and registered papers will be submitted for potential inclusion in IEEE Xplore Digital Library (Conference Number #44423), provided they meet the quality standards set by IEEE. All submissions will be reviewed by at least two independent reviewers by following a double-blind review process. Paper SubmissionAll submissions must be in English. Authors are invited to submit full papers  using the IEEE conference template which is available in the conference portal.  All papers must be submitted through Easy Chair at: https://easychair.org/conf", "Class": "2"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Postponed: Immigration Regularization-Ghana Card (Non-Citizen ID) and ", "Message": "Residence PermitHello Everyone, I hope this email finds you all well. Kindly note that the date for immigration regularization process has been changed till further notice. New dates will be communicated with you in due time. In view of this if you have not made payment for the Ghana Card Scratch card,  tomorrow, Wednesday, September 19, will be the last day for depositing your money at ODIP for the purchase. Do let me know if you have any questions. We do apologize for any inconveniences caused. Sincerely, Benardine Holdbrook GhansonDiversity and Inclusion OfficerOffice of Diversity and International ProgramsAshesi University 1 University Avenue Berekuso E/R Tel: +233 (0)302610330  Ext: 1056Email:bghanson@ashesi.edu.gh  From: Benardine Holdbrook Ghanson  Sent: Friday, September 14, 2018 2:15 PM To: Ashesi Community <AshesiCommunity@ashesi.edu.gh> Cc: Office of Diversity and International Programs <odip@ashesi.edu.gh> Subject: RE: Immigration Regularization-Ghana Card (Non-Citizen ID) and Residence Permit Importance: High Hello Everyone,", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "GCIC-Ashesi is on TV!", "Message": "GCIC in partnership with Multi Tv will be airing Climate Focus for the next five weeks (starting last week). Climate Focus is a series of 5 TV documentaries focused on how GCIC’s entrepreneurs are mitigating the effects of climate change and or are encouraging climate change adaptation through their start-up businesses. The Climate Focus Documentaries hope to continue to raise awareness on climate change and its impacts and also showcase how everyday Ghanaians are responding to the issue. Please find the airing schedule below. Aside from this, there shall be a panel discussion every Wednesday at 3.30pm. Tune and watch the amazing work the team has done with the entrepreneurs! DateDocumentarysector focusAiring times17th – 21st SeptemberEl BaliconClimate smart agriculture6am, 10am, 11.30am, 3pm24th-28th SeptemberBlack Star EnergySolar Energy6am, 10am, 11.30am, 3pm1st-5th  OctoberCibus TechnologyDomestic Waste Management6am, 10am, 11.30am, 3pm8th -12th  OctoberMoringa ConnectWater Mgt & Purification6am, 10am, 11.30am, 3pm15th-19th  OctoberZaacoalEnergy Efficiency6am, 10am, 11.30am, 3pm  Best regards, Aba K. Enyimayew| Director-Human Resources  Ashesi University1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/  ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Apply to be an Ashesi D:Lab Delegate Now!", "Message": "Dear Students Is your summer looking bleak?Are you looking for an opportunity to study and consult with students from the Northeastern University at the same time? The Ashesi D:Lab in partnership the Northeastern University is giving the opportunity to 5 Ashesi students to study as well as work with students from their university. This is a hands-on business course to brighten our CV and give insight on challenges that social entrepreneurs are confront in their effort to Globalize their products and services. The course will also focus on core product management issues as well. Towards the end of the course, you will have the opportunity to apply this training, together with the Northeastern University Students in consulting projects with established social enterprises in Ghana. Students selected for this opportunity will serve as delegates who will participate in class sessions, field projects and consulting projects that will be taken within the course in Ghana. The course will run for two weeks and will start in May 21st and end June 1st. For more information about the course and course plan please see the attached documents.  P.S. Delegates selected by the Ashesi D:Lab will participate in this course for free and will free lunch and transportation subsidized.  Please fill the google form attached if you are interested. Deadline: 28th April, 2018Be quick, do not miss it.https://tinyurl.com/NorthEasternUnivInternshipNorth Eastern University Internship", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "Wellness Wednesdays", "Message": "Wellness Wednesdays", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Refreshment for Pension session", "Message": "Dear All, Kindly note that refreshment for the pension session has been freely provided by Big Ben.   Kindly say a big thank you when you see them around. Best regards, Theresa Dei DzanieAssistant Manager- HR│Ashesi University1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "CAUGHT BEING GOOD WINNERS", "Message": "CAUGHT BEING GOOD WINNERS", "Class": "2"}, {"From": "Grammarly Insights <info@send.grammarly.com>", "Subject": "Your Weekly Progress Report + Stories & Tips", "Message": "It seems that you had no writing activity with Grammarly last week. Just to be safe, please make sure you are logged in so that we can populate this email with cool stats including personal records and achievements. Visit My Editor →  JUNE 25 - JULY 01 Your Weekly Writing Update It seems that you had no writing activity with Grammarly last week. Just to be safe, please make sure you are logged in so that we can populate this email with cool stats including personal records and achievements.    GRAMMARLY WRITING STREAK 0 weeks1Next AchievementSee all achievements ›   PRODUCTIVITY No activity detected for last week.  Please make sure you are logged in.   Share  Share 0words checked           ", "Class": "2"}, {"From": "Abdul Mahdi <amahdi@aucampus.onmicrosoft.com>", "Subject": "2018 Ashesi graduation - Saturday 23rd June", "Message": "Good morning Colleagues, I can’t believe graduation is in 8 days!!! As we count down to it on Saturday, 23rd June, I wanted to give you some more information on the activities of the day.We’ll have a graduation rehearsal on Friday morning, 9:00 am, for students and a few other people involved (mainly staff volunteers who have agreed to be in charge of particular areas). We will email faculty who will play a role in graduation. •Graduation is anticipated to start at 9am and end by noon.•For the first time in Ashesi’s history, we will be conferring our OWN degrees•We expect over 1,500 guests including the Chief of Berekuso and his entourage.•This year 137 students will graduate.•The event will run as follows:•Background music by Ashesi Chorale•Procession (Casper leading those on stage, Faculty, Class of 2018)•National Anthem by Christine Buckle • Welcome by Casper•Opening Reading by Provost•Class remarks by Bryan Achiampong•Ashesi’s President’s Remarks•Guest of Honour’s Remarks•Class presentation by Owuraku Nyamekye Ampofo•Presentation of gift from Ashesi to UCC & UMAT by President Awuah•Reading of SLC citations, Dean of Students – Presentation of Awards by President Awuah•Conferring of Degrees by Provost & President•Reading the names of graduates by Dr. Ayorkor Korsah•Recession •", "Class": "2"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "Entrepreneurship Hackathon: Ignite '19", "Message": "Good afternoon all,I trust this finds you keeping well.The Business Administration Department, in conjunction with the Stanbic Business Incubator, the Ashesi D:Lab, the Ashesi Venture Accelerator, the Ashesi Enterprise Fund and the Entrepreneurship Capstone session is happy to present the maiden junior’s only hackathon, Ignite ’19 on campus this month. Why this junior’s only hackathon?To give juniors from all majors the opportunity to collaborate and work together to explore problem spaces and develop business models for solutions through brainstorm sessions, mini-workshops, business pitches, among others. The objective of this multi-disciplinary approach is to fuel collaborations among the academic departments, help with collaborations on capstone projects, enhance team formation for the Entrepreneurship capstone and make the capstone experience more relevant to students who enrolled in the FDE class. When will this hackathon be held?Dates: 20th and 21st April 2018Venue: Norton – Motulsky HallTime: 3pm – 8pm on the 20th; 8:30am – 6:00pm on the 21st How can the Ashesi community be off help?Participants will get the opportunity of meeting, interacting and networking with a wide range of industry experts in their selected area of interest for the hackathon. These areas of interests are general themes collated from sources including an interesting article by Smallstarter.com, the SDGs, and from observed areas of interest that we see startups focusing on.We will appreciate the entire Ashesi community’s support in the hackathon to observe, serve as resource personnel and/or recommend industry players in the selected thematic areas to provide participants with the needed feedback. Members of the community (excluding current students) can also serve as judges in the pitch presentations the ventures will engage in. Kindly fill this form to indicate your interest in this hackathon and what role you can potentially play. ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "Caught Being Good Nomination Form - November", "Message": " Caught Being Good is Back!!!  Caught being good is an OSCA initiative to celebrate every day actions that make a positive impact in our community. Our goal is to encourage each other to do good every day and live out the values for which Ashesi stands for. You can join celebrate these amazing people by nominating an individual or group using our nomination forms.  As usual, kindly use this form to throw in your nominations for this month.  \"Whatever you are, be the good one\" - Abraham Lincoln Peace out! Nadia AmasaStudent Activities Coordinator Ashesi University1 University Avenue Berekuso E/RPhone: +233 (0) 245433570Email: nadia.amasa@ashesi.edu.gh ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Uber in 15mins", "Message": "Please call Noel on 0558314680 if you need an uber off campus in 15mins. Regards, Aba K. Enyimayew| Director-Human ResourcesAshesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/", "Class": "2"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Temporary Shuttle Arrangements for Tomorrow, Thursday, May 3rd.", "Message": "Dear all, Please be informed that, the car with registration No. GX 1835-17 driven by Peter Akumasi will undergo its regular maintenance service on Thursday, May 3rd.  The department has rented an all-white 30-seater Toyota coaster bus with registration No: GR 9038-16 to run both the morning and evening shuttles at 7:00am and 5:10pm respectively from CTK-37-Shiashie-Okplonglo-Atomic-Madina-Kitase routes. Name of Driver:  Mr. Edward Asante.•Phone No.: 024 350 8488.• Arrangements for the remaining buses are indicated below:Mr. Eric Tetteh McCarthy (024 278 0788) will drive the white/purple coaster with registration No. GX 1834-17. He will ply same routes respectively at 6:15am and 6:15pm - CTK-37-Shiashie-Okplonglo-Atomic-Madina-Kitase routes;1. Mr. Kenneth Amofah (054 418 1817), with car No. GT 6764-14 driving the white and green coaster; he will be running the 7:10am and 6:15pm, Haatso-Aboum-Atomic Roundabout routes.2. Mr. Samuel Bansah (024 048 7127) will drive the all-white coaster bus with registration number GT 1078-16. He will ply the early morning 6:40am from KFC-Haatso-Aboum-Ashesi. Again, he will run both the 5:10pm and 8:00pm Aboum-Atomic Roundabout-KFC-Atomic-Madina routes.   3. The afternoon schedule remains unchanged.4. We will revert to our regular shuttle services on Friday, May 4th.Thanks for your co-operation. Best regards, ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Ashesi D:Lab Opportunity Desk : Falling Wall Lab 2018", "Message": "Hello All,  Do you have social enterprise or an idea that has the potential to make social impact? Have you practiced or have the capability to rattle the idea off within \"Three Minute\"?  Then, this may be your opportunity to show what you got!!. The German Academic Exchange Service (DAAD) in cooperation with Impact Hub, the Goethe-Institut and the Institute of Statistical, Social and Economic Research (ISSER) with the support of the Federal Foreign Office of German is organizing a session where you get to pitch your ideas and win amazing prizes.  The Ashesi D:Lab Opportunity Desk is organizing an info session to provide support for person or teams who are interested in participating in this program:When? Wednesday 4th April 2018Where? LH 216Time? 2.40pm Please fill your information in the form below if you are interested in participating in the info session On Wednesday.Click here to fill in the form  All ye smart people with innovative ideas, come let's pitch to the world!  Regards, Ashesi D:Lab Opportunity Desk Team      ", "Class": "2"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "AIX Info Session", "Message": "Dear all, The Ashesi Innovation Experience (AIX) brings over 100 high school students to Ashesi in August each year for an exciting, challenging, and enriching experience of a lifetime.Did you know that Ashesi student coaches are instrumental to the success of AIX?•Did you know that AIX is as transformative for the coaches as it is for the participants?•Did you know that AIX gives you the opportunity to apply and reinforce knowledge gained in your major as well in Ashesi’s leadership series?•Are you passionate, enthusiastic, responsible, mature, and dependable?  We’d like you to consider being a coach for AIX 2018. You are invited to an AIX Information Session. Come and find out all about AIX and how to become a part of this adventure this year. When: Wednesday, 14th February 2018Where: Norton Motulsky BTime: 2:40 pmWho: All students Light refreshments will be served To be a part of this, kindly sign up here: https://goo.gl/KmdJkC Check out last years’ experience: https://www.youtube.com/watch?v=7OlEE5HxJb0&list=PLC68pYhLJLvKnjyiapeXM5V0kAyFPeDga  Best regards,---------------------------------- ", "Class": "2"}, {"From": "Kaneisha Gaston Arhin <karhin@aucampus.onmicrosoft.com>", "Subject": "New Hours Alert (Writing Centre)", "Message": "New Hours Alert (Writing Centre)", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "Feasibility Study on Nursery School on Campus - Final year Project", "Message": "Good afternoon Team, This message is sent on behalf of a final year student who is looking at the feasibility of setting up a Nursery  School on campus.        As part of her semester project, she is conducting a study to gain insights on the feasibility of a nursery  school on campus for the wards of staff and faculty and will very much appreciate it if you could  help fill out her  questionnaire.  Kindly use the link below to fill out the questionnaire for this study.  All responses are confidential and will be used only for its intended purpose. Thank you for your cooperation. Link to the form:https://goo.gl/forms/gNuW8vNx9RNH230K3Feasibility Study - Ashesi Nursery Schoolgoo.glTo improve the Ashesi experience for staff and faculty, this survey serves to sample views of the same on the feasibility of a nursery school cited on Ashesi’s campus for their wards. Responses shared are highly confidential and intended only for research purposes. Kindly complete this questionnaire by Sunday November 4th 2018. Thank you.  ", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "coaching and counselling", "Message": "Happy New Year and welcome back, I hope that you had an enjoyable and well-deserved break. Last semester was full of self-discoveries and new challenges for students, staff and faculty.  Whatever your experiences were last semester, it is my wish that you develop a growth mindset moving forward in 2018. With a growth mind-set, you view everything that happens to you as an opportunity for you to grow and develop.Growth and fixed mindsets don’t just apply to our students because we are all students of “life”https://jamesclear.com/fixed-mindset-vs-growth-mindset. The “New Year” is an opportunity to reflect on the past and determine to change and move forward toward the future. Please take a moment to think about how you want to experience your life. We all need a listening ear sometimes, so please don’t hesitate to stop pass the office to discuss whatever is on your heart or in your mind.  I am so happy to inform you that now we have a wonderful addition to our Counselling and Coaching department. Our new counsellor’s name is Ms. Billie Richardson and please call her “Billie’. Friday and Monday sessions can be booked with Billie or me.  If coming into the office is an issue for you for whatever reason, we are willing to convene with you at a mutually designated location on campushttps://ashesicounsellingandcoachingcenter.simplybook.me/v2/       Aunty Deehttps://ashesicounsellingandcoachingcenter2.simplybook.me/v2/          Billie", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Invitation to Class Simulation", "Message": "Dear All, You are kindly invited to the class simulation of Dr. Kwabena Anaman at 9:00am prompt today in Conference Room 209. He will be simulating a class for 30 minutes on the topic below:\"Practical Lessons from the Asian Experience for Ghana's Development\". He will however be focusing on Southeast Asia in his simulation.Kindly make it a point to be present for this session as your feedback is important to our recruitment process.Best regards,Theresa Dei DzanieAssistant Manager- HR│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Ashesi Employee Awards 2018", "Message": "Dear All, The Ashesi Employee Awards is back! The purpose of this is to encourage employee interactions and team spirit at Ashesi. These awards will be given at this year’s End of Year Party. In order to make this fair and fun, employees will be required to vote their preferred candidate for the following categories in the link provided: https://forms.office.com/Pages/ResponsePage.aspx?id=9WHGbQzuDka9tANK6z82cKGAWeAEKclMlg6Oypy9mRhUM0xQRkxMSlNWM0ZTSE9PT0lKNEZUMDNWQy4u  Below are the Award categories:                                                                                                                                                                           Hangout Expert (Staff or faculty who is constantly on the move and knows all the interesting places in town.)1. Innovator of the Year (Staff or faculty who provides innovative and creative solutions to projects or any challenge that arises)2. Eye of the Storm (Staff or faculty who always keep their cool even on a very hectic/stressful day. He/She seems cool, calm and collected even in the midst of a “stormy” day)3. Its 5 O’clock somewhere (The one staff or faculty (apart from the drivers) who is constantly closing before 5am. You usually find them waiting by the bus at 5pm on the dot.)4. Great Conversationalist (The staff & faculty who make great conversation both on and off campus, share very exciting perspectives on issues but with a great sense of humor).5. Always on Time (The one employee who is always punctual for every event6. “Besties” of the year (Two employees who are the best of friends, have each other's backs, look out for each other, spend lots of time together, and are just really good friends.)7. Beach Body (The most fit employee who encourages others to keep fit or live healthy)8. The “SWAG” Award (The office/unit with the most stylish and regularly professionally dressed employees)9. Most Fun (The most exciting unit/office to hang with and brings life to all Ashesi's social events)10. Office Most Beautiful (The employee with the most beautiful, uniquely designed and welcoming office.)11. ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "\"Sparkle for Kids\"", "Message": "Dear All, This came through to me this morning and I felt it will be useful to parents and guardians. Contact is below: Mimi Ellis (Mrs.)Managing DirectorSparkle for Kids Ltd.+233 (0) 248 912 331  Regards,Aba   ", "Class": "2"}, {"From": "Michael Asiedu <masiedu@ashesi.edu.gh>", "Subject": "D-Lab - Ministry of Communication", "Message": "Dear Support Centre,   The D:lab ia part of a network of entrepreneurial hubs negotiating with the Ministry of Communication for better internet for these hubs. The network needs the Digital Address and the GPS coordinate for each Hub to pursue earlier discussions with the Ministry of Communication on providing the last internet Connectivity. Can you help us acquire these information as soon as possible. Please see the form below:   https://goo.gl/forms/4dIFLDQMHbqzt5Ln1   Regards,  Asiedu Michael  Project Coordinator  Foundations of Design and Entrepreneurship (FDE)  Ashesi University College   ", "Class": "2"}, {"From": "Millicent Adjei <madjei@ashesi.edu.gh>", "Subject": "Mandatory Sexual Misconduct Workshop for ALL First Year Students", "Message": "Dear Class of 2022,This is a follow-up to Dean Mahdi's email to you earlier this week about your mandatory sexual misconduct training this Saturday, September 29th, 2018. Below are some important information for Saturday:This is a mandatory workshop for all Freshmen, as such, we will take attendance.•The training will be administered by a team of dedicated faculty, staff and some upper-level students who have been trained and have extensively prepared and committed a lot of time and efforts to this workshop to ensure you are well equipped on this very important topic.•You have been divided into 13 groups of 25 Students each with 2-3 facilitators. Please come by the ODIP notice board bright and early on Friday to check your group number and location for  Saturday.•We will all congregate at exactly 9 am in Norton Motulski for the opening of the training and some housekeeping information before you break into your groups.•The morning session will run from 9 am to 12noon, we will break for lunch (on you) from 12-1pm and resume the afternoon session from 1:15 - 4 pm. We will serve you snacks and water in between.•We will take attendance randomly (at the discretion of the facilitators) so be there throughout the workshop.•We have some really cool giveaways for you when you check in so be sure you have yours.•Do come by the ODIP to talk to me if you have any questions and be on time on Saturday so we can begin and end on time.• ", "Class": "2"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Immigration Regularization-Ghana Card (Non-Citizen ID) and Residence ", "Message": "PermitGood Evening Everyone, Welcome back to campus! It is that time of the year again where all Internationals on campus will have to regularize their stay in Ghana. Please read the information below carefully: A table will be placed by the ODIP (Radichel 211), this table will have two boxes containing two different forms (Residence permit form and the Ghana Card or Non-Citizen ID form (black and white). Filled sample copies of both forms can be found where the table and boxes are placed. Kindly pass  by from Wednesday, September 12, 2018 10:00am to pick up your Ghana Card (renewal/replace/first issuance) and Residence Permit forms. The dates the Ghana Card and Immigration Team will be on campus will be communicated to you all. Cost of Ghana Card Processing for All Internationals (Students and Non-Students)First Issuance: $ 120 / cedi equivalent•Card Renewal: $ 60 / cedi equivalent•Card Replacement: $ 60/ cedi equivalent•Exchange rate will be communicated to you ahead of the exercise. Residence Permit Regularization Requirements2 passport size photographs (Write your name and sign the back of pictures)1. Your original passport2. Photocopy of the Bio-data page of your passport3. Photocopy of your admission letter4. Photocopy of your school fees receipt (if applicable)5. ", "Class": "2"}, {"From": "David Kadeh <dkadeh@ashesi.edu.gh>", "Subject": "Access your monthly pay slips via Employee Self-Service Portal", "Message": "Dear All, Trust this email finds you well. The finance department is pleased to announce a rollout of a new and improved payroll management system to better serve you well. In this regard, you can now as a fulltime employee, access your monthly pay slips  via our secured payroll Employee Self-Service(ESS) portal by following the simple steps below: Register yourself by the following link: https://secure.payspace.com/nextgen/account/register1. Enter your Ashesi email address when prompted, and you will receive an automatic email from payspace to activate your profile2. Register on the system by entering or setting your password. Note this is the password you’ll use to access your payslip at all times so should be kept secured and/memorised.  Note, you can reset your password when forgotten.3. After successful registration, you will see your payslips featured at the right side of your landing page.4. You can then view and download any of your pay slips from January to October 2018.5. You can also access your ESS on your cell phone with data/internet connectivity. Note Google Chrome is recommended.6.  Please feel free to revert to me or contact Nii Nettey on 0243-332724 or nanettey@ashesi.edu.gh  should you experience any difficulty in registering or accessing your pay slips. We are more than willing to assist you navigate your ESS with ease. We have also attached a copy of the manual as a guide in this regard. Thank you, and wish you all the best of the day! DK David Kadeh | Director of FinanceAshesi University College, 1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Tel: +233-302-610-330 ext 1015| Cell: +233-501-260 294Email: dkadeh@ashesi.edu.gh | www.ashesi.edu.gh ", "Class": "2"}, {"From": "Anna Agyirwa Poku <apoku@ashesi.edu.gh>", "Subject": "AIX 2018 Open House & Closing Ceremony", "Message": "Dear Ashesi Community,  On Sunday, 5th August, 132 senior high school students from across Ghana and beyond, arrived at Ashesi for the 2018 edition of the Ashesi Innovation Experience (AIX).  You may have been following their exciting journey on social media; Twitter (#AshesiX, #AshesiX2018) or Instagram (@ashesiix).  In the 12 days since then, they have tackled several design challenges, practised public speaking, explored ethical leadership in a variety of ways, interacted with professionals from diverse careers, had fun, and made good friends.  They are currently working hard on creatively providing solutions and insights into Africa’s problems, creating business concepts, building and programming robots and engineering products to meet customer needs. Please join us this Saturday as we experience and celebrate the students' accomplishments during the AIX Open House and Closing Ceremony. Date: Saturday, 18th August 2018Time: 10 am (Open House (showcase of student work)), 12 noon (Closing Ceremony)Venue: Ashesi University, BerekusoRSVP: https://goo.gl/36vVyX (responses will be appreciated for planning purposes, but not required). We look forward to seeing you on Saturday!!! Best regards,AIX Team      ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Invitation to Class Simulation: Adjunct Faculty", "Message": "Dear All, You are kindly invited to the class simulation of Patrick Dwumfuor (Adjunct Faculty candidate). As part of the recruitment process, he will be teaching the topic, \"Selection Statement\" in Lab 221 at 12:30pm today. Kindly make it an effort to participate in this session as your feedback is important to our recruitment process. Best regards, Theresa Dei DzanieAssistant Manager- HR│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "ASHESI LEO CLUB - TEAM UP TO CLEAN UP", "Message": "  The Ashesi Leo Club in association with the Ahote Sanitation Project and the Legon Leo Club invites you to a Berekuso Clean Up initiative. We take responsibility for our environment and hope for this to be the first of many similar activities. We will be going down the hill to pick up, sweep, rake, and weed with the people of Berekuso and every hand is welcome to come along. Give back to the community, start a trend and build a bond with the people of Berekuso. Join us on this Saturday, the 3rd of November, 2018 by 6 am right down the hill by Charlotte. To be a part of this, please, fill in the form in the link below.https://goo.gl/forms/WN7H4V3HCnUwu1jZ2Team Up to Clean Up Eventgoo.glFill this form to join the Ashesi LEO Club, in association with the Ahote Sanitation Project and the people of Berekuso, in our bid to take responsibility for our environment! The clean-up activity to be held on the 3rd of November will start at 6 am prompt and is projected to be done before the sun comes up, three hours in all. Our hope is that this activity will be one of many communal clean-ups and that we will strengthen our bond with the people of Berekuso even more. (PS: For more information, contact Chinwe on +234 706 056 0968 or Kwabena on +233 24 837 6169)  About the Ashesi Leo Club The objective of the Leo Club is to provide the youth with an opportunity for development and contribution, individually and collectively, as responsible members of the local, national and international community.  Community service remains the cornerstone of the program, fostering a lifetime commitment to helping others. Leo clubs encourage youths to develop leadership qualities by participating in social service activities.  Leo Club members are addressed as \"Leos.\" They conduct various projects in the ", "Class": "2"}, {"From": "Akua Yeboaa Nyarko <anyarko@aucampus.onmicrosoft.com>", "Subject": "Extra Food at Akornor", "Message": "Hi All, There's some food under the canopy at Akornor. Feel free to grab some. Best,Akua.", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "2nd Info Session Tonight: Meet MIT visitors for advice on your Team Project", "Message": "Greetings!  Thanks for all those who showed up yesterday for the info session. For those who couldn’t, there is another info session tonight. Are you working on a project that could benefit from the MIT Lean Research methodology to make it world class? Do you want to meet with some MIT folks to discuss this? Event: Info sessions/Focus Groups•When: Today, Thurs, Nov 29th, 2018•Where: Lecture Hall 216•Time: 4:30-5:30pm •Refreshment: Yes•Facilitators: Libby McDonald, Inclusive Economies Specialist and Lecturer; Kendra Leith, Associate Director for Research, and Lauren McKown, New Initiatives and Partnerships Officer• What is this program about? Ashesi University and Massachusetts Institute of Technology D-Lab are excited to announce a collaboration on a three-year project funded by USAID. The purpose of this collaboration is to achieve three aims (1) To introduce the lean research methodology to the Ashesi Community and train interested members on its use, in an effort to produce knowledge products and case studies with the greater academic and research community in Ghana and beyond (2)  To create an entrepreneurship incubator to develop enterprises with SDGs outcome-driven business models (3) To produce an annual ecosystem convening that brings together key players within the Ghanaian entrepreneurial ecosystem to explore ways of promoting the SDGs in entrepreneurial models.  What does this all mean? The Idea to Impact Project is positioned to help catapult Ashesi University further as a leader in evidence-based solutions to some of Ghana's greatest challenges through the lens of research and the development of ethical entrepreneurs.  Want to know more? Attend the Project Launch on Friday November 30th at 9:00am in Norton Moltoulsky. This event will feature amazing speakers who have launched successful social enterprises including some Ashesi students.  As always feel free to send any burning questions to myself or Jewel Thompson at ", "Class": "2"}, {"From": "Millicent Adjei <madjei@ashesi.edu.gh>", "Subject": "New ODIP Initiatives", "Message": "Dear Students, Faculty and Staff, The ODIP is excited to welcome you back to campus with your energy! Also, happy new year! If you do not have any new year’s resolutions, I would like to suggest one for you: Try something new, especially if you are hoping to see different results! In the spirit of exploring different results for our campus climate, the ODIP is rolling out three major programs which have been thoughtfully put together to help address some of the challenges we have been struggling with as a community. The Host Family ProgramThe Host Family Program is designed to fulfill a twofold objective: i) give international students at Ashesi the opportunity to expand their Ghanaian network throughout their stay in Ghana by offering them a home away from home and ii) grant Ghanaian families who sign up the opportunity to learn about different countries and cultures through the international students they host. Host families will be solicited from families of Ashesi Ghanaian students, faculty and staff, the Ashesi alumni community as well as friends of Ashesi. Watch out for the program launch and more details from our lead Rosemary Kotei Buckman. Also, feel free to email her @rkotei@ashesi.edu.gh or go and have a chat with her at the ODIP to know more. The Allyship ProgramThe Allyship Program seeks to create multiple opportunities for us to get to know each other more deeply beyond the common descriptors assigned to us through our identifiers e.g. President, Dean of Students, Sophomore, Ghanaians, Faculty, Staff ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "National Holiday : Farmers' Day", "Message": "Dear All, Kindly note that Friday, 7th December, 2018 is Farmers’ Day; a national holiday. Do make all necessary arrangements by close of work on 6th December, 2018 to cater for your clients. We will resume work on  Monday, 10th December, 2018. Best regards, Aba K. Enyimayew| Director-Human Resources  Ashesi University1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/    ", "Class": "2"}, {"From": "Samuel Mawuli Anagbo <sanagbo@aucampus.onmicrosoft.com>", "Subject": "Uber Arriving soon on campus", "Message": "Dear All, There will be an Uber on campus in 30 minutes. Please call Odei on 0552878285 if you want to book a journey with him. Best, ----------Samuel Mawuli Anagbo  |Customer Service/HRAshesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330     ", "Class": "2"}, {"From": "Abdul Mahdi <amahdi@aucampus.onmicrosoft.com>", "Subject": "Save the date: Townhall and Charter celebration - Nov 21st", "Message": " Abdul MahdiDean of Students and Community AffairsAshesi University, GhanaTel: +233-302-610-330 | Ext 1001 or +233 302 974 980Cell: +233-50-126-0164Email: amahdi@ashesi.edu.gh  ", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "Launch of \"AshesiMIT: Idea to Impact Project\" powered by USAID", "Message": "Greetings, You do not want to miss the launch of the historic collaboration between “two of the best schools in the world” (an actual Tweet response we received) on Lean Research and a graduate incubator inspired by the MIT Scale-Ups Program.  Event: AshesiMIT: Idea to Impact Project powered by USAID•When?: Friday Nov 30th, 2018•Where?: Norton Motulsky Hall, Ashesi University•Time?: 9am •RSVP: http://bit.ly/ashesimit • Want to also meet the 3 visitors from MIT D-Lab to learn more?  Libby McDonald, Inclusive Economies Specialist and Lecturer; Kendra Leith, Associate Director for Research, and Lauren McKown, New Initiatives and Partnerships Officer, will be on campus all week from Tues Nov 27th – Fri Nov 30th  You can meet them at the launch event on Fri Nov 30th or at the following two events: Info sessions/Focus Groups: Weds, Nov 28th and Thurs, Nov 29th from 4:30-5:30pm in Lecture Hall 216•Lean Research Workshop on Nov 30th at 1:30pm. Emailjthompson@ashesi.edu.gh for admission• Still Reading? …Ashesi University and Massachusetts Institute of Technology D-Lab are excited to announce a collaboration on a three-year project funded by USAID. The purpose of this collaboration is to achieve three aims (1) To introduce the lean research methodology to the Ashesi Community and train interested members on its use, in an effort to produce knowledge products and case studies with the greater academic and research community in Ghana and beyond (2)  To create an entrepreneurship incubator to develop enterprises with SDGs outcome-driven business models (3) To produce an annual ecosystem convening that brings together key players within the Ghanaian entrepreneurial ecosystem to explore ways of promoting the SDGs in entrepreneurial models.  ", "Class": "2"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "2018 Career Fair", "Message": "2018 Career Fair", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Conference Invite to the Community", "Message": "Dear Ashesi Community,  The D:Lab Conference Team brings to you the first end of semester Design Lab Conference tomorrow, Wednesday, 25th April, 2018 at the McNulty Foundation Design Lab from 2:40pm to 4:20pm The D:Lab Conference is an initiative to make the Ashesi Community and guests aware of the impactful projects running in the D:Lab. It is a celebration of the milestones reached by these projects during the semester.  Come and learn more about projects running in the D:Lab.     Best regards, D:Lab Conference Team", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "Ashesi Leo Club - Breast Cancer Scree", "Message": "                                                      BREAST CANCER AWARENESS October is here again!!! It is the Breast Cancer Awareness Month.  The Ashesi Leo Club presents the Breast Cancer Awareness Week. Beginning from Monday 8th October to Friday 12th October at 3pm to 6pm each day, We will be going to the Berekuso town to educate the townsfolk on the signs and symptoms of breast cancer and detection methods. We would also be partnering with Sena Anku Memorial Foundation to organise a screening exercise on the Friday for the women to be checked.  If you would like to join us fight against breast cancer, kindly fill out this form using this link https://docs.google.com/forms/d/e/1FAIpQLSdi_xxdkvav7pdu2e-b5_fOmvidacfvN9AJTIZQR-NErJG9Lw/viewform                                                     POEM FOR PINK AWARENESS Are you good in expressing your feelings in words?Do you want to tell a story through writing? If you answered Yes to any of these questions, then join the Ashesi Leo Club in the month of October to create awareness on Breast Cancer by writing a Poem for Pink Awareness.  If you would like to write a poem to commemorate this event please fill this form using this link  https://docs.google.com/forms/d/e/1FAIpQLSd0ooDy1W_JUxuWADcTIDfibyyq3J1itCyi05MRc4hlakj80w/viewform ", "Class": "2"}, {"From": "Frances Awua-Kyerematen <fakyerematen@aucampus.onmicrosoft.com>", "Subject": "Caught Being Good!", "Message": "Good Afternoon everyone, “When you are kind to others, it not only changes you, it changes the world” – Harold Kushner  The Office of Students and Community Affairs will host its first ‘Caught being good’ luncheon of the year on January 31st  2018 this semester . We would like to acknowledge students and celebrate every day actions that make a positive impact in our community. Our goal is to encourage students to do good every day and live out the values of  Ashesi . Here is a link to nominate students caught being good -  https://goo.gl/forms/Uy6xMxevXT8TZHs43  Please submit your nominations by January 24th, 2018 and shine a light on people who have done something good, something nice or something kind. Best Regards, Frances  Frances Awua-Kyerematen | Associate Director, Students Life and EngagementAshesi University College, 1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Tel: +233-302-610-330 ext 1043| Cell: +233-501-550-133Email: fakyerematen@ashesi.edu.gh | www.ashesi.edu.gh ", "Class": "2"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Gender Inequality in the Workplace- A Student Intern's Perspective", "Message": "Good morning Everyone, Listen to Me is a student-run initiative with a focus on helping to make students more socially aware of the environment around them. The aim of the program is to enhance the experience members of the community, through embracing the diversity around them. The objective is to get people from different walks of life, to understand what it is like to be in another individual’s shoes. Next week, for the next edition of HARDTalk, we bring to you Listen to Me. Date: Wednesday, April 18, 2018Time: 2:40 to 4:00pmVenue: Jackson Hall 116 \"I believe that in order to create a society, where more people can be happy, we have to understand that all men, women and children are created equal. Society has put minorities (often women/children) below men, by this I mean to say that women are not treated the same way as men and that is because society has created this image of women,  to serve the sexual desires and needs of men. This must change! In order to do so, we need to create a system where women are paid equally as men,  for the same kind of work that men do, and more importantly, create an environment that doesn't blame women for being the reason for the acts of sexual assault committed against them.\"  - the Student Intern", "Class": "2"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "Ashesi represented at Communications and African Studies Conferences", "Message": "Dear colleagues, Hope this email finds you well.  I am writing to inform you I am presenting the preliminary findings from my newest research project on politically motivated internet shutdowns and disturbances at two conferences this month.International Communication Association (ICA) BIENNIAL Africa Regional Conference (7-9 Nov at University of Ghana)1. 61st Annual Meeting of the ASA (29 Nov- 1Dec in Atlanta, Georgia, US)2.  This means I will, unfortunately, be away from the class room on 8th and 29th Nov, however, my competent colleagues have agreed to fill in for me. Thank you. If you are interested, you can read more about the project below and on the notice board outside my office.   Warm regards,Kajsa  The increase of politically motivated Internet Shutdowns in Africa: Lessons from democracy research and activism Recent elections or political turmoil where shutdowns have been an issue: Cameroon (October), Mali (August), Ethiopia (Six-month state of emergency since February), Chad (April). African governments have threatened to shut down the Internet for political reasons numerous times over the last years. According to Quartz (2018), 9 countries experienced intentional internet or mobile network disruptions in 2017.  Cameroon experienced the longest shutdown in 2017 of 93 days, Ethiopia’s internet has been fraught with trust issues from the beginning, and prior to the 2016 elections even ‘donor-darling’/liberal Ghana threatened Internet shutdown. On the continent organizations such as International ICT Policy for East and Southern Africa (CIPESA), Access Now, NetBlocks and Internet sans Frontiers have taken up the issue of ", "Class": "2"}, {"From": "Ashesi Student Council <studentcouncil@aucampus.onmicrosoft.com>", "Subject": "Are You Ready?", "Message": "Are You Ready?", "Class": "2"}, {"From": "Romel Ofoe Chachu <romel.chachu@ashesi.edu.gh>", "Subject": "Organizational Behaviour Class Talk is TODAY!", "Message": "Dear All:The  guest lecture by Mr. Emmanuel Agbettor, The Executive Director of the Institute of Human Resource Management Practitioners (IHRMP), is happening today.    Topic: \" What Employers Expect from Employees\" Date & Time: Monday 16th April 2018 from 4:20pm - 5:50pm Location: Norton Motulsky 207A We look forward to seeing you there!   Romel Ofoe ChachuFaculty InternOrganizational Behaviour and Operations ManagementMob: +(233)200916639 Whatsapp: +(233)278147908Email: romel.chachu@ashesi.edu.ghPrivate email: romel.chachu@gmail.com ", "Class": "2"}, {"From": "Sena Agbodjah Agyepong <sagyepong@ashesi.edu.gh>", "Subject": "Invitation to an Entrepreneurship panel", "Message": "Dear Community,The Capstone Entrepreneurship session will like to extend an invitation to an entrepreneurship panel aimed at discussing entrepreneurial opportunities within the various spaces that they work in.For seniors, this panel could shed some light on what you are exploring for your capstones so do stop by!S   Dr Sena Agbodjah Agyepong (MGhIS PMP)Senior Lecturer, Entrepreneurship, Real Estate Development and Project Management.Project Lead, Business Academy of the Next Generation Cocoa Youth Program, MASO (http://www.masogh.org/maso-business-academy/)Admissions & Entrepreneurship Lead, Ashesi Innovation Experience (https://www.youtube.com/channel/UC0lK_GedB0czNFgQwVFn7KA)Coordinator, Capstone Entrepreneurship Session Department of Business Administration  I  Ashesi University I  1 Berekuso Road  I  Berekuso  I  Ghana.PMB CT3, Cantonments  I  Accra  I  Ghana+233 (0) 302.610330 Ex. 1058www.ashesi.edu.gh  I info@ashesi.edu.gh Latest story ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "ASHESI LEO CLUB - BREAST CANCER AWARENESS AT BEREKUSO", "Message": "                                                 BREAST CANCER AWARENESS October is here again!!! It is the Breast Cancer Awareness Month.  The Ashesi Leo Club presents the Breast Cancer Awareness Week. Beginning from Monday 8th October to Friday 12th October at 3pm to 6pm each day, We will be going to the Berekuso town to educate the townsfolk on the signs and symptoms of breast cancer and detection methods. We would also be partnering with Sena Anku Memorial Foundation to organise a screening exercise on the Friday for the women to be checked.  If you would like to join us fight against breast cancer, kindly fill out this form using this link https://docs.google.com/forms/d/e/1FAIpQLSdi_xxdkvav7pdu2e-b5_fOmvidacfvN9AJTIZQR-NErJG9Lw/viewform                                                     POEM FOR PINK AWARENESS Are you good in expressing your feelings in words?Do you want to tell a story through writing? If you answered Yes to any of these questions, then join the Ashesi Leo Club in the month of October to create awareness on Breast Cancer by writing a Poem for Pink Awareness.  ", "Class": "2"}, {"From": "Ashesi Student Council <studentcouncil@aucampus.onmicrosoft.com>", "Subject": "ASC Week Picture Frames", "Message": " Pass by outside LH 216/217 and take a picture or selfie, & post on social media using the hash tag #ASCWeek2018          Get Outlook for Android      ", "Class": "2"}, {"From": "David Asumadu-Boateng <dboateng@ashesi.edu.gh>", "Subject": "Short Leave", "Message": "Hello, I wish to inform you that I will be on leave from today, Wednesday 7th March to Wednesday, 14th March 2018. Kindly see Daniel Nii Botchway or Gabriel Odu Jnr for assistance in my absence.   Have a great day! Best regards, David Asumadu - Boateng | IT DirectorAshesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1031M: (0)501331664dboateng@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "Wellness Wednesday is here!!!", "Message": "Beautiful people, The final Wellness Wednesday of the semester is here! Here is the outline of the day: Food and healthy products vendors available on campus(8:00 am to 5:00 pm)•Fitness Challenge progress update(11:00 am to 5:00 pm) and sign up for 2019 Challenge•Massage at the health center (10:00 am to 5:00 pm)•Decathlon on campus (10:00 am to 5:00 pm)•Come out and treat yourself to a taste of Wellness.Aunty DeeDiane DavisDirector of Counselling and Coaching Ashesi University College1 University Avenue, Berekuso E/RPMB CT3 CantomentsAccra, Ghana. Tel: +233 30 261 0330 Ext: 1057 Cell: +233 50 156 9909  ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Uber Arriving on Campus soon", "Message": "Dear All, There will be an Uber on campus in the next 15 minutes. Kindly call the driver (Confidence) on 0559400743 if you need a ride back to town. Regards, Theresa Dei DzanieHR Coordinator│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Michael Quansah <mquansah@aucampus.onmicrosoft.com>", "Subject": "", "Message": "", "Class": "2"}, {"From": "Millicent Adjei <madjei@ashesi.edu.gh>", "Subject": "Big Request", "Message": "Good Evening David, I hope you've had a good week. I have a REALLY BIG request. We have a sexual misconduct training all day tomorrow for all our Freshman class and have secured the under-listed rooms for the 13 groups and would need to ensure that all the projectors in the rooms are working as the entire training is on PowerPoint. D&B Jackson 1151. D&B Jackson 1162. D&B Jackson Lab 2213. D&B Jackson 2224. Databank Foundation 2185. Nana Apt Hall 2166. Nana Apt Hall 2177. Radichel Hall MPR8. Room 2029. Room 20410. Research Building 21611. Research Building 11512. Design Lab13.   I will be grateful if a member of your team can be on campus to help us in case we encounter any challenges. We have an amazing team of student volunteers who will be around and ready to support the facilitators and are ready for your team to equip them to support their groups. I know this is last minute and I sincerely apologize, there has been many moving parts to this training that we did not consider. I will be very grateful if we can get this support.", "Class": "2"}, {"From": "Edwin Adatsi <edwin.adatsi@aucampus.onmicrosoft.com>", "Subject": "APPRECIATION FOR SIGNING OUT WITH US", "Message": " Dear Beautiful,   The Ashesi Student Council would like to our deepest appreciation for the turn out and the support for the Ubora Awards which took place on Saturday at the Unique Floral Events Centre.  We came together and celebrated excellence amongst us, the community. Congratulations to all our award winners and nominees. We appreciate your efforts in our community. Continue to make strides!  All the very best in your final submissions and exams this week and the next !  Feast your eyes (more to come)--->         ...  Edwin Adatsi The President | Ashesi Student CouncilBsc. Computer Engineering | 2019Tel: +233 20 913 3593 | edwinadatsi00@gmail.com \"Most people tip-toe through life hoping to make it safely to their deaths - Earl Nightingale\"", "Class": "2"}, {"From": "Gabriel Odu Jnr <godu@ashesi.edu.gh>", "Subject": "Out of Office.", "Message": "Dear all, I will be on leave starting November 26, 2018, to December 11, 2018. Kindly direct all queries to David [dboateng@ashesi.edu.gh] Best regards. -----------------------------------------------Gabriel O. Jnr.  | Network Security OfficerAshesi University1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAE:  1065godu@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "2"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "2018 Ashesi Career Fair - Attending Companies", "Message": "Hello All, Please see below the list of companies attending this year’s Career Fair. We have 87 in total across several industries. Date: Wednesday, 14th March 2018Time: 10am – 4:30pm (Company set up and registration starts from 7am)Venue: Ashesi University 1Access bank (ghana) plc2Africa foresight group ltd.3Aftown4Akus consult5Alliance francaise accra6Alpha beta education centres7Apex shipping & commercial co. Ltd8Ashesi innovation experience9Aviation alliance limited delta air lines gsa - ghana10Axis human capital limited11Aytech power and control systems limited12B.a.s.i.c.s international13Barclays bank ghana limited14Bld consult15Blue rose limited16Bm construction17Burro18Chalkboard education19Challenges worldwide20Childaccra health21Citsys company limited", "Class": "2"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "International Opportunities for Staff", "Message": "Dear colleague, I hope you are well. Ashesi is a member of the Global Liberal Arts Alliance (GLAA) and as the liaison for our campus, I'd like to invite you to start thinking about linking up with a similar department at one of our sister universities.  Please see a full list of Partner universities here (30 in number) here: http://liberalartsalliance.org/members Universities we already have good connections with /MOUs with include:Kenyon College (US)•The College of Wooster (US)•Kalamazoo College (US)•Al Akhawayn (Morocco)•The American University of Paris (France)•International University of Grand-Bassam (Ivory Coast)• To get the ball rolling, you can research which university is doing interesting things in your field (eg. Student Affairs, Accounts, Program Coordinators, Health). When you discover something of interest to you, do contact me (please keep our HR department in copy) and I will try and pair you up with a colleague in that university. Also, think about what you can contribute and teach them! We hope there can be an initial sharing of information, mentoring, skype meetings and so on. The GLAA also supports travel costs for visiting partner institutions under the Inter-institutional visit program which could be the next step. From my engagement with GLAA colleagues working in other countries, I know how enriching the experience can be, hence I would like to encourage you to begin to make your department global!  I'd also like to thank Aba and Theresa in the HR department for initiating this process for the benefit of all ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Bus Schedule: 2nd January to 5th January, 2018", "Message": "Dear All, I hope you had a restful break. Kindly note the bus arrangements for this week (2nd January- 5th January, 2018) below: 7am Bus starting from Christ the King •7 am Bus starting from Haatso KFC• As such there will be no early bus. Happy new year and see you tomorrow! Best wishes, Theresa Dei DzanieHR Coordinator│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "Wellness Wednesday", "Message": "Hi Ashesi family, This Wednesday is Wellness Wednesday!!!!!!! It’s “How is your Heart ”day. Think about your answer cause you will be asked this question all day. We will have:Fruit khebabsSaladsHealthy sandwichesJuice barMassageSports equipment from Decathlon Come and enjoy the day!!!                                                                        Aunty DeeDiane DavisDirector of Counselling and Coaching Ashesi University College1 University Avenue, Berekuso E/RPMB CT3 CantomentsAccra, Ghana. Tel: +233 30 261 0330 Ext: 1057 Cell: +233 50 156 9909 ", "Class": "2"}, {"From": "Michael Quansah <mquansah@aucampus.onmicrosoft.com>", "Subject": "Join us at Homecoming is this Saturday!", "Message": "Good afternoon,  Here's a quick note to remind you about Homecoming this Saturday (24th of November).  This will be a great opportunity to welcome back our alumni, old friends and their guests.  As part of this, we have a mix of exciting activities lined up throughout the day, and everyone is welcome to be a part. From Masterclasses to sporting activities to a theatre production, the day promises to be a fun experience.  To get a sense of the day’s schedule and how you can participate, kindly fill out this form.  Additionally, as part of Homecoming, we have arranged nursery and child minding services with fun and kid-friendly activities for those who would like to come with their young children. Just indicate this on the registration form. Transportation arrangements will also be available: we will communicate the pick-up stops shortly.  In the spirit of Ashesi  ----------------- ---------- Michael Fiifi QuansahAlumni and Public Relations OfficerAshesi University 1 University Avenue, Berekuso - E/R PMB CT 3 Cantonments, Accra, Ghana Email: mquansah@ashesi.edu.ghTel: +233-302-610-330 ext 1038| Cell: +233- 50 150 9155Ashesi: Website  | Twitter  | Facebook  |YouTube | Google+", "Class": "2"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "Lost and Found", "Message": "Hello, If you happened to have dropped your money a few minutes ago, please come in to Radichel Hall 102A to pick it up. Thank you. Kind regards, Dzifa   ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "OPPORTUNITIES AT ASHESI UNIVERSITY", "Message": "  #SLE INITIATIVE Have you wondered how to become a work study personnel at the Library, Career Services, Health Centre or  getting the opportunity to attend the Harvard Model UN Conference in Boston? Did you know that you have the opportunity to apply to be a Resident Assistant or even apply to work at the  Ashesi Shop sometime in your student life and be paid for your services?  The Resident Assistants for the 2018/2019 academic year on the 21st of November 2018 would be organising  an Opportunities at Ashesi Fair, displaying all the opportunities available to students from freshman year to  senior year.  These stands would display opportunities ranging from the following departments: Career Services•Office of Diversity & International Programs (ODIP)•Academic Advising•Students Life & Engagement•Health Centre•Coaching and Counselling •", "Class": "2"}, {"From": "Enoch Agonyo <eagonyo@ashesi.edu.gh>", "Subject": "Instrumentation Project Presentation", "Message": "Sending on behalf of Miss. Heather Beem. Hello everyone, The engineering students taking the Instrumentation course will be presenting their final projects Tuesday, April 24th in the Science Lab. Groups will be presenting from 11:20-1:20 and 2:20-4:00.   Everyone is welcome to join for any portion! Each group will present for 5-7 minutes, so you can pop in for a couple of presentations, when you are free.Students were tasked to design and build a sensor related to health. Projects include:Heart Rate Sensor, Sweat Sensor,Light Sensing Glasses,Baby Crying Monitor, and more! This promises to be exciting. Hope to see some of you then. Heather RegardsEnoch Kofi AgonyoPrograms Coordinator | Engineering Department Ashesi University CollegePMB CT 3, Cantonments, Accra-Ghanahttp://www.ashesi.edu.ghTel:+233(302) 610 330 / 0302974980 Ext: 1091  eagonyo@ashesi.edu.gh    ", "Class": "2"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "Ashesi Economic Lecture Series", "Message": "Good afternoon all,The Ashesi Economic Lecture Series will host Professor Phillip Jefferson, Centennial Professor of Economics at Swarthmore College. Prof. Jefferson will present on the topic “Global Poverty in Historical Perspective”, and will draw from his new book Poverty: A Short Introduction. This AELS is scheduled for:Date: Wednesday, 17th October 2018In: Nana Araba Apt hall (LH 216)From: 3:00pm – 4:30pm (Faculty Free Time) See below a bio of Prof. JeffersonPhilip Jefferson is a former research economist at the Federal Reserve Board of the USA and currently teaches Macroeconomics and Econometrics at Swarthmore College in the USA (the alma matter of both Patrick Awuah and Stephen Armah).At Swarthmore, apart from conducting research, Prof Jefferson teaches courses in econometrics, macroeconomics, inequality, and poverty. His recent research has delved into such issues as the role of education as a buffer against unemployment, the effect of business cycles on poverty rates, racial diversity in economics and the distribution of income between labor and capital.Years before current debates on whether raising interest rates would stifle labor markets, Jefferson created a straightforward model to analyze the quandary. Anticipating today’s discussions of declining labor share by nearly a decade, he confirmed the trend’s reality. He’s also explored arcane matters involving seigniorage payments, transformation parameters, and monetary neutrality. Each study is characterized by clear questions, careful technique, consideration of alternative definitions and explanations, and strong but qualified conclusions.Jefferson, whose research has been funded by the National Science Foundation and who served as president of the National Economic Association in 2005, can also provide expert commentary on the Federal Reserve and the monetary policy making process.", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "What to look out for in the D:Lab This Week", "Message": "Ashesi D:Lab Content Series: Season 1, Episode 3A.  Hello All,Have you heard of the design thinking process? Do you know what it entails? Would you know how to go about a design thinking project? What? – The Design Thinking Content Series powered by the Ashesi D:LabWho?- Desmond Jesse MensahWhen? – Wednesday, 14th February 2018Time? - 2:40 pm - 4:00pmWhere? - McNulty Foundation Building Design  Lab The topic for this week? -   10 Tools for Design Thinking The Ashesi D:Lab is introducing a Design Thinking Content Series for the whole Ashesi community and DLAB online users that will introduce the design thinking process to those not familiar with it and serve as a great way to go deeper for those who know of it. The most exciting thing about the DT Content Series is that it is co-developed with but taught by students! About our Speaker:  Desmond JesseDesmond Jesse is a student at the Ashesi University College where he is majoring in Electrical and Electronic Engineering. His interest in engineering spouted from his love for innovation and strategic development. He hopes to establish his own high school and college in the next 15 years should Jehovah bless him to that long. As a student in Ashesi he has come to appreciate the knowledge he gained studying DT hence have started a project with some peers where they implement some of those acquired knowledge.  He is glad to share how he has applied DT in his personal development . Stay tuned for weekly announcements of the content series. Isatou Jallow- Management Intern Content SeriesAshesi University CollegeBusiness AdministrationClass of 2019 Ashesi D:Lab Farm Modelling ProjectB.  i)                    Tuungane Cosmopolitan Gardening", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Last Chance to Apply for the Accra UNICEF Hackathon!", "Message": "Ashesi D:Lab is hosting a full day sprint around the Sustainable Development Goals for UNICEF! We are calling all youth and teams who have thought about or done work about their ideas to participate in a sprint workshop tomorrow, Saturday, October 20th at Workshed (Nungua Link Road Baatsona, 47 Spintex Rd, Accra) at 9:00AM! APPLY HERE: http://bit.ly/accraunicefhackathon or email us at Dlab@ashesi.edu.gh Accra UNICEF Hackathon Applicationbit.lyA bus will be leaving from Ashesi at 7:00AM sharp!  As part of the theme \"Partnership with Youth to Achieve the Sustainable Development Goals\" for the summit that aims at showcasing how young people are using technology to tackle social issues to help achieve the Sustainable Development Goals. This hackathon aims to develop solutions that employ child centered approach towards finding solutions to problems around SDGs 3 (Good Health & Well Being), 4 (Quality Education), 5 (Gender Equality), 6 (Clean Water & Sanitation), 8 (Decent Work & Economic Growth), 10 (Reduced Inequalities), and 13 (Climate Action). Seeking youth under 24 years old with any technical skills like website creation, graphic design, engineering, etc. Date: Saturday 20th October 2018Venue: Workshed (Nungua Link Road Baatsona, 47 Spintex Rd, Accra)Time : 9:00am - 4:00pm Ashesi D:Lab1 University Ave, Berekuso ", "Class": "2"}, {"From": "Rosemary Kotei <rkotei@ashesi.edu.gh>", "Subject": "Looking for and International Internship During the Summer?: Apply for the ", "Message": "Providence College Community Based Student Project 2018: Dear All, Providence in Ghana Maymester INT 379 with Community Based Student Project 2018 Providence College and the Department of Engineering Physics Systems every year organizes a the faculty-guided Providence in Ghana Maymester program for 2018. This program involves students of Providence College working with students from Ashesi University, the Engineering Department of University of Ghana, Legon and Radford University to build prototypes designed by Providence College students to solve problems in rural areas in Ghana. The program is a two week long internship beginning on  May 21st   to June 2nd, 2015 This year’s program will emphasize:-rural school WASH-appropriate technology for improving literacy rates in rural schools and-the S-Lab’s WASH+E program - inexpensive- effective- interventions to improve water,·       ", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "On Barbershop Signs", "Message": "Dear All: I was recently interviewed on Ghanaian barbershop signs for this publication. Check it out:https://www.atlasobscura.com/articles/ghana-artists-paintings-wooden-signsCelebrating Ghana’s Amazing Handpainted Barbershop Signswww.atlasobscura.comNext to the Suame police station in Kumasi, Ghana, just near the roundabout, is Kwame Akoto’s art shop. It’s hard to miss. The storefront is decorated with French, American, and Ghanaian flags, and near the entrance there’s a picture of the American actor, Gordon Scott, best known for his role ...    Joseph Oduro-Frimpong, Ph.D. Assistant Professor Department of Arts and Sciences Ashesi University 1 University Avenue, Berekuso, E/R PMB CT3 Cantonments Accra, Ghana joduro-frimpong@ashesi.edu.gh", "Class": "2"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "2018 Career Fair Companies and Programme", "Message": "Hello Everyone, 1.       Please see below the FINAL list of companies attending this year’s Career Fair. We have 93 in total across several industries.2.       Also find attached the programme for the day. 1.ACCA (Association Of Chartered Certified Accountants)2.Access Bank (Ghana) Plc3.Africa Foresight Group Ltd.4.Aftown5.Agro Ecom Ghana Ltd6.AKUS Consult7.Alpha Beta Education Centres8.Apex Shipping & Commercial Co. Ltd9.Ashesi Innovation Experience10.Aviation Alliance Limited Delta Air Lines GSA - Ghana11.Axis Human Capital Limited12.Aytech Power And Control Systems Limited13.B.A.S.I.C.S International14.Barclays Bank Ghana Limited15.BLD Consult16.Blue Rose Limited17.BM Construction18.Burro19.Chalkboard Education20.Challenges Worldwide21.CHILDACCRA Health22.CITSYS Company Limited23.Conciergedocta", "Class": "2"}, {"From": "Michael Asiedu <masiedu@ashesi.edu.gh>", "Subject": "Ashesi D:Lab Blockchain Hackathon Info Session", "Message": " Greeting Ashesi Community!    The Ashesi D:Lab Blockchain Hackathon Team will be kicking off their maiden event leading up to the Blockchain Hackathon (Set for May, 2018) this weekend.  The team is organizing their first info session on Saturday 17th February 2018 at the iSpace Foundation in Accra at 1:00pm. This is to give opportunity to the general public, stakeholders, prospective participants and interested persons to learn more about the Blockchain Hackathon and register to be part of it in May. Please visit https://dlabhacks.com for more information about this year’s challenge. Reply to Joseph Peter Brown-Pobee (joseph.brown-pobee@ashesi.edu.gh), if you are interested in attending or participating. Blockchain Hackathon 2018 - dlabhacks.comdlabhacks.comVENUE & DATES. Having a world class, high impact Hackathon is very important to us. We are constantly making it bigger and would communicate dates as soon as all the ...    Asiedu Michael  Project Coordinator", "Class": "2"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Summer Bus Schedule from Monday, May 28th", "Message": "Hello everyone, We wish to bring to your attention that, starting from Monday, May 28th, we will be running three (3) shuttles as shown below:   The regular 7:00am departure from CTK-37-Airport-Shiashi-Madina-Kitase route remains unchanged. This route will be driven by Eric Tetteh MacCarthy using the blue/white coaster bus with registration No. GX 1834 17;1.  Meanwhile, Kenneth Amoafah using the green and white bus with registration No. GT 6764-14, will ply the Atomic-KFC-Haatso-Atomic Roundabout-Aboum route using the following schedule:2. Atomic Junction at 7:00am prompt;a. KFC Shell Filling Station (Legon Botanical Garden): 7:05amb. Haatso Total Filling Station: 7:10am;c. ECG near Atomic Police Station: 7:15am;d. Atomic Roundabout: 7:20ame. Aboum Shell Filling Station: 7:30am;f. Comet Housing: 7:40am;g. Berekuso Township: 7:45amh. Ashesi University Campus: 7:50am.i.  1:15 pm regular schedule.3.  Do ensure you are punctual at each designated pick up points to avoid being left out. Thank you,Anna.", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "", "Message": "", "Class": "2"}, {"From": "Bridgette Abakah <babakah@ashesi.edu.gh>", "Subject": "PINKTOBER- Breast cancer awareness month", "Message": "  Dear All,  October is PINK,  the month of October is dedicated to breast cancer awareness.   The health center will be open for breast examination every Friday from 10am to 4pm.Join us on the 24th of October as we bring you PINKTOBER day. This day will be marked with the followingA talk on breast cancer by the Korle bu breast unit team1. A full day dedicated to breast cancer screening2. photo booths3. Games4. a chance to win breast cancer souvenirs5. It promises to be a exciting PINKTOBER,Get you pink shirts and dresses ready to join the Campaign Regards Bridgette Abakah|Nurse Administrator- Ashesi Health Services  Ashesi University 1 University Ave, Berekuso-E/R PMB CT 3, Cantonments, Accra GHANA Tel: 0501331668, 0248883211 babakah@ashesi.edu.gh  ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "Ashesi Hult Prize 2018", "Message": "  You can become the next superman with $1,000,000 in your hands to save the world,   with absolutely no wings involved! ASK ME HOW!Ashesi University has been selected as one of the campuses to host the local Hult Prize competition right here on campus!You can bypass 50,000 applicants by entering the on-campus competition. The winner of the intra-campus event qualifies to compete in one of fifteen regional finals in selected cities worldwide. The winning team from each host city will progress to the accelerator stage where they build their network through mentorship, participate in advisory and strategic planning sessions as they create prototypes. Ultimately, the global finals allow your team to stand a chance of winning $1,000,000 in start-up capital for the business idea generated, whilst changing the world.This year’s theme is centered on youth unemployment, as Hult prize continually seeks to tackle issues surrounding the United Nations Sustainable Development goals. A grounded business idea is NOT required to participate in the Hult Prize, as the objective is to build the next big start-up, not necessarily to identify it.Can you build the foundations of a venture that will provide meaningful work for 10,000 youth within the next decade?Did I hear a yes? Then you are absolutely invited to participate in this year’s challenge in teams of 3-4 if you are a student. IT IS ABSOLUTELY FREE TO ENTER THIS COMPETITION! Need I say more? Let’s help you accomplish your superman agenda as you register for the competition through this link: http://www.hultprizeat.com/ashesi Applications are open.  Watch this space for more information from the campus ", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "wellness wednesday", "Message": "wellness wednesday", "Class": "2"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "Lost and Found", "Message": "Hello, If any of these items below belong to you, kindly pass by Radichel 102A to pick them up. Kind regards, Dzifa       Get Outlook for Android ", "Class": "2"}, {"From": "Bridgette Abakah <babakah@ashesi.edu.gh>", "Subject": "HIV screening, The Ashesi Perspective...", "Message": " Dear All,Hope this mail finds all well, The Ashesi Peer Educators have been surveying campus asking their friends about their perceptions on getting checked for their HIV status. Kindly find attached the link to the video and the exciting and interesting responses we had. However, have you checked your HIV status?????????https://drive.google.com/file/d/1Bv2St1CfXcsNQqQzlkSNtQbGmdy21yKO/view?ts=5a8de7c2Video_20180221130338162_by_videoshow.mp4drive.google.com\"Access to HIV testing and medicines should be dramatically accelerated in order to reach the goal of ending AIDS by 2030. HIV testing is still limited, as an estimated 40% of people with HIV or over 14 million people remain diagnosed and don't know their infection status\". As part of ensuring a healthy Ashesi community, the health team brings you HIV SCREENING SESSION THIS FRIDAY!!!!!!!!!!!!!!   ", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "Opportunities for You to Get Involved in D:Lab Programs This Week", "Message": "Hackathon Radio Feature: On Tuesday 6th February, Citi FM interviewed our D:Lab Founding Lead, Dr. Gordon Adomdza and the Ashesi D:Lab Management Intern for Hackathons Yoofi Brown-Pobee on “Blockchain Applications Beyond Bitcoin & Cryptocurrency” ahead of our major D:Lab Hackathon event that will be happening on 12th to 13th May 2018A.  Ashesi D:Lab Farm Modelling Project:B.  Hydroponics project: Activities and milestones for the week1. On Monday, we redesigned the Hydroponics Internet of Things (IoT) design. On Wednesday, we will be discussing on the design of the physical structure and begin the building process. We will also implement the sensing of the IoT. Finally on Friday, we will complete the hydroponics project structure and begin the work on plumbing. On the same day, we will start the implementation process of the internet communications for IoT. Vertical Farming Initiative:2. This week, the team will be working on finishing the treatment of wood, drill holes and finally cutting of the bottles on Friday. Tuungane Cosmopolitan Garden3. Last week, the team successfully installed a water tank that will be used to store water to irrigate the crops. The tank was purchased by the D:Lab and was mounted by the Tuungane Team. We will embark on watering the kales, onions, and garden eggs in our nursery bed. We will also be filming on our farm how agriculture is done in different African countries. Maker Skills Session:C. This week, the team will be building a storage tank that would be used to help farmers store their harvest. Ashesi D:Lab MediaD. This week, the media team will be doing a photoshoot of the D:Lab Team members.Take a look at the D:Lab’s First ever documentary and get to know the Interns: https://www.youtube.com/watch?v=xHumefpw6Ec&t=58s Opportunity DeskE. The Opportunity Desk team has an info session on Friday at 11:20am for the http://ubora-biomedical.org/design-competition-2018/ to enroll teams that are interested.", "Class": "2"}, {"From": "Mawuli Adjei <mawuli.adjei@ashesi.edu.gh>", "Subject": "StoryTellers Presents: By The Fireside", "Message": "Dear all Tomorrow at 6pm, a team of students who’ve been building their storytelling skills, are opening up to the entire community and sharing their work with you. There’ll be ambient lights, a soothing atmosphere and stories to be shared. You wouldn’t want to miss it. For anyone who needs a little teaser of what the team can do, follow the links to the youtube videos below. You can thank me later. Cecil Hudson - Story 1Efua Boham - Story 2 See you there…  Mawuli Adjei Faculty Intern Ashesi University College ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Out of Office", "Message": "Dear All,I will be out of office today. Kindly contact Theresa Dzanie for anything you may need from the HR department.  Regards,Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "2"}, {"From": "Hiickmat Nasara Abdulai <hiickmat.abdulai@ashesi.edu.gh>", "Subject": "Hult Prize - Winner Announcement and Advancement to Regional Finals", "Message": "  RegardsHiickmat Nasarah Abdulai (Hiicky)'c2017 Faculty InternFoundations of Design and EntrepreneurshipAshesi University College   From: Charles Dzokoto Sent: Wednesday, December 13, 2017 5:59 PM To: Hiickmat Nasara Abdulai Subject: Hult Prize - Winner Announcement and Advancement to Regional Finals Hello Hiicmat,Trust you're good. Please help us forward this message to staff, faculty and students. Please copy the Dean, Dr Gordon.adomdza, Nepeti.ninacor, Charles.dzokoto, genesis.nchopereu, kevin.degboste and david.doanuh@ashesi.edu.gh in the email. Dear Ashesians, It’s has been much pleasure and honour to write to you about this: Hult Prize@Ashesi. \"The Hult Prize is a start-up accelerator for social entrepreneurship that brings together the brightest college and university students from around the globe to solve the world’s most pressing issues. The annual initiative is the world’s ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Wedding in April - Invitation", "Message": "Dear All, Kindly find attached wedding invitation for 14th April, 2018 at 2pm. Looking forward to more! Regards,Aba", "Class": "2"}, {"From": "Ebenezer Gwumah Buckman <egbuckman@ashesi.edu.gh>", "Subject": "Patrick Receives Honourary Doctorate from U. of Waterloo", "Message": "Dear all, Yesterday, the University of Waterloo presented Patrick with an Honourary Doctor of Engineering Degree as part of its 2018 Commencement Activities. The honourary degree (honoris causa) is the highest honour conferred by the University of Waterloo, and through its conferring, the University seeks to recognize outstanding achievement, whether academic or through service to society. You can watch the presentation of the degree here, and read (or watch) Patrick’s address to members of Waterloo’s Engineering Class of 2018 here. Best,Eben  ---Ebenezer G. Buckman '11 Director of External Relations & Special Assistant to the President,Ashesi University College,Berekuso, Eastern Region.Tel: +233 302 610 330 OR +233 302 974 980Ashesi: Website | Twitter | Facebook |YouTube | Instagram ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday October", "Message": "Wellness Wednesday October", "Class": "2"}, {"From": "Benjamin Annan <benjamin.annan@aucampus.onmicrosoft.com>", "Subject": "Vote Team Sterling Afrique", "Message": "Hello Beautiful people,  A team of Ashesi University students won the Africa finals of the L'Oréal Brandstorm Competition 2018.  Due to this amazing feat, they will be representing Ghana, Africa, and Ashesi at the L'Oréal Brandstorm 2018 Final in Paris next Monday and they need your support.  Please follow the link below to vote (you may be asked to login to Facebook):https://woobox.com/t8i2qu/gallery/lHYYSGoC1cw  L'Oréal Brandstormwoobox.comL'Oréal Brandstorm. 47K likes. L'Oréal Brandstorm is the ultimate innovation competition that gives, since 1992, the opportunity for students worldwide to become innovation leaders. Or use Facebook directly and follow the visual aid below: Team Sterling Afrique: You can take a look at their product idea here: https://youtube.com/watch?v=4BDHJTB8i9U  L’Oréal Brandstorm 2018- TEAM STERLING AFRIQUEm.youtube.comVideo presentation by TEAM STERLING AFRIQUE (Ghana). Shot by DirXHenryKD & Copta Love ❤, Team Sterling Afrique  ", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "thank you", "Message": "Dear Ashesi Community, On behalf of the Counselling- Coaching unit of OSCA and the ASC Welfare Committee, we wish to thank you very much for supporting our Wellness  Wednesday “How is your Heart” day. We hope that you enjoyed the food, received a massage or  played a sport that you liked. We wish to improve our service to you so  feedback is welcomed. Best regardsAunty Dee Diane DavisDirector of Counselling and Coaching Ashesi University College1 University Avenue, Berekuso E/RPMB CT3 CantomentsAccra, Ghana. Tel: +233 30 261 0330 Ext: 1057 Cell: +233 50 156 9909 ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Nutrition talk", "Message": "Are you aware that what you eat can affect not just your health but also your studies?Come to LH 217 at 2:40 pm today and listen to Ghana’s favorite Dietician Mavis Asamoah educate us all about Nutrition on Campus for best academic results See you there!!!  Billie RichardsonWellness Coach and CounsellorAshesi University  ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Concerns with Movie Date", "Message": "Dear All, Some concerns have reached me about the movies on Sunday: Please register with your own Ashesi account and password as login1. Please wear whatever you have if you do not have an Ashesi t-shirt. The point of wearing the t-shirt it to get pictures for our marketing campaigns for student/staff recruitment2. I have received requests for bringing friends or family. We can only help with that depending on the numbers that register and the capacity of the cinema hall. I will let everyone know of that can be done by 2pm on Friday.3. If you have ANY concerns, please email Aba or Theresa4.  Best regards,AbaFrom: Aba Kaadze Enyimayew  Sent: Thursday, February 15, 2018 8:32 AM To: Staff <Staff@ashesi.edu.gh>; Faculty <Faculty@ashesi.edu.gh>; Faculty Interns <FacultyInterns@ashesi.edu.gh>; Adjunct_Faculty <Adjunct_Lecturers@ashesi.edu.gh> Cc: Ob Abenser <obabenser@gmail.com> Subject: RE: A Date with Ashesi Dear All, Kindly note that we will have to complete arrangements/payments for the movie by 2pm  on Friday,16th February, 2018. Do complete your RSVP by 12 noon on 16th February, 2018 to make this possible. Best regards,Aba From: Aba Kaadze Enyimayew  Sent: Tuesday, February 13, 2018 5:01 PM To: Staff <Staff@ashesi.edu.gh>; Faculty <Faculty@ashesi.edu.gh>; Faculty Interns <", "Class": "2"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "LOST & FOUND", "Message": "Dear All, If any of the listed items below belong to you, kindly visit the Logistics and Facilities Office at Radichel Hall 102A for identification and collection. Power bank & charger1. Black backpack2. Earphones3. 2 adaptors4.  Thank you. Kind regards, Dzifa Nuer", "Class": "2"}, {"From": "Patrick Awuah <pawuah@ashesi.edu.gh>", "Subject": "Yasmin Bucknor Keteku (COO) and Angela Owusu-Ansah (Provost)", "Message": "Dear Ashesi Community, I am pleased to announce the addition of two new Executive Team members at Ashesi: Yasmin Bucknor Keteku (Chief Operating Officer), and Professor Angela Owusu-Ansah (Provost). Yasmin Bucknor KetekuIn her role as COO, Yasmin will serve as the chief administrative officer, overseeing finance and accounting; human resources; information technology; logistics and facilities; and the registry. Yasmin brings a wealth of experience in Corporate Finance, Business Management and Education. Prior to joining Ashesi, she was the Chief Operations Officer at IkamvaYouth, a South African non-profit focused on empowering disadvantaged youth through education. Yasmin holds a bachelor’s degree in Economics and International Relations from Cornell University, and an MBA from the Ross School of Business at the University of Michigan. She began her career in the financial services industry in New York as an investment banker at Société Generale where she focused on asset-based finance. After her MBA, she worked as a director in corporate finance at American Express. Professor Angela Owusu-AnsahAngela comes to Ashesi with over 30 years of experience in academic development and research. In her role as Provost, Angela will serve as the chief academic officer, overseeing the faculty and driving excellence in instruction and research, consistent with Ashesi mission and vision of catalysing an African renaissance. Prior to joining Ashesi, Angela was a Professor of Doctoral Studies, and a Faculty Chair of dissertation research, at Concordia University, Portland, Oregon. She also served as a national commissioner for the Council for Accreditation of Educator Preparation (CAEP), a major accrediting agency of over 700 higher education institutions. She served as one of two inaugural Innovation Fellows at Concordia University, a role in which she led an initiative in intercultural understanding on campus. Prior to working at Concordia University, she was the Associate Dean for Research and Development, at Elon University. She also served as the Associate Dean of the School of Education, the Director of the Master of Education Programs, Coordinator of Unit Assessment and Accreditation, Licensure Officer, and Chair of Teacher Education Programs, at Elon University.  Prior to that, she served as Assistant Dean and Associate Professor at Samford University, Orlean Bullard Beeson School of Education.  She was the originator and editor of The Educational Collaborative journal and she reviews research submissions to journals such as The Educational Forum, Kappa Delta Pi.  ", "Class": "2"}, {"From": "Sylvia Kunkyebe <skunkyebe@aucampus.onmicrosoft.com>", "Subject": "The WRITE Decision: Having a Successful Career in Writing", "Message": "Dear Students, (Apologies if you received my earlier incomplete email)  By popular request, the ‘Talent to Career’ Session for Wednesday’s career fair will delve into turning your writing skills into an income generating activity. Attached are the profiles of  your panelists for the session.   Regards,Sylvia  Sylvia KunkyebeAssistant Director of Career Services -MCFAshesi University CollegeBerekuso, Eastern Region. Tel: (+233) 302 610 330 Ext: 1066/ +233 302 974 980Cell: (+233) 50 155 0132Email: skunkyebe@ashesi.edu.ghAshesi: Website | Twitter | Facebook ", "Class": "2"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "Kajsa Out of Office Feb 1-9 & Seminar", "Message": "Dear colleagues, please note I will be out of office Feb 1-9, however available as usual on email.I am going to Sweden to renew my passport and while there I will also present an aspect of my dissertation research at a seminar at the Forum for Africa Studies at Uppsala University, please see the abstract for my talk at the seminar in the attachment or below.  BRKajsa Kajsa Hallberg Adu, PhD  Lecturer (Social Theory, Written and Oral Communication, Text and Meaning, Leadership 1, Giving Voice to Values, Teaching Writing Seminar)Team lead for the writing coursesGlobal Liberal Arts Alliance LiaisonChair of the Library CommitteeVice Chair of the Research Committee Ashesi University College | PMB CT 3, Cantonments, Accra, Ghana | Office 204  | Phone: +233.302.610.330, ext. 1058  Fax: +233.302.610.340 or +233.302.974.980 | Skype: kajsahallberg |  Mobile: +233.249.187.210  “I am so so very not sure”: University Students in Ghanaand Their International Migration Aspirations By Kajsa Hallberg Adu, Ph.D., Ashesi University College, Ghana. khadu@ashesi.edu.gh Abstract Before anyone migrates, one aspires to migrate. Research on migration aspirations among youth in Africa shows that marginalized individuals engage in aspirations for future mobility (Bjarnesen, 2007; Frye, 2012; Langevang & Gough, 2009).  However, an increasing share of youth in Africa and the Global South as a whole are university ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "In the D:Lab This ASC Week", "Message": "Happy ASC Week to you all.In light of the ASC Week Excitement, here’s what you should look out for in the D:Lab this week: Ashesi D:Lab Content Series:1. What? – The Design Thinking Content Series powered by the Ashesi D:LabWho?- Stephan Ofosuhene When? – Wednesday, 21  March 2018Time? - 2:40 pm - 4:00pmWhere? - McNulty Foundation  Building Design  Lab The topic for this week? -   Hydroponics Implementation  (Crops without Soil) About our Speaker:  StephanStephan is a third-year student at Ashesi pursuing an undergrad degree in computer engineering. He is passionate about technology and learning about technology in order to gain skills needed for the projects he works on. He has worked on a wide range of projects including software development, internet of things and designing products for the health sector. He is currently working on hydroponics to explore ways of improving the efficiency of agriculture in Ghana while creating a form of symbiosis between technology and nature. Ashesi D:Lab Farm Modelling Project2. Vertical Farming•This week, we will be perforating the bottles and begin painting of the bottles over the weekend. This is to give the bottles the necessary conditions they will need to sustain our crops. We cannot wait to see our “hanging gardens” coming into fruition.Tuungane Cosmopolitan Gardening•We will continue watering our crops on the farm to help them stay healthy. We will also be making way to new beds on our farm to accommodate more crops. Our Garden Eggs have “graduated” from staying in a nursery bed and therefore we would be transplanting them to the farm. Ashesi D:Lab Maker Skills Session3. This week, we will be carrying out an introductory session which includes how to plan an idea through prototyping, and what must one consider when carrying out prototyping. Ashesi D:Lab Health Kiosk4. We will be meeting this Tuesday and Wednesday(at the Workshop) at 2.40pm to plan out ", "Class": "2"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "An Exciting Talk by Prof. Nii Quaynor on \"BLOCKCHAIN, THE NEXT ", "Message": "LAYER OF THE INTERNET STACK\"Dear all, Please save the date on Wednesday, 18th April 2018 for an exciting talk by Prof. Nii Quaynor on “Blockchain, the Next Layer of the Internet Stack.” His company, Ghana Dot Com has started a Blockchain Academy “to introduce participants to the technology and how to construct meaningful Blockchain based solutions.” After the talk, our very own Mr. David Sampah will lead a discussion on the topic. Venue: LH 218Date: Wednesday, 18th April 2018Time: 2:40pm – 4:10pm Here is an abstract of the talk: The permission less innovation platform of the Internet has over the decades become the choice for implementation platform of numerous software applications. Blockchain is extending the Internet with a transaction framework and is bringing “trust less trust” to the internet. The computing science techniques employed by blockchain are explained and the relationship with the internet illustrated. The blockchain is an ordered set of permanent records that may contain transactions, data or programs. The immutability of the records makes blockchain a versatile addition to the tool set of software developers. Kindly find attached a bio of Prof. Nii Quaynor.  Best regards,---------------------------------- Anna A. Aggrey | CS PROGRAM COORDINATORAshesi University CollegeBerekuso, Eastern Region.", "Class": "2"}, {"From": "Selase Aku Tsiagbe <stsiagbe@aucampus.onmicrosoft.com>", "Subject": "A TIME WITH NATIONWIDE", "Message": "A TIME WITH NATIONWIDE", "Class": "2"}, {"From": "Martey Laari <martey.laari@ashesi.edu.gh>", "Subject": "MASO and Ashesi students collaboration", "Message": "Hello everybody, I hope this mail finds you well. Once again, MASO is calling.The Business Academy of MASO (the Next Generation Cocoa Youth Programme), is calling for Expressions of Interest from students/ recent graduates and Faculty interns who are interested to be part of its research team for a field research from 21st October to 25th October 2018. The purpose of this research is to help us undertake a research effort to good and sustainable entrepreneurial opportunities within selected communities in Sefwi, Western Volta Region of Ghana.  The outcome of this research will equip trainers of the Business Academy with the needed information to help them guide the participants in exploring what opportunities exist in their communities. There will be 5 stages in all:You are expected to Express your Interest in working on this research endeavor by sending us your CV and a 200-word statement, explaining why you are a good fit as a researcher, and how this will benefit your development. These should reach martey.laari@ashesi.edu.gh with nquaicoe@ashesi.edu.gh in copy,  by 5pm on Tuesday 2nd October 20181. Shortlisted applicants will be invited for an interview (either in-person or remotely, depending on what is possible) by Friday, 5th October 2018.2. Selected researchers will be invited for a training session on campus, by Friday, 12th October 2018.3. The team will leave for the field with me, and the Project Coordinator, Nana Gyan (in copy) on Sunday, 21st October 2018, and return by Friday 26th October 2018.4. ", "Class": "2"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "Invitation to Final BA Capstone Thesis & Applied Project Presentations", "Message": "Good afternoon all, I trust this finds you keeping well. On behalf of the Business Administration (BA) department, I will like to extend an invitation to the final BA Applied Project & Thesis presentations scheduled to take place on Thursday, April 26th & Friday, April 27th in Lab 221. Find the presentation schedule attached with the various topics and times each student will be presenting. Do join us to observe the presentations and provide students with constructive feedback to help them fine tune their final projects. Many thanks as always. Best regards, William Ohene AnnohProgramme Coordinator | Business AdministrationAshesi University College1 University Avenue Berekuso E/RTel: +233 (0) 302 610 330 Ext: 1021Phone: +233 (0) 244 567 735Email: william.annoh@ashesi.edu.gh  ", "Class": "2"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "FUMIGATION EXCERCISE: SUNDAY 17TH JUNE 2018, 7AM - 12PM", "Message": "Dear All, This is to inform you that there will be a general fumigation exercise on campus on Sunday 17th June 2018 between the hours of 7am and 12pm, to cover external areas only. Akonor and Big Ben have been duly informed and will also be open to serve you after the exercise. It would be safe to be outdoors from 3pm so kindly plan your day and meals accordingly. Thank you for your kind cooperation. Kind regards, Dzifa Nuer Facilities Managerphone: +233 30 2610 330  mobile: +233 50 1694559     1st University Avenue, Berekuso, E/R PMB CT3, Cantoments, Accra, Accrawww.ashesi.edu.gh  ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Bus arrangements for 18th December, 2017", "Message": "Dear All, Kindly note the bus runs for Monday morning , 18th December. - 7am from Christ the King - 7 am from Haatso KFC As such there will be no early bus run. There will also be lunch provided for employees. Regards ,Theresa   Get Outlook for iOS", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Ashesi D:Lab Is Back!", "Message": "Hello Ashesi Community, It's a new school year, and we are excited to introduce the new Ashesi D:Lab!  D:Lab 17-18 In ReviewLast year, we wrapped up some projects such as the D:Lab Mobile, Blockchain Hackathon, Vertical Farming, and earlier this year from 15th April 2018 to 22nd April 2018, the Ashesi D:Lab Team being represented by four of our awesome interns (Zoe Tagboto, Wayne Gakuo, Nutifafa Amedior, Carol Armah) and our founding lead, Dr. Gordon Adomdza, traveled to Boston, Massachusetts, USA to the MIT D:Lab to present on their research findings with their MIT D:Lab counterparts on Financial Inclusion for the Informal Sector and in particular, waste pickers in Accra, Ghana.In the next couple of weeks we will be sharing with you their experiences while in Boston (the fun times and serious business times)! Here’s the first video documenting their travel from Berekuso, Ghana to Boston, MA, USA. Enjoy: bit.ly/AshesiDLabTravelA summary of last year's D:Lab Project Evaluation can be found in the attached PDF! D:Lab RestructureOver the summer, we had Lia Codrington and Brendan Anderson, Junior Fellows from Engineers Without Borders Canada, work on restructuring the D:Lab to focus on you and your ideas for social change.Over the school year, we welcome a new Design Lab Coordinator and Engineers Without Borders Canada Long Term Fellow Melissa Bui to implement this structure. A short bio of Melissa Bui:“I'm Melissa Bui, a designer from Edmonton, Alberta, Canada with a focus around social, systemic, and visual communications design. I am interested in the intersection between design, humanitarian aid, and international development. Currently, I am working in Accra, Ghana as a design lab coordinator at Ashesi University”.Check out her awesome website here  Curious about our restructure process? Read all about it on our blog here!  If you belong in a community of driven design thinkers, we want you for our team! Check out our recruitment package at bit.ly/dlabroles to see the variety of roles available and apply today at bit.ly/dlabapplication. Applications will be open until Sept. 8th", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "FINAL VOTING DAY: Ashesi Employee Awards 2018", "Message": "Dear All, Today is the final day to vote for the Ashesi Employee Awards! Link below:https://forms.office.com/Pages/ResponsePage.aspx?id=9WHGbQzuDka9tANK6z82cKGAWeAEKclMlg6Oypy9mRhUM0xQRkxMSlNWM0ZTSE9PT0lKNEZUMDNWQy4u best regards,Theresa From: Theresa Dei Dzanie  Sent: Wednesday, November 28, 2018 10:49 AM To: Staff <Staff@ashesi.edu.gh>; Faculty <Faculty@ashesi.edu.gh> Cc: Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>; Samuel Mawuli Anagbo <sanagbo@aucampus.onmicrosoft.com> Subject: RE: Ashesi Employee Awards 2018 Dear All, This is the final week to vote for Ashesi Employee Awards! Deadline for voting is Friday, 30th November, 2018. These awards will be given at this year’s End of Year Party. Kindly follow the link below to vote! https://forms.office.com/Pages/ResponsePage.aspx?id=9WHGbQzuDka9tANK6z82cKGAWeAEKclMlg6Oypy9mRhUM0xQRkxMSlNWM0ZTSE9PT0lKNEZUMDNWQy4u  Below are the Award categories:                                                                                                                                                                           Hangout Expert (Staff or faculty who is constantly on the move and knows all the interesting places in town.)1. Innovator of the Year (Staff or faculty who provides innovative and creative solutions to projects or any challenge that arises)2. Eye of the Storm (Staff or faculty who always keep their cool even on a very hectic/stressful day. He/She seems cool, calm and collected even in the midst of a 3. ", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "2 Events You Don't Want to Miss this Weekend!", "Message": "Greetings,The following are two interesting events co-organized by the Ashesi D:Lab that you don’t want to miss this weekend. Accra UNICEF Hackathon: Friday 19th to Saturday 20th October 2018 – See details below•2-Day Maker Workshop: Design Innovation for Coastal Resilience: Friday 19th to Saturday 20th October 2018 – See details below• Be sure to sign up and participate! Good luck in your exams. Best regards, The Ashesi D:Lab Team  Accra UNICEF Hackathon APPLY HERE: http://bit.ly/accraunicefhackathon As part of the theme \"Partnership with Youth to Achieve the Sustainable Development Goals\" for the summit that aims at showcasing how young people are using technology to tackle social issues to help achieve the Sustainable Development Goals. This hackathon aims to develop solutions that employ child centered approach towards finding solutions to problems around SDGs 3 (Good Health & Well Being), 4 (Quality Education), 5 (Gender Equality), 6 (Clean Water & Sanitation), 8 (Decent Work & Economic Growth), 10 (Reduced Inequalities), and 13 (Climate Action). Seeking youth under 24 years old with any technical skills like website creation, graphic design, engineering, etc. Date: Friday 19th to Saturday 20th October 2018Venue: Workshed (Nungua Link Road Baatsona, 47 Spintex Rd, Accra)Time : 9:00am - 4:00pm Deadline: Wednesday, October 17th There will be concurrent hackathons in Kumasi and Tamale. UNICEF Ghana will join Youth Advocates Ghana in the 2nd edition of the African Youth SDG summit. The four (4) best ", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "My Sincerest Appreciation", "Message": "Dear All: Last week Wednesday, The Center for African Popular Culture at Ashesi successfully organized its inaugural African popular culture conference which focused on the late Ebony Reigns (see attached program). The conference was a success!! So this email is to express my sincerest gratitude to all who participated in diverse ways including our Provost, Prof. Angela Owusu-Ansah, faculty and staff who were there in person and in spirit, William Annoh who helped coordinate all issues associated with the conference, the various student volunteers, and Ashesi University for allowing us to host the event on campus! Massive thanks to all! Sincerely, Frimpong.      Joseph Oduro-Frimpong, Ph.D. Assistant Professor Department of Arts and Sciences Ashesi University 1 University Avenue, Berekuso, E/R PMB CT3 Cantonments Accra, Ghana joduro-frimpong@ashesi.edu.gh", "Class": "2"}, {"From": "Takako Mino <tmino@aucampus.onmicrosoft.com>", "Subject": "Educators without Borders conference", "Message": "Hello everyone, My name is Takako Mino, and I am a new assistant lecturer in the humanities at Ashesi. My research focus is on higher education in Sub-Saharan Africa and the humanization of education. I am honored to be here and looking forward to meeting everyone. I wanted to pass on this conference opportunity hosted at a rising liberal arts colleges in the U.S.: Soka University of America. The Educators without Borders conference will take place July 13-14 2019, closely followed by and in coordination with the International Council of Education Leadership Professors (ICELP)  meeting in LA July 15-16, 2019. A helpful website hosted by the ICELP is available: https://www.icpel.org/soka.html. The format of the conference of \"Educators without Borders\" at Soka is as a series of discussion groups in which participants from around the world share experiences and plans and seek comment and collaboration.  The mission of \"Educators without Borders,\" according to its website: \"Our mission is the establishment of a global network of educational scholars who have chosen to work on behalf of all children going to school. Our main objective is all children have a right to go to school. Our second objective is not to make schools as they exist more efficient at what they do, but to call into question what schools do in the first place and how they work or should work to provide greater equality to all children and their families. It is not only the availability of schools for all children worldwide, but what kind of schooling is available to them. Educational leaders must become emboldened to step out of the school/state nexus so that we can become true educational leaders without borders. We stand against misogyny, xenophobia, nativism, racism, and all the 'isms' in which human beings are denied equal and just value for living a life in happiness.\" If you are interested or have questions, please contact James Spady at jspady@soka.edu. Thank you,Takako Mino  ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "In the D:Lab This Week", "Message": "Hello Ashesi Community,It is our sincere hope that you have all kick-started this week with much vim and enthusiasm. Here’s what to look out for in the D:Lab this week: Ashesi D:Lab Farm Modelling ProjectTuungane Cosmopolitan Gardening1. This week, we will continue watering the crops. Timelines for this activity is Tuesday, Thursday, Saturday and Sunday.We will also be preparing and mixing up the different organic pesticides. This will be done by Friday.We will be applying the pesticides on the vegetables and pruning of the vegetables to give space for growth by Saturday. Vertical Farming2. On Wednesday and Friday, we will be clipping the top row bottles and  filling the hung bottles with growth medium plant first seeds. On Thursday, we will be putting up another batch of bottles, set and ready for planting the seeds. Hydroponics3. This week we will start building the tent and attaching the pumps and reservoirs. We will also be completing the IoT (Internet of Things) Dashboard.When? Wednesday 11th April 2018, Thursday 12th April 2018, Friday 13th April 2014Time? Wednesday (1.30pm), Thursday (2.40pm), Friday (12pm) Ashesi D:Lab Opportunity DeskWe will be sending it out Google Forms for North Eastern University engagement with the Ashesi D:Lab.We will also be conducting a proper sharing of information to those interested in the Falling Wall Lab 2018. This will all be done by the D:Lab Interns.When? Wednesday, 11th April Ashesi D:Lab Fellows Workshop", "Class": "2"}, {"From": "Antoinette Okyere <aokyere@ashesi.edu.gh>", "Subject": "Please vote on the social honor code today", "Message": "This link is for those who are off campus or out of the country:  https://docs.google.com/forms/d/e/1FAIpQLSd1O54raMLDkCUHtrH0HeJQhJrdroewSeahtBHqy5yf1zPnyg/viewformAshesi Social Honor Code Remote Voting Platformdocs.google.comThis form was created to enable Ashesi students, Faculty, Staff and support staff who are not in or around campus on the day of the social honor code voting a chance to cast their vote towards this decision. Voting can only happen once. Kindly vote with integrity and vote just once. In the spirit of Ashesi. Thank you              From: Patrick Awuah Sent: Friday, November 30, 2018 9:35 AM To: FacultyandStaff Subject: Please vote on the social honor code today Dear Colleagues, The social honor code vote is scheduled for today from 9am to 5pm.  Let us honor our students’ invitation to participate in this vote. Vote YES or NO: Do you agree to the Social Honor Code:", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Out of Office", "Message": "Dear All,  I am away from the 24th September, 2018 to 28th September, 2018.Kindly contact Aba Enyimayew at aenyimayew@ashesi.edu.gh or Samuel Anagbo at sanagbo@ashesi.edu.gh for all HR related matters.I will be back in the office on 1st October, 2018. Best regards,Theresa Dei DzanieAssistant Manager- Human ResourcesAshesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Re: Wellness Wednesday Program Sept 19th", "Message": "Fiifi and his massage team will be taking a lunch break from 1pm till 1:45pm   Billie Richardson On 19 Sep 2018, at 8:31 AM, Billie <frichardson@aucampus.onmicrosoft.com> wrote:  <wellness wednesday program 19 Sept poster.JPG>", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Lunch is ready", "Message": "Dear All, Kindly  come to the Radichel kitchenette for a pack of food.  Regards,Aba", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Annual Goal Setting Plan-2018", "Message": "Dear All,Kindly note that it is time for us to complete our Annual departmental goals.Goal setting is the first stage in our performance management policy. As stated in the Ashesi Employee handbook 10.2.1,This is the stage where the employee and Supervisor / Manager / Head of Department meet to discuss the expectations, targets, quantity, quality, cost or timeliness and all the issues that need to be achieved during the review period.We will continue to perfect the process of linking our goals to our performance evaluations this year.  Quarterly review sessions will be held during the year (details will be communicated). In view of this. Your departmental annual goal setting format should include the following:-          1. Draw out your department’s Organogram as at January 3, 2018.-         2.  Set and list Departmental Goals for the year-          3. Set Targets and Timelines for each member of the team towards executing the goals.-          4. Assign tasks to members in the department based on their roles and job descriptions.          5. Each HoD/Executive Head will be required to share details the department goals at the  annual management retreat in January 2018.          6. For Academic Heads, kindly set goals for your department and do ensure your administrative staff have clear targets throughout the year.    The rule of thumb deadline to help you be ready for the management retreat ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Out of Office", "Message": "Dear All, Kindly note that I will be working off campus today. I will however be available by phone or email for any emergencies.  Kindly see Samuel Anagbo for any on-campus emergencies.  Best regards,Theresa  Get Outlook for iOS", "Class": "2"}, {"From": "Stephen Emmanuel Armah <searmah@ashesi.edu.gh>", "Subject": "The Cultural Day is Happening Now!", "Message": "Dear all, Please support the BA Cultural Department Stephen E Armah   Stephen E. Armah (Ph.D.)Senior Lecturer,Head of Business Administration Department,Director of the Ashesi Economics Lecture Series,Ashesi University College, Berekuso, E/R, Ghana.http://www.ashesi.edu.gh/academics/business-administration/faculty-pages-ba/659-armah-stephen.html   ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday tips 4", "Message": "Wellness Wednesday tips 4", "Class": "2"}, {"From": "Office 365 Message Center <o365mc@microsoft.com>", "Subject": "Weekly digest: Office 365 changes", "Message": " Here is a summary of your messages from last week Organization: ASHESI UNIVERSITYIs this digest useful to you?   Give us feedbackOffice 365 announcements from last weekEdit Message center preferencesPlease sign into your admin account to use any of the links belowOct 26Dynamics 365 – Minor Service Update for Microsoft Dynamics 365 (online) [Service Update 06] [EUR] We have a minor service update planned for your Microsoft Dynamics 365 (online) organization in the EUR region. Maintenance window start: 16 November 2018, 18:00 UTC Maintenance window end: 17 November 2018, 03:00 UTC MC152309 Like | Dislike  Oct 25Dynamics 365 – Minor Service Maintenance for Microsoft Dynamics 365 (online) [8.2.3.3] [EUR] We have a minor service update planned for your Microsoft Dynamics 365 (online) organization in the EUR region. Maintenance window start: 29 October 2018, 18:00 UTC Maintenance window end: 30 October 2018, 03:00 UTC MC152294 Like | Dislike  Oct 25Reminder: Support for TLS 1.0 and 1.1 in Office 365   Major Update: General Availability   Act By: Oct 31 As previously communicated (MC124102 in Oct 2017, MC126199 in Dec 2017 and MC128929 in Feb 2018), we are moving all of our online services to Transport Layer Security (TLS) 1.2+ to provide best-in-class encryption, and to ensure our service is more secure by default. MC152261 Like | Dislike  Oct 25Updated feature: portal.office.com/myapps migrating to the Office 365 gallery Office 365 gallery enables you to learn about and explore your apps. We are pleased to share that the Office 365 gallery now exceeds portal.office.com/myapps functionality. As a result, we will be migrating from portal.office.com/myapps to the Office 365 gallery in December. MC152260 Like | Dislike  Oct 25Dynamics 365 - Service Maintenance Refresh for Microsoft Dynamics 365 (online), version 9.1 (9.1.0.0035) Service Maintenance: Dynamics 365 We have maintenance planned for your Microsoft Dynamics 365 (online), version 9.1 organization. Please note - this is a Refresh update to the current version of your Microsoft Dynamics 365 (online), version 9.1 organization. Maintenance window start: 25 October 2018, 18:00 UTC Maintenance window end: 26 October 2018, 03:00 UTC MC152174 Like | Dislike  Updated feature: Ribbon in Word Online, PowerPoint Online, and Excel Online We've simplified the Ribbon in Office Online to make the feature easier to use and to put the focus squarely on content and collaboration. We'll begin rolling this feature out to Targeted Release organizations soon. This message is associated with Microsoft 365 Roadmap ID: 43126. Oct 24More ...More ...More ...More ...More ...More ...", "Class": "2"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "ADJUSTMENTS TO THE BUS SCHEDULE FOR TOMORROW, FRIDAY, ", "Message": "SEPTEMBER 7THDear all, We will have a rental bus replacing one of our buses. Mr. Eric Tetteh McCarthy will not be available tomorrow. We should have him back officially on Monday, September 10th. In light of this development, kindly find as highlighted, our transport schedules for tomorrow, Friday, September 7th:  Christ the King Premises (CTK)-37-Airport-Spanner Junction-Shashi-Atomic Roundabout-Kitase route: All-white Coaster bus with registration No: GT 1078-16, being driven by Samuel Bansah. He can be reached at 024 048 7127:1. .      CTK Premises: 6:15am·         37 Bus Stop (License Office): 6:20am·         Spanner Bus Stop: 6:25am·         Shashi Bus Stop: 6:27am·         Okplongo Bus Stop (Opposite Legon Stadium): 6:30am·         Atomic Junction: 6:35am·         Ritz Junction (Madina): 6:40am·         Adenta Police Station: 6:45am·         Oyarifa Shell Filling Station: 6:55am·         Toll Booth Bus Stop: 7:05am·         Ashesi University Campus: 7:30amChrist the King Premises (CTK)-37-Airport-Spanner Junction-Shashi-Atomic Roundabout-Kitase-Berekuso route: An All-White Coaster (with a strip of yellow 2. ", "Class": "2"}, {"From": "Rebecca Awuah <rawuah@ashesi.edu.gh>", "Subject": "Math Quiz Success!", "Message": "Thank you to the Kingsley and the Pi Day organizing committee, facilities support, and everyone who volunteered on the day to make the first ever Pi Day Math Quiz with the children from Berekuso a great success. The event was well organized, fun, and just the right length of time. The first math quiz has set a foundation for the children and their teachers to be motivated and excited about math, a foundation that we can build on in the years to come. Thank you!Mrs. Awuah  Rebecca AwuahMathematics LecturerAshesi UniversityBerekuso, Ghana +233 30 261 0330www.ashesi.edu.gh ", "Class": "2"}, {"From": "Angela Owusu Ansah <aansah@aucampus.onmicrosoft.com>", "Subject": "Dean's Lists for Academic Year 2017-2018", "Message": "Dear Students, Staff, Faculty, and the entire Ashesi Community, I am pleased to publish, via attachment, the Dean’s Lists for the 2017-2018 Academic Year. Do join us to celebrate the academic successes of these students, who have exceled in an area of our university’s mission.  Congratulations to all the students on the Dean’s List in the 2017-2018 Academic Year! Sincerely,Angela Angela Owusu-Ansah, Ph.D.Provost and ProfessorAshesi University, 1 University AveTel: +233-302-610-330  or +233 302 974 980 | Ext 2001Office Cell: +233-501-331-618Personal Cell: +233-541-880-000Email: aansah@ashesi.edu.gh Ashesi: Website | Twitter | Facebook  ", "Class": "2"}, {"From": "Mat at Help Scout <yourfriends@helpscout.com>", "Subject": "Is your self-service self-serving?", "Message": "Self-service can be empowering, time saving and engaging, but it isn't always. What do we mean when we talk about self-service choices?  Good self-service ➔ Read the full article on HelpUHere are the key differences I see between effective, well-executed self-service and cost-focused, poorly implemented self-service. Good self-serviceGives customers faster access to the answers and information they need.•Allows customers to control their experience by making changes without needing to call or email. For example, a bank might let their customers change their daily withdrawal limit online.•This week it’s back to self-service basics — what is it, why does it matter, and what makes a good self-service experience for your customers.", "Class": "2"}, {"From": "Romel Ofoe Chachu <romel.chachu@ashesi.edu.gh>", "Subject": "Organizational Behaviour Class Talk", "Message": "Dear All:The organizational Behaviour class gladly invites you to a talk by The Executive Director of the Institute of Human Resource Management practitioners (IHRMP), Mr. Emmanuel Agbettor. Topic: \" What Employers Expect from Employees\" Date & Time: Monday 16th April 2018 from 4:20pm - 5:50pm Location: Norton Motulsky 207A See you there! Best Regards, Romel Ofoe ChachuFaculty InternOrganizational Behaviour and Operations ManagementMob: +(233)200916639 Whatsapp: +(233)278147908Email: romel.chachu@ashesi.edu.ghPrivate email: romel.chachu@gmail.com ", "Class": "2"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "Ashesi Research mentioned by Government Minister", "Message": "Congrats Dr. Edgar Cooke on the mention of your research on poverty by the honorable minister!  I was proud to see Ashesi University mentioned in the context of research on poverty alleviation. I especially enjoyed the conclusions the minister drew from the research and the actions the government plans to take to ensure social protection and development:  \"She said by building human capital, individuals become less vulnerable and more financially stable in the long-term; declaring that sustainable livelihood helped to break the intergenerational cycle of poverty.\"   The fight against inequality is relevant also for our Social Theory course and perhaps for the wider Ashesi Community, so I'd thought I would share this with all of you!  https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Gender-Minister-calls-for-intensive-efforts-against-inequality-638926Gender Minister calls for intensive efforts against inequalitywww.ghanaweb.comMadam Otiko Afisa Djaba, Minister of Gender, Children and Social Protection, has...BR, Kajsa Kajsa Hallberg Adu, PhD  Lecturer (Social Theory, Written and Oral Communication, Text and Meaning, Leadership 1, Giving Voice to Values, Teaching Writing Seminar)", "Class": "2"}, {"From": "Michael Asiedu <masiedu@ashesi.edu.gh>", "Subject": "FDE Exhibition Business Fair and In-class Presentations", "Message": "FDE Exhibition Business Fair and In-class Presentations", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "Help: Examples of Christian Religious Materials", "Message": "Dear All: So in Ghanaian Christian religion, one encounters the use of candles, olive oil, stickers, Florida water etc that are used for miracles. I need your help in identifying more of such examples which you know of through experience or hearing about them on radio, television etc. Thanks in advance for your help. Sincerely, Frimpong. Joseph Oduro-Frimpong, Ph.D. Assistant Professor Department of Arts and Sciences Ashesi University 1 University Avenue, Berekuso, E/R PMB CT3 Cantonments Accra, Ghana joduro-frimpong@ashesi.edu.gh", "Class": "2"}, {"From": "Kwabena Yeboah Akuffo <kakuffo@aucampus.onmicrosoft.com>", "Subject": "FDE Problem Festival - thank you!, pictures", "Message": "Hello All, The FDE teaching team celebrates a very successful Problem Festival (best so far!). The teams were engaged, focused and energized! We saw some really great presentations and amazing ingenuity at the stands. Pitches went on and on, describing problem spaces without touching on solutions. We are excited to see what solutions will emerge as we prepare to take these problems through the design thinking process. The pictures are still loading, but here is a sneak preview  https://www.flickr.com/photos/ashesidlab/sets/72157701467892645/2022 FDE Problem FestivalOn 17th September 2018, the Annual FDE Problem Festival was held on Ashesi University campus where the Class of 2022 was introduced to Design Thinking Concepts; where problems are analyzed and solutions penalized!    Thanks again to all who made it possible and we look forward to your continued support of FDE. Thanking…The Class of 2022•FDE Coaches from the 2020/21 classes•FDE/AVA Coaching Program Organizer, Carol Armah•Our guest judges•Provost•MC : Princess, Eugene•DJ : Elikem•Ashesi Operations •Panelists•Ashesi D:Lab Media Team•Any one left out by mistake•", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "Wellness Wednesday", "Message": "Wellness Wednesday", "Class": "2"}, {"From": "Derick Omari <derick.omari@ashesi.edu.gh>", "Subject": "Tech Era 3 Days Robotics and Electronics Workshop 2018", "Message": "Hello Uncle David, Happy New Year and I hope this mail finds you well.  I would like to kindly request for permission to use the computers in the computer labs and install two softwares we will need for Tech Era’s 3 days robotics and electronics workshop module boot camp for Senior Secondary Technical students taking place at Ashesi University College, from the 11th to the 13th of January, 2018 from 10:00 am to 4:00 pm. Our Vision is to create an Africa where IT is a local language. This year, with the aim of expanding our robotics and electronics module to the senior high technical schools (Aburi Sec Tech and Accra Technical Training College), we are organizing the 3 day bootcamp to expose selected students from these schools where we have established the robotics clubs who will transfer the knowledge they have acquired to their colleagues in the schools during club meetings. Our tutors will visit these schools twice every month to facilitate the subsequent training sessions. To be able to host this robotics and electronics workshop for 50 students from the two schools successfully, we would like to reach out to your office to grant us the use of the computers with the softwares installed on them for our workshop from Thursday 11th January to Saturday 13th January.  We will also request for a special account to log in into the computers for the workshop for the students. We will humbly request that your office helps to sponsor the awards which will be given out on the last day to the students. Kindly find below the links to the softwares we will need for the program. https://www.lego.com/en-us/mindstorms/downloads/download-software", "Class": "2"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Bus Schedule for Summer School, starting on Monday, June 18th.", "Message": "Hello all, Starting Monday, June 18, we will be having a second bus plying the Atomic Junction-Madina-Kitase route. This has come about as a result of the increasing numbers of staff on that stretch, due to summer school including other non-academic activities. The drivers assigned to that route are Eric Tetteh McCarthy and Kenneth Amofah, mostly for the morning. McCarthy will run our regular schedule from Christ the King (CTK) through Kitase to Ashesi at 7:00am.  •Kenneth on the other hand, will begin his trip from Atomic junction at 7:25am; Riis Junction at 7.30am; Adenta Police Station at 7.35am; Pantang Shell at 7.40am and Oyarifa at 7.45am, through the same stretch to Kitase and finally at Ashesi.• We encourage as many people who live in that part of town to join Ken’s bus to help even out the numbers fairly on these buses. The morning schedule for KFC- Haatso- Atomic Roundabout-Aboum remains the same as its being run currently. We will have both Samuel Bansah and Peter Akumasi plying these routes.• The regular 1:15pm shuttle to Atomic Roundabout remains unchanged.• For evenings: Ken and Sam will run Berekuso-Aboum to Atomic Junction at 5.00pm•McCarthy will run the Kitase-Christ the King route at 5.00pm•Akumasi will run Berekuso-Aboum to Atomic Roundabout at 6.00pm  • Hopefully, these arrangements help ease some of the current challenges being experienced with our bus services until the end of summer school in July.", "Class": "2"}, {"From": "Selase Aku Tsiagbe <stsiagbe@aucampus.onmicrosoft.com>", "Subject": "EYE SCREENING", "Message": "Dear all,The eye screening session has started. Thank you.   Selase Aku TsiagbeNursing Officer  |Ashesi Health Services 1 University Avenue, Berekuso , Eastern Region, Ghana.mobile no.0206373405:  0232470373. Email: stsiagbe@ashesi.edu.gh Health line: 0501331668", "Class": "2"}, {"From": "Nepeti Nicanor <nnicanor@ashesi.edu.gh>", "Subject": "Uber arriving on campus at 08.50 please call James on 0265270443", "Message": "Dear All  Uber will arrive before 9 am, kindly call to book  Best  Nepeti  Get Outlook for Android ", "Class": "2"}, {"From": "Casper Annie <cannie@ashesi.edu.gh>", "Subject": "Out of Office", "Message": "Dear Colleagues, I wish to inform you that I will be out of the office from Monday, 16th July to Friday, 3rd August, 2018. I will be back in the office on Monday, 6th August, 2018.  Please contact Mrs. Dzifa Nuer, Ashesi Facilities Manager in the same office as Anna Reimmer for assistance while I am away. Thank you. Casper", "Class": "2"}, {"From": "Sylvia Kunkyebe <skunkyebe@aucampus.onmicrosoft.com>", "Subject": "Career Fair 2018", "Message": " Happy New Year!!! The Career Services team wishes everyone a happy and fulfilling 2018. This year’s Career Fair comes off on Wednesday March 14, 2018. As is the tradition, we will be happy to receive your suggestions on new companies to invite for our career fair to further diversify and enrich the career fair experience for everyone. Kindly use this form to suggest companies you would like us to invite. Alternatively, we are happy to receive complimentary cards of people you know or have met whom you feel we should reach out to for the career fair. Do let us know if you have any such contacts and we will gladly come to your office for them. Wishing you a fruitful year  Regards,Sylvia  Sylvia KunkyebeAssistant Director of Career Services -MCFAshesi University CollegeBerekuso, Eastern Region. Tel: (+233) 302 610 330 Ext: 1066/ +233 302 974 980Cell: (+233) 50 155 0132Email: skunkyebe@ashesi.edu.ghAshesi: Website | Twitter | Facebook ", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "Ashesi D:Lab Open House", "Message": "Dear Ashesi Community,This Wednesday 30th January 2018 at 2.40pm in the McNulty Foundation Design Lab, we bring you the Ashesi D:Lab Open House. This your opportunity to interact the D:Lab Interns and get to know what they have in store for you this semester. Below is brief information on what to look out for : Ashesi D:Lab Content SeriesStudents brought on board as presenters are given the opportunity to choose their favorite topic in Design Thinking and do a 15-minute presentation which will be posted on the Ashesi D:Lab YouTube Channel. Come and meet some of the presenters, interact with them and get to know what they are interested in. Ashesi D:Lab Maker Skills SessionThe Maker Skills Session will be printing 3-D Ashesi Logos. Do pass by and get your 3D Ashesi Logo.Come and also learn how a team in the lab is building a health kiosk for checking your vitals before going to the hospital! Ashesi D:Lab Farm ModellingDid you know that Agriculture is an acronym? It stands for Africa’s Greatest Rich Industrial Culture. True, right?  May be not, because the reality shows that Africa has not gotten there yet (your opinion is definitely true too).Ashesi’s D:Lab, through its Farm Modelling Project is working hard to contribute to the stakes in making Africa’s agricultural sector experience a productive transformation. Come and find out more about the 4 projects we will be running this semester:Hydroponics: Do you want to know how we can grow crops without planting them in soil, and why we would try that?1. Vertical Farming: Have you thought of exploring other cultivation methods that provides greater control over yields and prevent e.g. root-feeding nematodes to negatively impact yields?2. Tuungane (Cosmopolitan Gardening): if you are all for diversity and inclusion come and find out how you can use agriculture to promote such virtues.3. Smart farming:  are you interested in Arduino and programming?  Please don’t miss the chance to find how our lab fellows are developing control systems to regulate vital aspects of farming.4.  Ashesi D:Lab Hackathon 2018The Ashesi D:Lab, Blockchain Society Ghana, Kumasi Hive & Devless are organizing Africa’s ", "Class": "2"}, {"From": "Ashesi Student Council <studentcouncil@aucampus.onmicrosoft.com>", "Subject": "The Ashesi Meme Challenge Starts Today", "Message": "The Ashesi Meme Challenge Starts Today", "Class": "2"}, {"From": "Romel Ofoe Chachu <romel.chachu@ashesi.edu.gh>", "Subject": "AIX AWARENESS DRIVE", "Message": "Dear Ashesi Community, We hope this mail finds you doing well. For those who do not know about AIX: AIX is a senior high school enrichment program, where high school students spend two life-changing weeks on campus, with about 104 other young innovators. Participants experience Leadership, Design, Robotics, Engineering, and Entrepreneurship, as well as the opportunity to network with peers across the country and beyond. This year, AIX is introducing a Creative Arts module, and is looking to recruit about 140 high school students. This new module would harness the creative talents of participants by adapting various forms of the creative arts as a tool for problem-solving. Using the posters attached in social media posts and emailing them to high schools and/or in your network who interface with high school students, please spread the word about AIX 2018, and its new addition! Please direct them to visit http://www.ashesi.edu.gh/about/outreach-programmes/aix.html for more information or call+233 50 614 7348.  Thanks in advance! Best regards,AIX Admissions team.    ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "In the D:lab This Week & GCIC Summer Internship Updates", "Message": "Hello all,Welcome back from the Easter Break. As we start a new month, here’s what to look forward to this week:Ashesi D:Lab Opportunity DeskThis week, we will be reading extensively on the three available opportunities; Northeastern University, Ghana Dialogue & 3 minutes 1 day.An info session will be held on Wednesday 4th April 2018 at LH 216 on Falling Wall Lab 2018. If you still haven’t signed up for the session, kindly do so here (also refer to D:Lab’s email that was sent yesterday for further information on Falling Wall Lab 2018)We will be sending out more Google Forms for people interested in other opportunities on Friday 6th April 2018 Ashesi D:Lab ConferenceWe will be planning out logistics from the D:Lab with assistance from Michael Asiedu. This will be done before 7th April 2018 Ashesi D:Lab Maker Skills SessionReceiving project submissions and continuing alarm project. This will happen in the MPR on 4th AprilHealth Kiosk1. We are working on creating a scale that measures weight using load cells. This will happen in the Electronics lab on Wednesday and Thursday at 2:40pm each dayWhere? Electronics LabWhen? Wednesday 4th April 2018 and Thursday 5th April 2018Time? 2:40pm Ashesi D:Lab Farm Modelling ProjectVertical Farming Team1. We are clearing weeds and carrying out general farm maintenance. This will happen on the farm from Monday through to Saturday based on the free time of the laborers.Where? At the FarmWhen? Monday to SaturdayTime? Based on the free time of the Laborers Ashesi D:Lab Content SeriesWhen:  Wednesday 4th April 2018Where : McNulty Foundation Design Lab", "Class": "2"}, {"From": "Jenipher Stoughtoni Quaye <jsquaye@ashesi.edu.gh>", "Subject": "Uber coming to campus", "Message": "Good morning,   There will be an Uber on campus in 30mins. Please call Eric on 0244753815 if interested in his services.  Thanks, Jenipher    Get Outlook for Android     ", "Class": "2"}, {"From": "Sylvia Kunkyebe <skunkyebe@aucampus.onmicrosoft.com>", "Subject": "Career Fair 2018", "Message": "Happy New Year!!! The Career Services team wishes everyone a happy and fulfilling 2018. This year’s Career Fair comes off on Wednesday March 14, 2018. As is the tradition, we will be happy to receive your suggestions on new companies to invite for our career fair to further diversify and enrich the career fair experience for everyone. Kindly use this form to suggest companies you would like us to invite. Alternatively, we are happy to receive complimentary cards of people you know or have met whom you feel we should reach out to for the career fair. Do let us know if you have any such contacts and will gladly come to your office for them. Wishing you a fruitful year  Regards,Sylvia  Sylvia KunkyebeAssistant Director of Career Services -MCFAshesi University CollegeBerekuso, Eastern Region. Tel: (+233) 302 610 330 Ext: 1066/ +233 302 974 980Cell: (+233) 50 155 0132Email: skunkyebe@ashesi.edu.ghAshesi: Website | Twitter | Facebook ", "Class": "2"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "Starting Today: Ashesi Innovation Experience (AIX) 2018", "Message": "Dear Ashesi Community, This afternoon, 132 senior high school students, from 58 schools across 8 regions of Ghana and 6 other countries, arrived on campus for the Ashesi Innovation Experience (AIX): two exciting and transformative weeks of leadership, design-thinking, entrepreneurship, robotics, engineering, and (new this year) creative arts!  The AIX team of coaches, programme assistants, programme coordinator and faculty eagerly welcomed this year’s AIX participants, knowing that they will never forget the experience of the next two weeks.  You also can be part of the AIX experience. Follow AIX on:•             The AIX blog: aixupdates.wordpress.com•             Twitter: @ashesiix (www.twitter.com/ashesiix)•             Instagram: @ashesiix (www.instagram.com/ashesiix)•             Snapchat: ashesiix Those on campus are welcome to join us for some of the evening sessions this week (venue: Norton-Motulsky Hall):•             Monday 6th August @ 7pm – AIX Freestyle (a public speaking challenge)•             Wednesday 8th August @ 7pm – AIX Celebration of Diversity (show & tell)•             Saturday 11th August @ 7pm – Drama Competition Finally, please do join us for the AIX Open House and Closing Ceremony on Saturday, 18th August 2018 from 10am to 2pm.  In the Open House from 10am to 12noon, the participants will present their business concepts as well as their engineering, robotics and creative arts projects.  The Closing Ceremony from 12noon to 2pm will be a final celebration of the participants’ achievements in the two weeks of AIX. We’re looking forward to an exciting AIX 2018! Best wishes,Ayorkor KorsahOn behalf of the AIX team -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science Department Ashesi University1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, Ghana", "Class": "2"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "Ashesi Represented at Border Studies Network and Nordic Africa Days", "Message": "Dear Ashesi comrade, I hope you are having a good week.I am writing to let you know that I will represent Ashesi at two research events in the coming weeks: A Border Studies Network meeting at liberal arts university DePauw University in Indiana, US where we will be discussing research collaborations and teaching border/migration studies.1. Nordic Africa Days in Uppsala, Sweden where I am organizing a panel on conceptualizing youth mobility together with Mr Michael Boampong of Birkbeck University of London as well as presenting a paper, see details below.2.  I am happy to report my participation in both meetings were funded externally.  This means I'll be away from my office and classroom 13-21 September, 2018. While I am gone, you can still reach me by email. My colleagues in the Writing Team have kindly agreed to help me cover my class meetings, however, please direct pressing concerns to Mr. Kobina Ankomah-Graham during this period. I look forward to sharing what I learned with you when I return. Warm regards,Kajsa Kajsa Hallberg Adu, PhD  Lecturer Team lead for the writing coursesGlobal Liberal Arts Alliance LiaisonChair of the Library CommitteeVice Chair of the Research Committee Ashesi University | PMB CT 3, Cantonments, Accra, Ghana | *NEW* Office 111  | Phone: +233.302.610.330, ext. 1058  | ", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "wellness Wednesday", "Message": "HELLO!Remember The 4 Week Fitness Challenge that took place last Wellness Wednesday? This Wellness Wednesday, everyone who signed up will have the chance to see how far they've come towards attaining their goals and prizes will be awarded. If you would like to improve your fitness , lose weight and be part of the Fitness Challenge in 2019, please indicate tomorrow and sign up   Decathlon will be here with all your favorite sporting gear as usual ( you can contact them on 0303970041 to order for things you'd want them to bring along) and don't forget all those yummy and healthy  treats available for sale that day. Massages will be available until 5pm.  Look forward to the last Wellness Wednesday of the semester, happening tomorrow! Best regards,", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Ashesi D:Lab Content Series", "Message": "Hello all,We hope this email finds you well. The Ashesi D:Lab has been working on creating online content by producing videos of presenters in our D:Lab Content Series. D:Lab Content Series follows the doctrine Docendo discimus a Latin saying that loosely translates to “The best way to learn is to teach!”. These videos provide information on various topics in Design Thinking in a bid to train individuals on using Design Thinking and its tools. Recently, Tamisha Segbefia, a Computer Engineering Major(c2021) took us through Storyboarding. Watch it here: http://bit.ly/2FlQ0eT Want to know more about the interns working at the Ashesi D:Lab? Watch here: http://bit.ly/2CBtdZx Like, Share & Subscribe to our Ashesi D:Lab YouTube Channel for more D:Lab content. Stay tuned! Regards,Ashesi D:Lab Team ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday Program Sept 19th", "Message": "Wellness Wednesday Program Sept 19th", "Class": "2"}, {"From": "Jenipher Stoughtoni Quaye <jsquaye@ashesi.edu.gh>", "Subject": "Uber coming to campus", "Message": "Good morning, There will be an uber on campus in 25mins. Please call David on 0557893621.  Thanks, Jenipher   Get Outlook for Android ", "Class": "2"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Update On Immigration Processes", "Message": "Good day Everyone, Thank you all for your patience. We have been able to solve the issues with the immigration processes. Kindly be informed that the immigration processes will begin tomorrow, Wednesday, October 3 to Thursday, October 3 from 10:00am to 4:30pm on both days. Do take note of the following: Ghana Card-Non Citizen ID RegistrationThe Ghana card registration team will be located at the Greene Lounge, King Engineering Building.1. Do make your way there2. Documents Needed for the Registration:Passport1. Ghana Card- scratch card2. Filled form3. After you are done with this process photocopy your non-citizen ID and add the photocopy to documentations needed for the Residence Permit  Residence Permit RegistrationThe immigration team will also be available at the Greene Lounge, King Engineering Building.1. Do make you way there after you are done with the non- citizen ID process2. Requirements for this Process2 passport size photographs (Write your name and sign the back of pictures)1. Your original passport2. Photocopy of the Bio-data page of your passport3. Photocopy of your admission letter4. Photocopy of your school fees receipt (if applicable)5. Photocopy of your Non-Citizen ID (You will receive this upon Ghana Card 6. ", "Class": "2"}, {"From": "Abdul Mahdi <amahdi@aucampus.onmicrosoft.com>", "Subject": "Campus Closure for 2017", "Message": "FYI…Sent it to students earlier this week. Abdul Mahdi Dear Ashesi students, As the year comes to an end, please take note of the following dates regarding the closure of Ashesi for the December holidays, and plan accordingly.  Semester dates are also available on the website. Administrative offices will be closed as of Tuesday December 19, and will re-open on Tuesday 2, January 2018. Academic Work and Examinations:End:                     Friday, December 15 2017Resume:             Freshmen, Monday January 8 2018. All continuing students, Monday, January 15 2018. Hostels on campus Deadline for moving out of hostels: Sunday December 17, 12 noon. International students who have permission from ODIP will move out on Monday December 18.·          Residents should submit all room keys to the front desk (Suala/Mohammed/Ali/Catherine/Prince) before leaving. Students will be asked to pay for lost keys.·          You may leave your clothing in your lockers. However, you do so at your own risk. Ashesi will not be held responsible for any items that go missing.·          Do not leave valuable items in your rooms.·          No food items should be left in the rooms or in the fridges in the kitchenette.·          An inspection will be conducted to ensure that rooms are left clean. If rooms are found to be dirty/unkempt, sanctions of 100 GHC will be applied and you will be barred from writing future exams until this fee has been paid. (See section 16.7 of handbook)·          Failure to comply with these procedures may attract penalties. Moving into hostels: Students may return to hostels up to 48 hours before your classes resume.  Exceptions have been granted to those who have received permission from ODIP, ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "meal plan ticketing support", "Message": "Hello, we, at OSCA, are requesting your assistance for next Wellness Wednesday. We will be using the meal plan ticketing system for students to purchase from vendors on the day. As you recall there were some issues with the process last month and would like to ensure this will not occur again.We are enlisting the help of 5 students to man the system and they will need a short induction on how it works. This needs to take place on Tuesday. Can you please allocate someone from your department to assist?I will not be on campus on Tuesday but Auntie Dee will be. The student responsible is copied in this mail, she’s called Isatou Jallow Thank you Billie RichardsonWellness Coach and CounsellorAshesi Universityfrichardson@ashesi.edu.gh0244072106   ", "Class": "2"}, {"From": "Mercy Weguri Guriyire <mercy.guriyire@ashesi.edu.gh>", "Subject": "Uber available on campus", "Message": "Good afternoon, There is an Uber on campus. Please reach out to Alphonse on 0244218168 Best, Mercy Guriyire", "Class": "2"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "Use of Teleconference Equipment in Norton Moutoulsky - April 20th & 21st", "Message": "Good morning, I trust this finds you keeping well. On April 20th & 21st, the BA department will organize an entrepreneurship Hackathon in Norton-Moutoulsky. The Hackathon will include live webinars and Zoom/Skype workshops organized with resource personnel, etc. In light of this, we kindly request that the teleconference equipment in Conference Room 209 is set up in Norton-Moutoulsky for this purpose. Looking forward to a response at your earliest convenience. Best regards, William Ohene AnnohProgramme Coordinator | Business AdministrationAshesi University College1 University Avenue Berekuso E/RTel: +233 (0) 302 610 330 Ext: 1021Phone: +233 (0) 244 567 735Email: william.annoh@ashesi.edu.gh  ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Newest Additions to the Ashesi Team", "Message": "Dear All, Kindly find below our newest additions to the Ashesi Team. Do extend your warmest welcome to them and lend a hand to help them settle into the Ashesi Community.                                Name: Leonard BaerPosition: Associate ProfessorDepartment: Business Administration Name: Godwin AyetorPosition: Adjunct FacultyDepartment: Engineering Name: Louis AsieduPosition: Adjunct FacultyDepartment: Engineering Name: Heather BeemPosition: Adjunct FacultyDepartment: EngineeringName: Kofi Amponsah-DuoduPosition: Adjunct FacultyDepartment: Business AdministrationName: Lorenzo TorresaniPosition: Fulbright LecturerDepartment: Computer Science  Name: Billie RichardsonPosition: Part-Time Wellness Coach and CounsellorDepartment: OSCA  Name: Jacob Opantu AbeneyPosition: Faculty InternDepartment: Business AdministrationName: Enoch AgonyoName: Samuel Bansah", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "#AshesiFavSpot Challenge", "Message": "    Hello lovely people,The #AshesiFavSpot Challenge is ending this Thursday 22nd February at 5pm. Winners will be announced on Friday 23rd February at 3pm.Keep your entries coming in. The stakes are high; be wild, be creative!! Regards,PR Committee  Wayne Jotham Gakuo | Bsc. Computer Science |Class of 2019 | Public Relations Committee Chairperson- Ashesi Student Council |I.T. Intern | Ashesi D:Lab Management Intern for Media |Ashesi University College, Ghana|wayne.gakuo@ashesi.edu.gh | +233 26927 9780| +254 7269 38259", "Class": "2"}, {"From": "Anna Reimmer <areimmer@ashesi.edu.gh>", "Subject": "Shuttle Arrangements from Thursday, October 18 and 19th.", "Message": "Dear all, Kindly be informed that, the all-white bus with registration No. GT 1078-16, usually driven by Samuel Bansah has undergone its major maintenance servicing this afternoon and will be back next week. In line with this, the department has rented a white-purple Toyota coaster bus with registration No: GN 3738-18 to run the schedule indicated below both on Thursday and Friday, October 18-19 respectively: CTK-37-Shiashie-Okponglo-Atomic-Madina-Kitase routes at 7:05am and 5:10pm.•Name of Driver:  Victor Ntri•Phone No.: 024 502 0782• Please take note of the following changes in the bus schedule:Mr. Eric Tetteh McCarthy (024 278 0788) driving the white/purple coaster with registration No. GX 1834-17; will ply CTK-37-Shiashie-Okponglo-Atomic-Madina-Kitase route both at 6:15am and 5:45pm;1. Mr. Kenneth Amofah (054 418 1817), with car No. GT 6764-14 will drive the white and green coaster bus. He will be running the 6:40am and 6:00pm, KFC-Haatso-Atomic Roundabout-Aboum route.2. Mr. Peter Okwei (024 612 7843), using white-brown Coaster No: GX 1835-17, will ply his regular routes from KFC-Haatso-Atomic Roundabout-Aboum-Ashesi; both at 7:05am, 5:10pm and 8:00pm respectively.3. The afternoon schedule (1:15pm) remains unchanged.Thank you,Anna. ", "Class": "2"}, {"From": "David Amatey Sampah <dsampah@aucampus.onmicrosoft.com>", "Subject": "Android Mobile App Demo", "Message": "Hello All,The Introduction to computing and information systems freshmen class have been working on individual android mobile application. You are invited to pass by during the demonstration of their various applications, and if you happen to find one that is of interest, you can request an installation on your android device. Date: Wednesday 28th November 2018Times and Venues8am to 9:30am Norton Motulsky 207B9:45am to 11:15am Norton Motulsky 207B11:30am to 1pm Fab Lab You are free to attend all three sections to explore more variety of mobile apps. RegardsMr. David A. SampahFacultyComputer Science and Information Systems DepartmentAshesi Univeristy1 University AvenueBerekuso E/R, GhanaTel: +233 302 610 330 Ext:1022Email: dsampah@ashesi.edu.ghWeb: www. Ashesi.edu.gh   ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "", "Message": "", "Class": "2"}, {"From": "Angela Owusu Ansah <aansah@aucampus.onmicrosoft.com>", "Subject": "Pashington Obeng - Head of Humanities and Social Sciences Department", "Message": "Dear Ashesi Community, I am pleased to announce the appointment of Professor Pashington Obeng as the Head of Department for Humanities and Social Sciences at Ashesi. Professor Pashington Obeng has held teaching positions at Brandeis University, Wellesley College, Brown and Harvard Universities for the past twenty- five years. He specializes in Anthropology of religion on continental Africa, New World Afro-Atlantic areas, Indian Ocean & Transatlantic African Diaspora studies and cultural communication focusing on Black filmic representations. Dr. Obeng also supervised honors theses, guided students’ independent studies and coordinated the Africana Studies departmental colloquia and lecture series. In addition to his teaching career, he chaired the Africana Studies Department at Wellesley College, MA in 2005-2006, 2012-2013 and 2016-2017. Dr. Pashington Obeng is a graduate of the University of Ghana, Legon, where he earned his B.A. (Hons.) in English Literature and at Trinity College, Legon, where he studied for his Diploma in Theology in comparative religion. He received a Post- graduate Certificate in Educational Counseling and Planning from Cape Coast University. He also did Post -graduate studies in Journalism and Communication at Carleton University, Ottawa, Canada. He holds a Ph.D. from Boston University specializing in anthropology of religion and cultural communication in modern society. He is also a graduate of Princeton Theological Seminary, New Jersey, where he studied for his master’s in theological anthropology and communication.Professor Obeng has also held postdoctoral positions at the Center for the Study of World Religions and the Afro-American Studies Department both at Harvard University, Cambridge, MA and at St. Antony's College, University of Oxford, England. He is the author of Asante Catholicism: Religious and Cultural Reproduction among the Akan of Ghana (1996); Shaping Membership, Defining Nation: The Cultural Politics of African Indians in South Asia (2007); and Rural Women's Power in South Asia: Understanding Shakti (2014); Siddis ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Christmas on the Hill", "Message": "Dear Colleagues, Christmas on the Hill is scheduled for 6th December, 2018 . This is year has a lot of surprises in store as we celebrate an African-themed Christmas on the Hill. Do send through ideas to HR for the preparation towards our usual Staff and Faculty performance of the year!  Best regards, Aba ", "Class": "2"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "Art Opening Tonight with the Beyond Collective", "Message": " Dear friends, tonight Thu Oct 4 at 7 pm opens the yearly Beyond Collective exhibit in Icon house (open only for four day's as it is a pop-up!). It promises to be an exciting art exhibit, see details below. Also, I thought I'd create a mailing list for Ashesians interested in art, so if you want to continue getting emails like this one, please fill your details here: https://goo.gl/forms/BNFpZ0m7x3XQHhwH3 Hope to see some of you tonight!Kajsa Kajsa Hallberg Adu, PhD  Lecturer Team lead for the writing coursesGlobal Liberal Arts Alliance Liaison Ashesi University | PMB CT 3, Cantonments, Accra, Ghana | *NEW* Office 111  | Phone: +233.302.610.330, ext. 1058  | Skype: kajsahallberg |  Mobile: +233.249.187.210Twitter/Instagram : @kajsaha | Blog |  Linked in  |   The Beyond Collectivepresents MAKE BE  Public Opening:Thursday, 4th October 2018, 19.00", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "D:Lab Space Engagement Session", "Message": "D:Lab Space Engagement Session", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Weekly Wellness tips", "Message": "Weekly Wellness tips", "Class": "2"}, {"From": "Nicole Amoo - Yankey <nicole.yankey@ashesi.edu.gh>", "Subject": "Tech Era Final Offering", "Message": "      -“It has been exhilarating teaching and learning from these young ones and I always look forward to meeting them.”-“I realized that we tend to feel they need our help to get to a particular lace or pick something up, however, we should not forget that they are as capable as we are.” These are just some of the words used by the Tech Era team to describe the change that has been brought about throughout the course of this semester. Our team which now comprises 20 tutors and 17 executes has boasted itself in driving change in places such as Akropong and even closer to home at Berekuso Basic school…our cause slowly surpassing socio-economic barriers and disability…increasing computer literacy one willing student at a time.More than 100 visually impaired students fully equipped to partake in the technological world Maame Afia said the experience has been ‘EYEOPENING’ while Larkuo remarked that it was absolute ‘FUN’But  what we are doing is just a small part of the change that needs to sweep through our communities, Do consider joining us next semester and be apart of the change!     ", "Class": "2"}, {"From": "Edmund Hammah Ankomah <ehankomah@aucampus.onmicrosoft.com>", "Subject": "Watch this space...", "Message": "\"Anarchy is as detestable in grammar as it is in society.\" (Maurice Druon).The Englisheneers are coming! Are you ready?  “There is a time in every man's education when he arrives at the conviction that envy is ignorance; that imitation is suicide; that he must take himself for better, for worse, as his portion; that though the wide universe is full of good, no kernel of nourishing corn can come to him but through his toil bestowed on that plot of ground which is given to him to till. The power which resides in him is new in nature, and none but he knows what that is which he can do, nor does he know until he has tried.”  ― Ralph Waldo Emerson, Self Reliance ", "Class": "2"}, {"From": "Kenobi Morris <kmorris@aucampus.onmicrosoft.com>", "Subject": "An Uber arrives in an hour. Call Joel; 0206638599", "Message": "Dear All,  An Uber arrives on campus in an hour. Call Joel (0206638599) if you need one out.   Get Outlook for Android       ", "Class": "2"}, {"From": "Sebastian Dakey <sebastian.dakey@ashesi.edu.gh>", "Subject": "Big Ben is Back!", "Message": "Dear All, I trust this email finds you hale and hearty. Kindly be informed that Big Ben has resumed and will be running till 9 pm each day. Warm Regards,Sebastian DakeyClass of 2020 | Ashesi UniversityChoir Director | Ashesi ChoraleOperations Intern | D:LabCell: (+233) 572849365 Email: sebastian.dakey@ashesi.edu.ghAshesi: Website | Twitter | Facebook ", "Class": "2"}, {"From": "David Ebo. Adjepon-Yamoah <dadjepon@aucampus.onmicrosoft.com>", "Subject": "Uber Arriving", "Message": "Dear All, There will be an Uber on campus in 40 minutes. Please call James on 0247661484 if you want to book a journey with him. Regards,Ebo 8<----------------------------------------------------------------------------------------------------------David Ebo Adjepon-YamoahFaculty (Computer Science), Ashesi University1 University Avenue, Berekuso E/RPMB CT3, Cantonments , Accra, Ghana(Ashesi Front Desk: +233 302 610 330 OR +233 302 974 980) E: dadjepon@ashesi.edu.gh  T: (Ext) 1002W: http://homepages.cs.ncl.ac.uk/d.e.adjepon-yamoah/ResearchGate: https://www.researchgate.net/profile/David_Adjepon-YamoahGoogle Scholar: https://scholar.google.com/citations?user=D38IIN8AAAAJ&hl=en&oi=sra---------------------------------------------------------------------------------------------------------->8 ", "Class": "2"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "AIX lunchtimes & other info", "Message": "Dear Colleagues, We have 132 excited high school students on campus for the Ashesi Innovation Experience (AIX)!  Please extend to them a warm Ashesi welcome.  They have been oriented on how to relate to our campus and the people on it, so we don’t envisage any challenges.  However, if you notice anything out of order or have any concerns, please do let Anna Poku (copied) or me know right away. AIX lunchtimes at Akornor are at the following times this week:Monday, Tuesday, Thursday and Friday: 1pm – 2pm•Wednesday: 12 – 1pm• You may wish to avoid the long queues at Akornor at these times.  Apologies in advance for any inconvenience. Best wishes,Ayorkor -- G. Ayorkor Korsah, Ph.D.Senior Lecturer of Computer Science & RoboticsHead, Computer Science Department Ashesi University1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, GhanaEmail: akorsah@ashesi.edu.gh | Phone: +233 30 261 0330 Ext. 1029 ", "Class": "2"}, {"From": "Kennedy Mintah <kennedy.mintah@aucampus.onmicrosoft.com>", "Subject": "DeSports On Wednesday", "Message": "DeSports On Wednesday", "Class": "2"}, {"From": "Emma at Teamwork.com <marketing@teamwork.com>", "Subject": "Earn Money By Referring Teamwork.com", "Message": "Earn Money By Referring Teamwork.comWe’ve made some exciting new updates to our referral program. Now, if you refer Teamwork Projects or Teamwork Desk to a friend, you can earn up to $1000 on each referral. It’s really easy and there’s no limit on the number of users you can refer.Read moreWant out of the loop? Unsubscribe from all blog updates, feature updates and product help emails, or manage your subscription.  Our postal address: Teamwork.com, Teamwork Campus One, Blackpool Retail Park, Blackpool, Cork, T23 F902, Irelandview in browser", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "We Cannot Keep Calm in the D:Lab This Week", "Message": "Hello Ashesi Community,Welcome back to the second half of the semester and it is our hope that you are pumped up for what lies ahead in the remainder of this semester. We cannot wait to show you what we have in store for you this semester since our project leads have been working tirelessly to ensure that their projects are in tip-toe shape. Below are some of the activities happening in the Ashesi D:Lab this week: Farm Modelling ProjectTuungane Cosmopolitan Gardening1. The Tuungane team will be carrying out a daily routine of watering the crops to ensure they stay healthy and fresh. They will also be grinding and mixing the available organic pesticides while at the same time weeding at the nursery beds. Seedlings will also be transplanted from the nursery bed to the main farm. More nursery beds in the farm will be prepared for the next planting of new crops. You want to see how the green and leafy crops look like right now? Pass by the Tuungane Farm and see the far the team has gone to ensure that this is a success!Vertical Farming2. The Vertical Farming team previously cut bottles to start the necessary preparations for the “farm in the air”. This week, they will be meeting to plan how well they will accomplish the remaining tasks they have to get through the rest of the semester. They will also be adding a new member to the team; Ayawen Asuinura of the class of 2020. Also watch out for the Ashesi D:Lab stand at the Ashesi University Career Fair this Wednesday 14th March 2018! You are not ready for this! Did You Know that our Intern Yoofi Brown-Pobee can eat Chinese but if he eats Chinese…(you need to listen to the rest) Find out more  here Want to know more about the Ashesi D-lab and its projects? Check out the links below:bit.ly/ashesidlab (Wordpress)bit.ly/dlabpictures (Flickr)bit.ly/dlabvideos (YouTube)For Twitter : @AshesiDesign", "Class": "2"}, {"From": "David Ebo. Adjepon-Yamoah <dadjepon@aucampus.onmicrosoft.com>", "Subject": "[REMINDER] Invitation to Showcase of Software Engineering Projects", "Message": "Hello All, This a quick reminder of your invitation to the Software Engineering projects' showcase/demonstration today. Students (in teams) will present posters and demonstrate their projects. Date: Wednesday 28th March 2018Time: 13:00 - 14:00Venue: Computer Lab 1 To accurately and easily capture the URL links (or website 'addresses') of the projects, we have generated QR codes. So we recommend that you install QR code readers/scanners on your phones to access these websites.See you all soon! Kind regards,Ebo  8<--------------------------------------------------------------------------David Ebo Adjepon-YamoahFaculty (Computer Science), Ashesi University College1 University Avenue, Berekuso E/RPMB CT3, Cantonments , Accra, Ghana(Ashesi Front Desk: +233 302 610 330 OR +233 302 974 980) E: dadjepon@ashesi.edu.gh  T: +233 (0) 205227760                   Ext: 1002W: http://homepages.cs.ncl.ac.uk/d.e.adjepon-yamoah/ResearchGate: https://www.researchgate.net/profile/David_Adjepon-YamoahGoogle Scholar: https://scholar.google.com/citations?user=D38IIN8AAAAJ&hl=en&oi=sra-------------------------------------------------------------------------->8   ", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "Talk in Koo Nimo", "Message": "Dear All: This is a gentle reminder about the talk (see attached flyer) on the legendary highlife musician Koo Nimo by Mr. Obeng-Amoako on Thursday (22nd March, 2018). The location of the talk is Engineering Room 202 at 4.20 pm. This talk is hosted by the Ghanaian Popular Culture class. In preparation for this talk, please be familiar with the information below A Very Short Biography: https://www.allmusic.com/artist/koo-nimo-mn0000110808/biography 1. A Succinct Overview: http://www.eastafricanmusic.com/koonimo.htm2. Two Music Clips of Koo Nimo3.  a. \"Owuo te se Nnoboa\" (Death is like Colloborative Farming) https://www.youtube.com/watch?v=xXhmiQt4oy4 b.  Industry of the Ant -- https://www.youtube.com/watch?v=DYJYFM2mAck    Joseph Oduro-Frimpong, Ph.D. Assistant Professor Department of Arts and Sciences Ashesi University 1 University Avenue, Berekuso, E/R PMB CT3 Cantonments Accra, Ghana joduro-frimpong@ashesi.edu.gh", "Class": "2"}, {"From": "", "Subject": "", "Message": "", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday Health tips", "Message": "Wellness Wednesday Health tips", "Class": "2"}, {"From": "Ayorkor Korsah <akorsah@ashesi.edu.gh>", "Subject": "Interesting talk on AI in Accra on Thursday", "Message": "Dear all, Kindly see below for information about an interesting public lecture related to Artificial Intelligence, that will take place in Accra on Thursday.  For those on mid-semester break, I hope you're enjoying the break!  Best regards, Ayorkor Korsah  Get Outlook for Android From: Nana Fosu <fosun@aiti-kace.com.gh> Sent: Tuesday, October 23, 2018 12:25:24 PM To: Ayorkor Korsah Subject: Technology Innovation Seminar & Info Session @AITI-KACE - Thursday, 25th October, 2018 Dear Prof,As discussed, here's the invitation and poster we sent round.Thanks for agreeing to share this with your students.Best.Nana Fosu ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- Dear Friends,You are invited to join us as we host technology tech luminary and inventor Prof. Kumar on Thursday 25th October 2018, 2:00pm at Kofi Annan Centre of Excellence in ICT (AITI-KACE).Prof. Kumar who's the current Director at Carnegie Mellon University (CMU) – Africa, will be sharing his thoughts on how Ghana and Africa as a whole, can leverage on emerging technologies particularly in artificial intelligence, data science, cybersecurity, mobile systems, networks, information and communication technologies to tackle their challenges.The event which is under the auspices of the CMU – Africa, will also feature an information session on new opportunities available at CMU – Africa including full/partial scholarships for Masters in Information Technology ", "Class": "2"}, {"From": "Bridgette Abakah <babakah@ashesi.edu.gh>", "Subject": "Re: HEALTH FAIR IS TOMORROW", "Message": "HEALTH FAIR IS ONGOING NOW!!!! Do pass by and get check.  Bridgette Abakah|Nurse Administrator- Ashesi Health Services  Ashesi University 1 University Ave, Berekuso-E/R PMB CT 3, Cantonments, Accra GHANA Tel: 0501331668, 0248883211 babakah@ashesi.edu.gh  From: Bridgette Abakah Sent: Thursday, November 22, 2018 4:32:18 PM To: Ashesi Community Cc: Selase Aku Tsiagbe; Antoinette Emefa Quintin - Cofie; Clement Owusu Subject: HEALTH FAIR IS TOMORROW DearDear All,TOMORROW is HEALTH FairWhy should be part of this health fair?A wide range of medical services are available for you.    Full Blood CountCheck Hemoglobin level (Anaemic or not)Check presence of infectionsProstate Specific AntigenA blood test to check for the presence of the prostate cancer causing antigen for 35 ", "Class": "2"}, {"From": "Nana Ama Entsie <nentsie@aucampus.onmicrosoft.com>", "Subject": "", "Message": "", "Class": "2"}, {"From": "Kobina Graham <kgraham@ashesi.edu.gh>", "Subject": "Art Exhibition Today", "Message": "Hello Everyone,  I would like to invite you all to a pop-up art exhibition/talk that Eli Tetteh & I are helping to curate today at 4pm at Serallio in Osu.   Tickets will be sold at the door at GHc40 each. Here is the some info on what it's all about:  There is no escaping art.  It surrounds us: in everything from the fabrics we wear to the labels adorning what we drink.  Black people have long created and revered art. Yet, from music to visual arts to product design, the gift to create art is one of the least valued in Africa and throughout her diaspora. As a result, our people have rarely successfully built wealth that we could hand down from generation to generation by pursuing our art.  Hidden in a walkthrough maze with new experiences at every turn, One Night Stand will be a uniquely experiential celebration of black art in its many forms.  Attendees will have multidimensional experiences of the art on display and dive into sonic interpretations that bring each piece alive through combinations of sight and sound.  How do we invest in, develop and spread our art across a world that has always been eager to dance to our music or take inspiration from our fashion? How do we invest in sustainable creative industries that serve our own interests? These are the questions One Night Stand hopes to articulate and engage with.  The exhibition will be followed by a in-depth conversation on the experiences of the artwork, the future of Ghana’s creative scene and the way forward in creating generational wealth for our collective benefit.  Purchase your ticket and guarantee yourself a night of immersive experiences.  #OneNightAccra      ", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "FW: Thank you for making our 1st Wellness Wednesday a total success", "Message": "  From: Diane Davis  Sent: 15 February 2018 18:03 To: Staff <Staff@ashesi.edu.gh>; Faculty <Faculty@ashesi.edu.gh>; Faculty Interns <FacultyInterns@ashesi.edu.gh>; Students <Students@ashesi.edu.gh> Subject: Thank you for making our 1st Wellness Wednesday a total success Dear Ashesi community. Thank you so much for making our 1st Wellness Wednesday a total success. We  had so much fun. We came together as a community and enjoyed the day. Please enjoy the attached video and photos of the day’s events. We plan to do this once a month and all suggestions are welcomed.  Best regards Aunty Dee    ", "Class": "2"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "LOST AND FOUND", "Message": "Dear All,If any of these items belong to you, kindly visit Radichel Hall 102A for identification and collection.Thank you.Kind regards,Dzifa            Get Outlook for AndroidGet Outlook for AndroidGet Outlook for Android ", "Class": "2"}, {"From": "Margaret Odero <margaret.odero@aucampus.onmicrosoft.com>", "Subject": "Chapati from Chef's Game", "Message": "Chapati from Chef's Game", "Class": "2"}, {"From": "Nepeti Nicanor <nnicanor@ashesi.edu.gh>", "Subject": "Also try the Uber driver Yeboah on 0243932720", "Message": "  Get Outlook for Android ", "Class": "2"}, {"From": "Anna Aggrey <aaggrey@aucampus.onmicrosoft.com>", "Subject": "AIX 2018 Coach Applications Opened!!", "Message": "Dear students, Once again, our annual Ashesi Innovation Experience program is here with us! It is scheduled to take place in August 2018. As you may know, AIX is a two-week-long programme for senior high school students that enriches their skills in Leadership, Design & Creative Problem Solving, Entrepreneurship, Engineering and Robotics. AIX is an impactful experience not only for the participants, but also for Ashesi students who serve as coaches.  Coaches will:assist facilitators in the classroom with the workshop’s activities•guide and support participants in and outside of the classroom, helping them make the most of the experience•live with the participants in the dorms•help to organize activities for the participants• Students interested in being coaches for this program should kindly fill in this form by Thursday, 8th March 2018 at 11:59pm. Shortlisted students will be contacted for interviews. Please note the following:Programme dates to commit to are as follows:Coach Training for AIX 2018 Programme: July 23rd - August 4th•AIX 2018 Programme: August 5th – August 19th• Eligibility:Coaches should be at least 18 years old.•Coaches should be preferably Seniors, Juniors or Sophomores but mature freshmen are welcome to apply.•All majors are acceptable, but you must be comfortable with using computers and not be afraid of exploring and learning new things.• Required skills:Positive attitude•", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Invitation to Class Simulation", "Message": "Dear All, You are kindly invited to the class simulation of Prince Baah (Adjunct Faculty Candidate) happening today at 3:00pm in Conference Room 209. He will be teaching on the topic below: “Introduction to International Trade “ (as will be taught in an introduction to Micro Economics Class) Kindly be present as your feedback is essential to our recruitment process.  Best regards,     Theresa Dei DzanieHR Coordinator│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "Be The Parent Of the Crops We will Grow!", "Message": "Greetings from the D:Lab,A happy Conversation.Me: Hello, do you have or will you ever buy a 1.5 liter bottle between now and Sunday?You: oh yeah!Me: Great! Kindly try and empty it first. Then, write your name or initials on it. Afterwards, dump them on the lawn opposite Hakuna, close to the B.ball court. Or, the lawn close to the library, opposite the student hangout. If you go off campus, please keep try and keep them away from other wastes and someone will come pick them up. (you could volunteer to gather those in your hostel to campus too).You: What are you using them for?Me: We are using them for vertical farming. We will grow crops in them. The good part, after the crops germinate, you come to the farm & we will take you to all the bottles you donated for you to see your “babies”.You: Woowww!!! I can’t wait to see my “babies”.Me: No problem, just start donating your bottles NOW. End of conversation. I hope we all get it. So, let’s just do it. Regards,Farm Modelling Team.   Wayne Jotham Gakuo | Bsc. Computer Science |Class of 2019 | Public Relations Committee Chairperson- Ashesi Student Council |I.T. Intern | Ashesi D:Lab Management Intern for Media |Ashesi University College, Ghana|wayne.gakuo@ashesi.edu.gh | +233 26927 9780| +254 7269 38259", "Class": "2"}, {"From": "Diane Davis <ddavis@ashesi.edu.gh>", "Subject": "Wellness Wednesday", "Message": "Good afternoon Ashesi Community PLEASE COME AND SUPPORT TODAY.The final Wellness Wednesday of the semester is here! Here is the outline of the day: Food and healthy products vendors available on campus(8:00 am to 5:00 pm)•Fitness Challenge progress update(11:00 am to 5:00 pm)•Massage at the health center (10:00 am to 5:00 pm)•Fresh salads•Decathlon on campus (10:00 am to 5:00 pm)•Aunty Dee  Diane DavisDirector of Counselling and Coaching Ashesi University College1 University Avenue, Berekuso E/RPMB CT3 CantomentsAccra, Ghana. Tel: +233 30 261 0330 Ext: 1057 Cell: +233 50 156 9909  ", "Class": "2"}, {"From": "Patrick Awuah <pawuah@ashesi.edu.gh>", "Subject": "Thank you for a successful commencement ceremony", "Message": "Hello All, This is just a short note to thank you all for helping making Commencement 2018 a success. This was a historic celebration for us, with the award of our President Charter by His Excellency, President Akufo-Addo; and the first conferment of Ashesi degrees to our graduating class. Thanks to all of you for helping us reach this important milestone! We were sorely tested by the rain, but we pulled together and got through the ceremony, come rain or shine. From Professor Adei’s extemporaneous MC skills; to Theophilus Hiametu’s valiant efforts to reduce rain water pooling on the canopy; to the Ashesi chorale’s uninterrupted music; to the emergency canopy patch done by Adjunct Lecturer, Kofi Duodo (Assistant Naval Secretary of the Ghana Navy); to many other efforts, big and small; our team pulled together to keep the show running. In typical Ashesi style, I encourage all departments that participated in running the logistics for this event to do a postpartum review of what went well and what we could do better, so that in subsequent years we will see a more fluid ceremony, come rain or shine. Thanks again, everyone. Onward and upward! Patrick p.s. I have attached a picture of Kofi Duodo patching the canopy. Enjoy. ---Patrick G. Awuah, Jr.", "Class": "2"}, {"From": "David Asumadu-Boateng <dboateng@ashesi.edu.gh>", "Subject": "Cybersecurity Workshop", "Message": "Dear All,As you are all aware, the University has made significant IT investments to build a robust and secure infrastructure that supports teaching and learning, administrative work, research and other service activities at the university. The IT Departments security plan includes steps to build awareness on cybersecurity issues and trends, provide resources and guidelines, encourage good cybersecurity habits and the proper handling of information security incidents. As a result of this, IT Team would like to humbly invite you to its Cybersecurity workshop scheduled for staff on Tuesday 24th July 2018 @ Norton Mortolsky Hall [10:00am -11:30am] This activity is a cybersecurity awareness project and we would encourage every computer/laptop/phone user on ashesi network to attend this session. Sessions are interactive with demonstrations/simulations using real time hacking tools. You will also learn how: Higher Education Cyber Attack Trends•Phishing Emails•Online Payments/Banking Transactions•Password Management,•", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "ANDE Membership for you!", "Message": "Hello,   As some of you may know, Ashesi University is an Aspen Network of Development Entrepreneurs (ANDE) member, which means that as an employee, you have access to all of the member benefits. Here are pointers you can use to learn more about ANDE and take advantage of their network of over 250 organizations globally that support small and growing businesses (SGBs) in developing countries. 1)        Create a member login by clicking here. This login gives you access to working groups and regional chapter emails and allows you to email other ANDE members directly. 2)        Watch the ANDE Member 101 (password: ande), which discusses in detail what ANDE does and how they can support you and your work. 3)        Read the ANDE one-pager for a quick overview on how to get involved. The one-pager also provides contact info for their regional staff. 4)        Post updates about what your office is up to on their public-facing Notes from the Network blog. Instructions on how to post are here. 5)        Reach out to me (gadomdza@ashesi.edu.gh) or to Lauren Farello (Lauren.Farello@aspeninst.org), the ANDE Membership Program Coordinator, with questions!  Still reading?  The following are some specific points of interest for us as we learn from venture incubation from around the world. Global Accelerator Learning Initiative: University-led accelerator initiative.•There is a new GALI website and data portal where users can access GALI publications, use interactive filters to explore our dataset of over 8,500 startups, learn about the landscape of accelerators, and search a directory of accelerators from around the world. Link here.•Interesting reports (on emerging market acceleration & insights from a Village Capital program) interesting.•", "Class": "2"}, {"From": "Edmund Hammah Ankomah <ehankomah@aucampus.onmicrosoft.com>", "Subject": "Über arriving on Campus in an hour", "Message": "Good afternoon All,Sammy, Über driver, will be on campus in an hour. Please contact him if you need a ride. 0542809997.Regards,Edmund  Edmund Hammah AnkomahAssistant Lecturer, Ashesi University CollegeBerekuso, E/R", "Class": "2"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "Ashesi Economic Lecture Series", "Message": "Good morning all, I trust this e-mail finds you well Ashesi Economic Lecture Series (AELS) is here again and for the next session, Kosmos Energy will be given the platform to educate students on the oil and gas sector. Kosmos Energy is a premier international oil and gas exploration and production company focused on underexplored regions along the Atlantic Margin, and has made several discoveries offshore West-Africa including the Jubilee Field in Ghana. The lecture will focus on providing insights into the oil and gas industry and its contribution to the economic growth of the country with emphasis on petroleum exploration and production, petroleum revenue allocation and Ghana’s gas potential. See details of this edition of the AELS below: Date: 4th April 2018Location: LH 216Time: 2:40pm – 4:10pm Many thanks and see you there. Warm regards, William Ohene AnnohProgramme Coordinator | Business AdministrationAshesi University College1 University Avenue Berekuso E/RTel: +233 (0) 302 610 330 Ext: 1021Phone: +233 (0) 244 567 735Email: william.annoh@ashesi.edu.gh  ", "Class": "2"}, {"From": "Daniel kwaku Bempah <daniel.bempah@ashesi.edu.gh>", "Subject": "ON THE SPOT: A StoryTellers (YouTube) Feature Series", "Message": "Hello world, On behalf of the StoryTellers Club, I would like to introduce you to our latest production: ON THE SPOT, a StoryTellers (YouTube) Feature Series. On ON THE SPOT, we find wonderful people in the Ashesi community and get to know them and their creative work and interests.  On this season of On The Spot, we interviewed 8 creatives in Ashesi in the fields of Music and Dance, Film and Photography, Creative Writing and Poetry, and finally Visual Art and Fashion on what makes them tick, what they love (and hate), and the creative projects they have worked/are working on.  For our first episode, we put Joshua Mahama, aka HAMA, Ashesi's most energetic rapper and dancehall artiste on the spot. We talked about his life and family, collaborating with the likes of E.L, La Meme Gang, IFKR, and his creative process, among other things. Be sure to check this exciting interview out on our youtube channel, and do well to like and subscribe!  https://www.youtube.com/watch?v=dGpD_WGW-EUON THE SPOT | Episode 1 | HAMAwww.youtube.com'ON THE SPOT' ; A Storytellers feature series with some of Ashesi University's finest creatives with ongoing creative projects in different genres. Episode 1- Ghana's ...    ", "Class": "2"}, {"From": "Selase Aku Tsiagbe <stsiagbe@aucampus.onmicrosoft.com>", "Subject": "Sickle Cell Awareness Day", "Message": "   Dear All,        For further information about sickle cell visit the health center and let us talk.                                      ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "CAUGHT BEING GOOD - OCTOBER EDITION", "Message": "Caught Being Good is Back!!!  Caught being good is an OSCA initiative to celebrate every day actions that make a positive impact in our community. Our goal is to encourage each other to do good every day and live out the values for which Ashesi stands for. You can join celebrate these amazing people by nominating an individual or group using our nomination forms.  As usual, kindly use this form to throw in your nominations for this month.  \"Whatever you are, be the good one\" - Abraham Lincoln Catch you on the flip side! Nadia AmasaStudent Activities Coordinator Ashesi University1 University Avenue Berekuso E/RPhone: +233 (0) 245433570Email: nadia.amasa@ashesi.edu.gh ", "Class": "2"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Immigration Processes Begin Today!!", "Message": "Good morning Everyone, Kindly note that the immigration processes starts from today, Wednesday, October 3 and ends on Thursday October 4. The Ghana Immigration Services Team and the Ghana Card Team will be at the Greene Lounge, King Engineering Building from 10:00am to 4:30pm on both days. Do take note of the following: After you are done with the Ghana Card process photocopy your non-citizen ID and add the photocopy to documentations needed for the Residence Permit. The immigration officers will take the documents and payment for your residence permit.(Submit all documents to the Immigration Officers) PS: THE ODIP WILL NOT TAKE ANY DOCUMENTS FOR RESIDENCE PERMIT. SUBMIT ALL DOCUMENTS FOR RESIDENCE PERMIT AND MAKE PAYMENTS TO THE IMMIGRATION OFFICERS. Kindly refer to previous emails for further information. Sincerely, Benardine Holdbrook GhansonDiversity and Inclusion OfficerOffice of Diversity and International ProgramsAshesi University 1 University Avenue Berekuso E/R Tel: +233 (0)302610330  Ext: 1056Email:bghanson@ashesi.edu.gh  From: Benardine Holdbrook Ghanson  Sent: Tuesday, October 2, 2018 10:39 AM To: Ashesi Community <AshesiCommunity@ashesi.edu.gh> Cc: Office of Diversity and International Programs <odip@ashesi.edu.gh> ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Out of Office", "Message": "Dear All,  I will be out of office from 28th May, 2018. Kindly note that Theresa Dei  - tdzanie@ashesi.edu.gh  -will be leading the HR office during the period I will be away. Do contact her with anything you may need.  She will also know how to reach me if necessary. Best regards,Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "2"}, {"From": "David Asumadu-Boateng <dboateng@ashesi.edu.gh>", "Subject": "Out of office", "Message": "Dear Aba,  Please note that I will be off campus today with Daniel and some account staff to participate in the GhIPSS conference at Mariot Hotel today. This is in line with new payment policies on mobile money interoperability between telcos and banks.  Regards   David   Get Outlook for Android ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Uber in 10minutes", "Message": "Dear All, There will be an Uber on campus in 10minutes.  Kindly call Stephen on 0246450102 if you need a ride. Regards, Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday 3", "Message": "  Good morning Campus Here are your Wellness Tips of the week J Take a nap. If you have the time during the day, a short nap can do wonders for your energy levels. Just make sure not to nap too close to bedtime or for too long, and a nap will do your body good. Always use protection. Unless you are in a long-term, monogamous relationship with a partner who has been confirmed STD-free, always make sure to use protection to prevent the risk of contracting a disease. Wear flip flops in the shower. Dorm bathrooms are generally cleaned daily, but can become dirty quickly with many students sharing them. Always make sure to wear sandals in the shower to avoid getting viruses and bacteria that can cause warts and athlete's foot.  This initiative is brought to you by the Wellness Coaching department in collaboration with the ASC Welfare committee Billie RichardsonWellness Coach and CounsellorAshesi Universityfrichardson@ashesi.edu.gh0244072106  ", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "Announcements", "Message": "  Hello all,A few announcements to note:The IT Team has been made aware of the Courseware issue being experienced by some students. Kindly take a screen-shot of the message being displayed and a short description of the problem, your name, school ID and email it to Ashesi Support Center. Do this so that they can work on it as soon as possible.• In regards to Business-on-Campus emails, due to requests from a few students who have business operations on Mondays, we have shifted the day & time of sending of emails from Mondays 10.00am to Sundays 8.00pm. This means that whoever needs business-on-campus emails sent out should send their emails following the Standard Email Template (attached) by Sunday 3.00pm to either Angella Nantambi (angella.nantambi@ashesi.edu.gh ) or Libehela Kabi (Libehela.Kabi@ashesi.edu.gh ). Emails that do not follow the Standard Email Template will not be forwarded to the student’s body.• Have an awesome Sunday evening and a fruitful week ahead. Regards,PR Committee  Wayne Jotham Gakuo | Bsc. Computer Science |Class of 2019 | Public Relations Committee Chairperson- Ashesi Student Council |", "Class": "2"}, {"From": "Postmark Newsletter <support@postmarkapp.com>", "Subject": "Paid writing opportunity, how to send more effective emails, ", "Message": "and a big update to the JS library", "Class": "2"}, {"From": "Abdul Mahdi <amahdi@aucampus.onmicrosoft.com>", "Subject": "AJC ruling on alleged lying to University Officials", "Message": " AJC ruling on alleged lying to University Officials  On July 11, 2018 the Ashesi Judicial Committee (AJC) adjudicated a case of social misconduct.  The AJC arrived at the conclusion that the student, a member of the Class of 2021 was guilty of lying to university officials. The student admitted before the committee and other witnesses present at the hearing that she/he concocted an elaborate sickness to avoid a scheduled meeting with the Dean of Students & Community Affairs about an alleged case against her/him. As stated in Ashesi’s student handbook: “Ashesi University, its students, and its professional associations will not in any way condone cheating, lying or any other misrepresentations. Moreover, anyone who willingly conceals these activities will be considered accomplices and equally culpable ” (Section 7.5). Furthermore, the student handbook states that lying to a university office or official is a violation of the university’s rules and regulations. “A student should not knowingly provide false information or make misrepresentation to any university office. Students are obligated to provide University personnel with truthful and accurate information upon request, and accurate identification upon request. Students who are found to have provided false information may be subject to dismissal” (Section 9.2). After deliberating, the AJC arrived at this sanction:  The student will be suspended for one semester, August – December 2018.  ", "Class": "2"}, {"From": "Nadia Amasa <nadia.amasa@ashesi.edu.gh>", "Subject": "CAUGHT BEING GOOD WINNERS - OCTOBER 2018", "Message": "CAUGHT BEING GOOD WINNERS - OCTOBER 2018", "Class": "2"}, {"From": "Abigail L Welbeck <awelbeck@ashesi.edu.gh>", "Subject": "[Winners] DSC Ashesi + Ashesi Career Services Portfolio Workshop", "Message": "Hello Ashesi Community, On the 22nd of September 2018, the Developer Student Club-Ashesi University in partnership with Ashesi Career Services, held a workshop on building a portfolio website. After the workshop, the attendees were assigned the challenge of completing their personal portfolio websites and submitting links to these websites for review. We are pleased to announce the winners of this challenge: Stacy Nyamekye Sarfo (class of 2022) – 1st Place1. Wisdom Tochi Kalu (class of 2022) – Runner Up2. Josephine Boatemaa Amankwah (class of 2021) – Runner Up3. Stephen Owusu (class of 2020) – Runner Up4.  Stacy gets to win a Developer Student Club- Ashesi University T-shirt with an Essentials Shop gift voucher of GHC 100.00 courtesy of Ashesi Career Services. The runners-up get to win an Essentials Shop gift voucher of GHC 50.00 each courtesy of Ashesi Career Services. Congratulations to all our winners. Kind RegardsAbigail Welbeck Associate Director of Career ServicesAshesi UniversityTel: (+233) 302 610 330 Ext: 1074Email: awelbeck@ashesi.edu.gh  ", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "Happening in the next 9min! (Ashesi D:Lab Content Series)", "Message": "Ashesi D:Lab Content SeriesWhat? – The Design Thinking Content Series powered by the Ashesi D:LabWho?- Tamisha Dzifa SegbefiaWhen? – Wednesday, 7th February 2018Time? - 2:40 pm - 4:00pmWhere? - McNulty Foundation  Building Mechanical  Lab The topic for this week? -   Storyboarding as a way of presenting new ideas in DT applicationThe Ashesi D:Lab is introducing a Design Thinking Content Series for the whole Ashesi community and D:Lab online users that will introduce the design thinking process to those not familiar with it and serve as a great way to go deeper for those who know of it. The most exciting thing about the DT Content Series is that it is co-developed with but taught by students! About our Speaker:  Tamisha Dzifa SegbefiaTamisha is a freshman at Ashesi University College and a CS major. Over the past few months here at Ashesi, she has been very fascinated by the design thinking process and has been employing it more, even when planning her day.  \"Thanks to the introduction of DT in FDE, I've found it easier to analyze problems and fully understand how to put all of my ideas on paper, organized or not,\" she said.  Tamisha hopes to grow her knowledge in design thinking and share with others who haven’t been expose to the concept.", "Class": "2"}, {"From": "Steven W. Buchele <swbuchele@ashesi.edu.gh>", "Subject": "Leadership IVe Project Presentations - Today 4:20 in NoMo Hall", "Message": "Dear Ashesi Community, Today is the Leadership IV for Engineers presentations on the community projects they have been working on since last semester.  What: Leadership IVe Project PresentationsWhen: Today, 19-April at 4:20pmWhere: NO-MO Hall 207b Here are a few of the projects that will be presenting today:   Plastic Roads - Combining two things that Ghana has an abundance of plastic waste and potholes, this team has successfully made and applied a road patching material out of plastic waste. [blog] This really works! Solar Lights for Berekuso Clinic - Years ago Ashesi students fundraised and installed a solar gen-set from Burro.  It had stopped working, so this team repaired the gen-set and installed a light system for the labor and delivery room for the village clinic.  [blog] Before, nighttime babies were delivered by cellphone torch. Cassava Miller for Ayim - this was an ambitious student project to design/build a mechanical human powered cassava grinder to replace the graters what are currently used.  [blog]  A significant amount of community involvement was incorporated in this project and their prototype is impressive.  There are several more interesting projects to read about on www.berekuso.com   Leadership IVe is a specialized final leadership course for engineering students that runs all year long.  In the first term, students interview a community to determine its needs, and then design an engineering solution to address those needs.   This term the students built their projects and worked with the community to refine them. Today present their project and what they learned in the process.", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "RE: Job opening: Deadline Expired, Can I still apply?", "Message": "Thank you. I will respond to her. Regards,Theresa From: Ashesi Support Centre  Sent: Wednesday, December 6, 2017 8:29 AM To: Theresa Dei Dzanie <tdzanie@ashesi.edu.gh> Cc: Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh> Subject: FW: Job opening: Deadline Expired, Can I still apply? Hello Theresa, Kindly find below issue and help out. Thank you. Regards,Ashesi Support CentreAshesi University CollegeBerekuso, Ghana Email           - supportcentre@ashesi.edu.ghWebsite     - www.ashesi.edu.ghPhone         - 0302610330Extension  - 1111Office         - Engineering Room 105 From: Jane Thomas [mailto:oluchithomas@gmail.com]  Sent: Tuesday, December 5, 2017 11:09 PM To: Ashesi Support Centre <supportcentre@ashesi.edu.gh> Subject: Job opening: Deadline Expired, Can I still apply? Hello Sir/Madam,  I write in response to the job opening for a wellness coach and cousellor at Ashesi University as forwarded to me by an Ashesi alumnus a few minutes ago.  ", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Accra UNICEF Hackathon", "Message": "Hello Ashesi! Are you interested in \"Partnership with Youth to Achieve the Sustainable Development Goals\"? UNICEF is hosting a summit that aims at showcasing how young people are using technology to tackle social issues to help achieve the Sustainable Development Goals.  Apply to be a participant!This hackathon aims to develop solutions that employ child-centered approach towards finding solutions to problems around SDGs 3 (Good Health & Well Being), 4 (Quality Education), 5 (Gender Equality), 6 (Clean Water & Sanitation), 8 (Decent Work & Economic Growth), 10 (Reduced Inequalities), and 13 (Climate Action). Seeking youth under 24 years old with any technical skills like website creation, graphic design, engineering, etc.  Date: Friday 19th to Saturday 20th October 2018Venue: Workshed (Nungua Link Road Baatsona, 47 Spintex Rd, Accra)Time : 9:00am - 4:00pm Deadline: Wednesday, October 17th Concurrent hackathons in Kumasi and Tamale. UNICEF Ghana will join Youth Advocates Ghana in the 2nd edition of the African Youth SDG summit. The four (4) best emerging talents will be brought to the conference in 7th - 9th November 2018 and stand the chance of winning cash prizes for their projects. APPLY HERE: http://bit.ly/accraunicefhackathon Apply to be a student mentor!We are seeking students mentors for the UNICEF Hackathon in skills such as engineering, computer science, design, and programming. Transportation cost will be covered and a small stipend provided.  APPLY HERE: http://bit.ly/accraunicefhackathonmentor", "Class": "2"}, {"From": "Gordon Adomdza <gadomdza@ashesi.edu.gh>", "Subject": "***Reminder: Generally interested in entrepreneurship? Info session on ", "Message": "Ashesi's ANDE Membership!Reminder!!! [smiley]  Greetings! ANDE info Session with the West Africa Office: http://www.andeglobal.org/?page=WestAfrica  Date and Time: Feb 13th, 2018 at 4pm  Venue: Conference Rm 209, Ashesi Univ  Guests:  Olatunji Ajani, Regional Chapter Manager and Joshua Adedeji, Senior Program Coordinator, ANDE West AfricaPurpose: To chat with interested participants about their member benefits & opportunities and how Ashesi can optimize on its ANDE membership.RSVP: masiedu@ashesi.edu.gh Below is the onboarding email you can use to join, even before the info session. Best Regards Gordon   Dear Faculty,   ", "Class": "2"}, {"From": "Antoinette Okyere <aokyere@ashesi.edu.gh>", "Subject": "Townhall and Charter celebration", "Message": "Hello everyone, Townhall is starting now at Archer Cornfield Courtyard. See you there!                 From: Antoinette Okyere Sent: Tuesday, November 20, 2018 11:07 AM To: Ashesi Community Cc: Abdul Mahdi Subject: Reminder: Townhall and Charter celebration - Tomorrow @3:30pm    Thank you             From: Abdul Mahdi Sent: Friday, November 9, 2018 9:28 AM To: Ashesi Community Subject: Save the date: Townhall and Charter celebration - Nov 21st  ", "Class": "2"}, {"From": "Araba Botchway <abotchway@ashesi.edu.gh>", "Subject": "2018 ADMISSIONS OPEN", "Message": "Dear Members of the Ashesi Community, A Happy New Year from the Ashesi Admissions Team.    Our 2018 Admissions season has officially begun! You may visit the admissions website to access either the new online application portal or download the paper forms. We will encourage all interested applicants to read the instructions carefully before proceeding with the applications. Please see www.ashesi.edu.gh for more information. Ashesi Ambassadors & Campus ToursStarting from 16th January to 30th March 2018, Ashesi will host various groups, including prospective students, on our campus. Kindly click on this link if you/a friend/group is interested in visiting campus. A team of student volunteers (Ashesi Ambassadors) will be leading the tours and helping create a memorable experience. The visits will include the following:§  A guided tour of our campus and facilities§  Presentation of our admissions criteria, processes and scholarships.§  Interaction with students, staff and faculty§  A question and answer session (Q & A) to address concerns of participants. We will sincerely appreciate your help in sending word out to family, friends, colleagues and institutions about the start of the 2018 admissions season & campus tour opportunities. We look forward to an exciting season. Do reach out to any member of the Admissions Team for clarifications as and when needed. Best Wishes, Araba  Araba Botchway (Ms.) | Director, Admissions and Financial AidAshesi University College, 1 University Avenue, Berekuso - E/R ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "WELLNESS WEDNESDAY TIPS", "Message": "Good morning Ashesians JIt Wednesdayyyyyy! I know we are on break but the Wellness fever doesn’t stop. In fact we are just warming up for next week’s Big Wellness Day on the 31stUniversity students aren't exactly known for their early to bed early to rise attitudes, but getting sleep is an integral part of staying healthy. Check out these tips to help you make sure you're resting enough.Take a nap. If you have the time during the day, a short nap can do wonders for your energy levels. Just make sure not to nap too close to bedtime or for too long, and a nap will do your body good.Don't work in bed. Working in bed can make getting to sleep harder. Keep your work space separate from your sleep space to keep insomnia at bay.Get a full night's rest whenever possible. While the amount of sleep each person needs varies, most people need 7-9 hours to feel fully rested. While this may not be possible every night, try to sleep a full night whenever you get the chance.Stick to a schedule. With different classes and work hours each day, it can be hard to stick to a schedule, but keeping sleep times similar from day to day can greatly improve your chances of getting a good night's sleep.Understand that lack of sleep can have a big impact. Lack of sleep doesn't just make you cranky, it can also reduce your ability to concentrate and to excel at class, so try to get as much sleep as you need.Work out bedtimes with roommates. When sharing a room with someone it can be hard to go to bed when you need to and not get woken up when you don't want to. Try to work with your roomies to make sure you each get the sleep you need.Make time to come and visit all our vendors and enjoy the Wellness VibeENJOY YOUR BREAK", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Our Christmas on the Hill Performance", "Message": "Dear All,An idea has been given for our performance for Christmas on the Hill scheduled for 6th December, 2018. The idea is to:Dance to the song https://www.youtube.com/watch?v=e9UXfwe76-g Akekho Ofana Nojesu (There’s no one like Jesus)Akekho ofana naye (There’s no one like Him)Akekho Ofana Nojesu (There’s no one like Jesus)Akekho ofana naye (There’s no one like Him) Siyahamba siyahamba akekho akekho (I have traveled everywhere, no one)Siyajika siyajika akekho akekho (I have looked everywhere, no one)Siyafuna siyafuna akekho akekho (I have searched everywhere, no one)Akekho afana naye (There is no one like Him) Nadia Amasa will be leading the simple-step choreography at 3.30pm today. Do come and learn so we can hold our position as the best Christmas on the Hill performance (no prior dancing experience required). regards,Aba ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday tips", "Message": "This week, is all about Stress.The most dangerous thing about stress is how easily it can creep up on you. You get used to it. It starts to feel familiar — even normal. You don’t notice how much it’s affecting you, even as it takes a heavy toll. That’s why it’s important to be aware of the common warning signs and symptoms of stress overload.Cognitive symptomsMemory problems•Inability to concentrate•Poor judgment•Seeing only the negative•Anxious or racing thoughts•Constant worrying•Emotional symptomsDepression or general unhappiness•Anxiety and agitation•Moodiness, irritability, or anger•Feeling overwhelmed•Loneliness and isolation•Physical symptomsAches and pains•Nausea, dizziness•Chest pain, rapid heart rate•Frequent colds or flu•Behavioral symptomsEating more or less•", "Class": "2"}, {"From": "Angela Owusu Ansah <aansah@aucampus.onmicrosoft.com>", "Subject": "Deanship Announcement", "Message": "Dear Ashesi family,By the end of 2018, both deanship positions, Dean of Engineering and Dean of Arts and Sciences, at Ashesi University will be vacant. Yet as part of Ashesi University’s growth and establishment as a nationally chartered and accredited learning organization, the deanship is a necessary leadership tier. After months of an unsuccessful search externally to fill the vacant and pending vacant positions, it has become apparent that our very able Heads of Departments have inherently extended their roles to effectively cover some of the dean-level responsibilities. The Academic Council, therefore approved, at a meeting on Wednesday, October 31st the promotion appointments of the following faculty members, effective immediately: Dr. Nathan Amanquah, to continue to serve a second year as Acting Dean of Engineering and Computer Science.  The position is a two-year term, and at the end of the second year of service, Dr. Amanquah will rotate off and Dr. Ayorkor G. Korsah, will serve as Acting Dean for a two-year term.  Faculty of Engineering and Computer Science will comprise•Department of Engineering. The Department of Engineering oversees Mechanical Engineering, Computer Engineering, and Electrical & Electronic Engineering.•Department of Computer Science and Information Systems (CSIS). CSIS has primary responsibility for overseeing and advising both Computer Science and Management Information Systems students. The Mathematics and Statistics faculty have been brought into the CSIS department. The math and statistics faculty will continue to run courses for all students, including engineering, computer science, management information systems, and business administration students.• Prof. Pash Obeng, to serve as Dean of Business, Arts and Sciences for a two – year term. The faculty of Business, Arts and Social Sciences will be made up of •Humanities and Social Sciences Department. This department is responsible for the liberal arts core curriculum.•Business Administration Department: This department is responsible for the Business Administration major and also offers courses towards the Management Information Systems major.• ", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "[Big Thanks] Hack-API Hackathon+ Signing Out for the Semester", "Message": "Good morning community,We hope this email finds you well and that your week promises to be an awesome one as we draw closer to the end of the semester and the year 2018.Last weekend, 30th November 2018 to 1st December 2018, the Developer Student Club Ashesi University held its first ever hackathon here on Ashesi campus at Fab Lab 303. Hack-APIs Hackathon was a 24-hour hackathon that saw students from Ashesi University, MEST, Ghana Technology University College, University of Cape Coast, Khophi and Khode, Valley View University, University of Education-Winneba, Accra Institute of Technology & Developers In Vogue collaborate in building solutions that seek to solve real-life problems using Cloudinary’s APIs. The hackathon started at 4.00pm on 30th November and ended at 4.00pm on 1st December 2018 (yes, it was an all-night hackathon!) with teams presenting their final solutions/applications that they built. It was an awesome hackathon that saw students who are beginners in the tech field emerging as one of the Top 3 teams in the hackathon: 1st Place: Team Dzifa from Ashesi University built a task oriented chat interface that allows you to upload pictures and uses Natural Language Processing to edit them in a very convenient way (change color, file format etc) They received a cash prize of GHS 10001. 2nd Place: Team iTour from MEST built an application that allows tourists to view images of various tourist destinations in Ghana. They received a cash prize of GHS 6002. 3rd Place: Team Phronesis from Ashesi University & MEST built a website application that allows students to view the available businesses on Ashesi 3. ", "Class": "2"}, {"From": "", "Subject": "", "Message": "", "Class": "2"}, {"From": "Kajsa Hallberg Adu <khadu@ashesi.edu.gh>", "Subject": "UN Rapporteur on Extreme Poverty and Human Rights", "Message": "Dear all, The UN Special Rapporteur on Extreme Poverty and Human Rights Prof. Philip Alston has concluded his visit to Ghana and will fast-track his full rapport to come out in June (as opposed to often a year after the visit). While we wait for the full rapport on the situation for the most vulnerable Ghanaians, we can read his press statement. http://www.ohchr.org/EN/NewsEvents/Pages/DisplayNews.aspx?NewsID=22951&LangID=E  This statement is important for:- Anyone who wishes to be well-informed on the situation on the ground for Ghanaians when it comes to extreme poverty.-Anyone who would like a well-respected human rights professor's view on the most pressing human rights issues of Ghana (Prof Alston earlier visited USA and Nigeria to do similar reports). - Students (Ignite!) and faculty planning impactful research, the press statement is a good starting point for current and relevant data and for pointing out pressing areas for intervention. Some highlights from the press statement:Issues where the topics of human rights and extreme poverty intersect according to Alston: Gender, •Criminal Justice, •Urban Poverty, •People living in informal settlements, •Sexual orientation and gender identity, •Persons with disability.• GOOD NEWS: \"Ghana remains a champion of democracy in Africa, and its record in achieving certain Millennium Development Goals by 2015 is impressive.  It met the targets for halving extreme poverty and halving the proportion of people without access to safe drinking water, and it achieved the ", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "Invitation to Class Simulation: CS Faculty", "Message": "Dear All, You are kindly invited to the class simulation of a prospective CS Faculty, Dennis Owusu, today at 2:00pm prompt in the Engineering Conference Room. He will be teaching on the topic below: Class session on Binary Search Tree as part of an undergraduate class in data  structures.• Kindly make it a point to be present as your feedback is needed for our recruitment process. best regards, Theresa Dei DzanieAssistant Manager- HR│Ashesi University College1 University Avenue Berekuso E/RTel: +233 (0)302610330  Ext: 1025Phone: +233 (0)264 778 700Email: tdzanie@ashesi.edu.gh ", "Class": "2"}, {"From": "Benardine Holdbrook Ghanson <bghanson@ashesi.edu.gh>", "Subject": "Update On Immigration Processes", "Message": "Hello Everyone, I hope you are all having a good day. Kindly be informed that new dates for the immigration processes will be communicated to you all soon. Do exercise patience and we do apologize for any inconveniences caused. If you have any questions or concerns, do not hesitate to pass by ODIP-Radichel 207 to ask or you can send an email as well. Sincerely, Benardine Holdbrook GhansonDiversity and Inclusion OfficerOffice of Diversity and International ProgramsAshesi University 1 University Avenue Berekuso E/R Tel: +233 (0)302610330  Ext: 1056Email:bghanson@ashesi.edu.gh  From: Benardine Holdbrook Ghanson  Sent: Tuesday, September 18, 2018 2:50 PM To: Ashesi Community <AshesiCommunity@ashesi.edu.gh> Cc: Office of Diversity and International Programs <odip@ashesi.edu.gh> Subject: Postponed: Immigration Regularization-Ghana Card (Non-Citizen ID) and Residence Permit Importance: High Hello Everyone, I hope this email finds you all well. Kindly note that the date for immigration regularization process has been changed till further notice. New dates will be communicated with you in due time.", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "What to Look out for in the D:Lab This Week", "Message": "Ashesi D:Lab Content Series- Episode 3A.  Hello All,Have you heard of the design thinking process? Do you know what it entails? Would you know how to go about a design thinking project? What? – The Design Thinking Content Series powered by the Ashesi D:LabWho?- Kelvin DegbotseWhen? – Wednesday, 21st February 2018Time? - 2:40 pm - 4:00pmWhere? - McNulty Foundation  Building Design  Lab The topic for this week? -   How Paradigm shifts lead to Innovation The Ashesi D:Lab is introducing a Design Thinking Content Series for the whole Ashesi community and DLAB online users that will introduce the design thinking process to those not familiar with it and serve as a great way to go deeper for those who know of it. The most exciting thing about the DT Content Series is that it is co-developed with but taught by students! About our Speaker:  KelvinKelvin is a visionary living in a student’s body and believes both in the youth and the power to innovate as a people. He loves music and believes life is connected and one must both be both creative and logical to unlock real potential. He is the Founder of Obsessive Innovations a company that works with award wining founders to help them create visionary technology products and empowers youthful talent to innovate,  together with his strong team he admires dearly. He will talk about how paradigm shifts lead to innovation and how anyone at all can be the next Steve Jobs or Elon Musk. Stay tuned for weekly announcements of the content series. Ashesi D:Lab Farm Modelling ProjectB. Hydroponics Project:I. This week, we will be procuring materials for the greenhouse and complete the plumbing works on completed structure with pipes. We will also continue the construction of the greenhouse. Vertical Farming:II. ", "Class": "2"}, {"From": "Joseph Oduro-Frimpong <joduro-frimpong@ashesi.edu.gh>", "Subject": "Ebony Conference (Poster) @Ashesi", "Message": "Dear All: The Center for African Popular Culture at Ashesi University, on Wednesday, 22nd August, 2018, will organize a one-day conference on the late Ebony Reigns. The conference theme is \"'Bad Gal' & 'Madly Talented': What's At Stake in a Nonconformist Public Lifestyle?\". The poster for the conference is attached and I kindly urge you to widely share it within and beyond your networks. Hope you can attend this important conference.  Joseph Oduro-Frimpong, Ph.D. Assistant Professor Department of Arts and Sciences Ashesi University 1 University Avenue, Berekuso, E/R PMB CT3 Cantonments Accra, Ghana joduro-frimpong@ashesi.edu.gh", "Class": "2"}, {"From": "Theresa Dei Dzanie <tdzanie@ashesi.edu.gh>", "Subject": "National Holiday : Founders Day!", "Message": "Dear All, Kindly note that Friday, 21st September, 2018 is Founder’s day and a national holiday. As such there will be no work tomorrow.  Kindly make all necessary arrangements by close of work today. We will resume work on Monday, 24th September , 2018. Have a lovely long weekend.  Best regards, Theresa  ", "Class": "2"}, {"From": "Dzifa Nuer <dnuer@aucampus.onmicrosoft.com>", "Subject": "Parking Arrangements", "Message": "Dear All, In light of our 2018 Graduation Ceremony tomorrow 23rd June, we kindly request that all vehicles currently parked at the Main & Student Carpark be relocated by 3:30pm today. The buses will however be stationed there until close of business. You may park on the shoulders of the road for the meantime (no double parking please!), but there will be officials and attendants available to assist you with parking tomorrow and we urge you to kindly compile with the directions issued. Thank for your kind cooperation. Regards, Dzifa Nuer  ", "Class": "2"}, {"From": "Bridgette Abakah <babakah@ashesi.edu.gh>", "Subject": "Health Fair", "Message": " Dear All,  Health is Wealth  The Ashesi Health team presents to you an opportunity to access your health status at the Health fair this Friday from 9am to 5pm.Do not miss this amazing opportunity with so many services. It promises to be an exciting time.  WELLNESS ROCKS Regards  Bridgette Abakah|Nurse Administrator- Ashesi Health Services  Ashesi University 1 University Ave, Berekuso-E/R PMB CT 3, Cantonments, Accra GHANA Tel: 0501331668, 0248883211 babakah@ashesi.edu.gh  ", "Class": "2"}, {"From": "William Ohene Annoh <william.annoh@ashesi.edu.gh>", "Subject": "Ashesi Economic Lecture Series", "Message": "Dear all,I trust you are keeping well. This email is to inform you about a series of intensive lectures to be delivered by distinguished emeritus professor Tom Campbell at the Ashesi Economic Lecture Series early next year, from Jan 10th – Jan 12th.  Prof Campbell will present lectures on competition policy in the African context including a review of West African business structures: free market, regulated industries, and government monopolies. He will also discuss the influence of international financial institutions on Ghana and Africa more generally. Prof. Campbell will further address the recent telecom mergers in Ghana (Tigo and Airtel) as well as the difference between government regulation of an industry and enforcement through antitrust laws.  He will then make some comparisons with other jurisdictions, in Africa, Europe, and North America.The lecture topics for discussion during this three-day lecture series are:A review of Ghanaian and West African business structures: free market, regulated industries, or government monopolies.1. A discussion of international financial institutions' influence in Ghana and in Africa more generally and how they influenced the competitive landscape.2. The pros and cons of enacting a competition framework in a developing country like Ghana3. A four-time previous guest lecturer at Ashesi, Prof. Campbell has led discussions on African Economic Development and held leadership seminars on constitutional law here at Ashesi. Some other roles he has been engaged in over the course of his career are:Professor of Law, Stanford University, teaching antitrust, regulated industries, and economics.US Congressman and Member of the Federal Judiciary Committee and Subcommittee on Antitrust.Dean, Haas School of Business, UC Berkeley, Berkeley, CA, USA.", "Class": "2"}, {"From": "Michael Quansah <mquansah@aucampus.onmicrosoft.com>", "Subject": "Homecoming 2018 is here!", "Message": "Good afternoon,  On November 24, Ashesi will welcome the entire community  back to campus for Homecoming. This will be a great opportunity to reconnect with alumni, old friends and the rest of the community. As part of this, we have a mix of exciting activities lined up throughout the day, and everyone is welcome to be a part. From Masterclasses to sporting activities to a theatre production, the day promises to be a fun experience.  To get a sense of the day’s schedule and how you can participate, kindly fill out this form.  Additionally, as part of Homecoming, we have arranged nursery and child minding services with fun and kid-friendly activities for those who would like to come with their young children. Just indicate this on the registration form. Transportation arrangements will also be available.  Do shoot me a mail if you need any clarification.  In the spirit of Ashesi! ------------Michael Fiifi QuansahAlumni and Public Relations OfficerAshesi University 1 University Avenue, Berekuso - E/R ", "Class": "2"}, {"From": "Anna Boakye-Yiadom <anna.yiadom@ashesi.edu.gh>", "Subject": "D-iabetes Day Fundraiser", "Message": "Dear all,Hope your week has been off to a great start so far. The month of November is marked world-wide as Diabetes Awareness Month and the Ashesi Leo club is on a mission to make it a campus-wide event.Thus, you are cordially invited to join us this month in our bid to raise awareness and to donate towards this cause. Guess what?? We’ve got some fun ways through which you can help us do just that.  This Wednesday 14th November, we’ll be organizing a Fundraising Event. You can pass by the Amphitheatre and former Akornor(near 218) to donate by paying for a variety of games and activities. The proceeds from these will be going into fighting Diabetes. We’ll have hula hoops, face painting, FIFA, foosball and many more. Stop by and pick up a blue ribbon and some cards to show your support.Join us also on Friday the 16th as we wear BLUE to promote awareness on Diabetes. P.S: Don’t miss out on any of these activities and don’t forget to wear your favorite blue clothes and join us by showing your support every friday.Remember, Issa Blue Friday on the 16th.See you soon.Regards,The Ashesi Leo Club   ", "Class": "2"}, {"From": "Selase Aku Tsiagbe <stsiagbe@aucampus.onmicrosoft.com>", "Subject": "\"A TIME WITH NATIONWIDE\"", "Message": "Dear All,The Health Team and HR will be having a meeting with Nationwide Medical  Insurance on Wednesday, 18th April ,2018 during the campus free time ( 2:30 pm -3:30 pm ).Venue :MPR. Please find below the details  of the meeting,      Nationwide presentation on the new add on services•       Health Talk on Stress Management and its related disease.•       Introduction of Health net Medical Center•Kindly come with all your questions or concerns about the  NATIONWIDE HEALTH INSURANCE services.Thank you.  Selase Aku TsiagbeNursing Officer  |Ashesi Health Services 1 University Avenue, Berekuso , Eastern Region, Ghana.mobile no.0206373405:  0232470373. Email: stsiagbe@ashesi.edu.gh Health line: 0501331668", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "FUTURE OF WOMEN", "Message": "FUTURE OF WOMEN", "Class": "2"}, {"From": "Wayne Gakuo <wayne.gakuo@aucampus.onmicrosoft.com>", "Subject": "D:Lab Welcomes You Back + Don't Miss the 5000 Bottle Challenge!", "Message": "Greetings!Welcome back from the Christmas break. We, at the D:Lab want to wish you a very happy new year! Our very best for 2018! We have a lot in store for you this semester including the following: the first ever blockchain hackathon in Ghana to explore supply chain solutions; initiatives in vertical farming, cosmopolitan farming for diversity and inclusion and other farming activities, some with Arduino-based technologies; a health kiosk for checking your vitals before going to the hospital; a Maker Skills sessions for design making which also serves to expose non-engineering students to the tools in the various engineering labs on campus to build cool things; a fellows program where students and faculty come to design-think & -make their ideas to implementation; a TV-like content generation platform which allows students to learn by teaching concepts to the camera; and many more. See some of our projects here Learn more here The following are some of our activities from last semester which will also give you a sense of how to engage with and support us in our work. Ashesi D:Lab Content Series  led by Isatou JallowFor the second part of the fall semester 2017 the content series program took a different approach.  We shifted from focusing heavily on physical audience to an online platform. This meant that the presenters made videos which were posted on the D:Lab YouTube channel.", "Class": "2"}, {"From": "Design Lab <Dlab@aucampus.onmicrosoft.com>", "Subject": "Ashesi D:Lab Opportunity Desk : Falling Wall Lab 2018", "Message": "For those who signed up for the info session, do not forget that it will be held in LH 216 today at 2.40pm. See you soon.(read the email below for further information) Ashesi D:Lab Team  From: Design Lab  Sent: Monday, April 2, 2018 18:46 To: Ashesi Community <AshesiCommunity@ashesi.edu.gh> Cc: Gordon Adomdza <gadomdza@ashesi.edu.gh>; Hannah Dorkenu <hannah.dorkenu@ashesi.edu.gh> Subject: Ashesi D:Lab Opportunity Desk : Falling Wall Lab 2018 Hello All,  Do you have social enterprise or an idea that has the potential to make social impact? Have you practiced or have the capability to rattle the idea off within \"Three Minute\"?  Then, this may be your opportunity to show what you got!!. The German Academic Exchange Service (DAAD) in cooperation with Impact Hub, the Goethe-Institut and the Institute of Statistical, Social and Economic Research (ISSER) with the support of the Federal Foreign Office of German is organizing a session where you get to pitch your ideas and win amazing prizes.  The Ashesi D:Lab Opportunity Desk is organizing an info session to provide support for person or teams who are interested in participating in this program:", "Class": "2"}, {"From": "Isatou Jallow <isatou.jallow@aucampus.onmicrosoft.com>", "Subject": "NUTRITION TALK (2:40pm -4pm room 217) -WELLNESS WEDNESDAY ", "Message": "31ST OCTOBER , 2018", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "wellness tips", "Message": "wellness tips", "Class": "2"}, {"From": "Ashesi Student Council <studentcouncil@aucampus.onmicrosoft.com>", "Subject": "Are You Ready?", "Message": "Are You Ready?", "Class": "2"}, {"From": "Mohamed Hijazi <mohamed.hijazi@aucampus.onmicrosoft.com>", "Subject": "New domain", "Message": "Dear Support Centre, I recently registered www.meusecab.com and I have hosted material on there.However, it is currently semi-blocked because its a newly registered domain.Can you please unblock this for me so that students can easily access it over AshesiAir?  Meuse Cab - Revolutionizing the way students on campuses in Ghana commute!www.meusecab.comMeuse Cab is revolutionizing the way students on campuses in Ghana commute, and this is already happening at Ashesi. We are currently developing new and exciting programs and packages for our users to meet their unique needs.  Regards,  Mohamed Hijazi  Computer Science 19' | I.T. Intern | Ashesi University College 1 University Avenue, Berekuso E/R | PMB CT 3, Cantonments | Accra, Ghana mohamedhijazi.com | Phone: +233 26 833 0011 ", "Class": "2"}, {"From": "Samuel Mawuli Anagbo <sanagbo@aucampus.onmicrosoft.com>", "Subject": "2018 Ashesi Calendar", "Message": "Dear All, Kindly pass by the reception for a copy of the 2018 Ashesi Calendar.  Thank you. Best Regards, ----------Samuel Mawuli Anagbo  |Customer ServiceAshesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330    ", "Class": "2"}, {"From": "Aba Kaadze Enyimayew <aenyimayew@ashesi.edu.gh>", "Subject": "Ashesi Transport Arrangements", "Message": "Dear All, Kindly note that  all concerns about  bus schedules, arrangements and queries are to be directed to the office of Logistics and Facilities Management effective today, 15th February, 2018. Do contact Anna Reimmer for all information regarding Ashesi buses and vehicles. HR will no longer be handling Ashesi vehicle-related issues. Please adhere to this directive to ensure processes are seamless. Best regards, Aba K. Enyimayew| Director-Human Resources  Ashesi University College1 University Ave, Berekuso-E/RPMB CT 3, Cantonments, AccraGHANAT:+233(302) 610 330 Ext: 1003aenyimayew@ashesi.edu.ghhttp://www.ashesi.edu.gh/ ", "Class": "2"}, {"From": "Billie <frichardson@aucampus.onmicrosoft.com>", "Subject": "Wellness Wednesday,", "Message": "Good morning everyone,A decision has been made to have a “Full on” monthly Wellness Wednesday which will include smoothies, massage, reflexology, fruits, salads, snack, Paninis, healthy sandwiches, performances etc.We will then have a mini Wellness Wednesday on a weekly basis (next one is on the 21st of March), which would consist of fruits and salads only.So, in order for us to ascertain interest and engagement, kindly let me know if you would be purchasing salads on the weekly Wednesdays so the vendor doesn’t disappoints anyone.A simple YES email will do. Thank youBillie RichardsonWellness Coach and CounsellorAshesi University  ", "Class": "2"}]